{
"调查员奇遇牌堆":["作者：幽月琉璃","某不正经的调查员奇遇v1.0.0","署名-非商业性使用-相同方式共享CC BY-NC-SA","由于：为了“创造娱乐效果”，本牌堆中具有部分与规则书相悖之处，请谨慎使用"],
    "调查员奇遇":[
"你发现了一座透露着阴森的气息的古堡，那里有什么生物活动以及人类的痕迹，你怀疑那里有什么惊天阴谋，决定去一探究竟。\n咚咚咚！骰子在空中旋转跳跃，调查员进行了一次检定，\n【1D100=[1d5+95]/[1d95]】大失败！{%D奇遇事件古堡}",
"你所在的城市出现了不少诡异的失踪案，你怀疑这其中有什么惊天阴谋，决定去一探究竟。\n咚咚咚！骰子在空中旋转跳跃，调查员进行了一次检定，\n【1D100=[1d5+95]/[1d95]】大失败！{%D奇遇事件失踪}",
"你听到传闻说城郊的墓园常常传来什么可怕的声音，你怀疑这其中有什么惊天阴谋，决定去一探究竟。\n咚咚咚！骰子在空中旋转跳跃，调查员进行了一次检定，\n【1D100=[1d5+95]/[1d95]】大失败！{%D奇遇事件墓园}",
"你听闻有一个小渔村似乎在举行是什么怪异的祭祀，你怀疑这其中有什么惊天阴谋，决定去一探究竟。\n咚咚咚！骰子在空中旋转跳跃，调查员进行了一次检定，\n【1D100=[1d5+95]/[1d95]】大失败！{%D奇遇事件渔村}",
"你发现了一座鬼气森森的废弃教堂，那里似乎有生物出没的痕迹，你怀疑那里有什么惊天阴谋，决定去一探究竟。\n咚咚咚！骰子在空中旋转跳跃，调查员进行了一次检定，\n【1D100=[1d5+95]/[1d95]】大失败！{%D奇遇事件教堂}",
"你意外得到了一件神奇的物品，{%D奇遇物品}",
    ],
    "D奇遇物品":[
  "那据说是一面古代术士的镜子，你好奇地注视着这面镜子，仿佛想要看出一些什么东西。\n咚咚咚！骰子在空中旋转跳跃，调查员进行了一次灵感检定，\n【灵感检定：1D100=[1d5]/[30+5D10]】大成功！你看到那镜面上似乎出现了什么黯淡的彩色的斑斓，你不知道如何用语言去描述这种东西，你看到那斑斓似乎映在了你的眼前——怪异的幻觉影响了你的感官，又很快地消失，你仿佛在一瞬间看到了一个身影，或者说一群身影，仿佛又看见了什么事物，一种地球上绝不存在的建筑物或者其他什么，但是你来不及辨别，那画面转瞬即逝。\n你的精神受到了冲击，SC1D4/1D10",
  "那是一块神秘的宝石，据说只要对着它冥想，就能看见遥远的过去。\n咚咚咚！骰子在空中旋转跳跃，调查员进行了一次灵感检定，\n【灵感检定：1D100=[1d5]/[30+5D10]】大成功！你看到了 远古时代甚至还不存在生命的海洋，那里居然有一种恐怖的异族生物：剃刀般锋利的牙齿和爪子，目光炽烈的眼睛，和不断起伏的淡蓝色皮肤……\n它看见你了，那是一种无比强烈的饥饿与渴望！它要来了！它来猎杀你了！",
  "那是一张诡异的画像，上面绘画着一个由触手、脸庞、多面体以及肉块和附肢构成的可怖形象。\n咚咚咚！骰子在空中旋转跳跃，调查员进行了一次灵感检定，\n【灵感检定：1D100=[1d5]/[30+5D10]】大成功！你产生了诡异的幻觉，仿佛有什么狂风在耳边呼啸或是上面畸形的哀号，那画像上的“形象”动了起来，好像要从羊皮纸上脱离出来一样……\n你看到了混沌，看到了无以描述的恐怖，那是不可名状的存在！匍匐蠕行之混沌！Nyarlathotep！\nSC1D10/1D100",
  "那是一座怪异的雕像，据称是一位艺术家发疯前的作品。\n咚咚咚！骰子在空中旋转跳跃，调查员进行了一次灵感检定，\n【灵感检定：1D100=[1d5]/[30+5D10]}】大成功！你仿佛听到了令人感到恐惧的呼唤声，隐隐约约看见一座由巨大的、大到不可能来自地球的绿色石材建造的非欧几里得几何形体构成的海底城市，还有高到令人目眩的巨石雕刻，宏伟的石像和华丽的浮雕;整个城市散发出强烈的不洁气息……\n“Ph'nglui mglw'nafh Cthulhu R'lyeh wgah'nagl fhtagn！”\n你出现了幻觉，看见了由章鱼、蝙蝠、大象和人类等混合而成的巨大的绿色“生物”。SC1D10/1D100"
    ],
    "D奇遇事件古堡":["你正靠近古堡的大门，忽然听到了一阵“Tekeli-li!Tekeli-li!”的声音，一只看上去就像柏油构成的巨大史莱姆把你吃进了肚几里。","你推开了古堡的大门，大厅内是一副可怕的画面：怪异的符号被涂鸦在地面和柱子上，满地都是破碎的、被撕咬过的血肉模糊的尸体。\nSC1D3/1D10【1D100 =100】大失败！\n调查员失去了10点理智，你进入了不定性疯狂，你被吓死了。","你在废弃的古堡里发现了一个地窖，没想到地窖里几个行为怪异的黑袍人正在举行秘密聚会。\n为首的黑袍人对你伸出了手，你的胸口破裂炸开，冒着热气的心脏出现在了那个黑袍人的手中。","你在古堡里发现了一个可怖的雕像，那种怪异的形象让你感到发自内心的恐惧。\n调查员进行灵感检定【1D100=[1d5]/[30+5D10]】大成功！\n你出现了幻觉，仿佛那座雕像所描绘的可怖存在出现在你的面前。\n【SC1D10/1D100 =100】！你疯了！","你正靠近古堡的大门，忽然听到了一阵“Tekeli-li!Tekeli-li!”的声音，一只看上去就像柏油构成的巨大史莱姆把你吃进了肚几里。"],
    "D奇遇事件失踪":["你循着线索找到了城外的墓园，却看到一只有着“胶皮”和“利爪”的“狗头人”正在享用一具血肉模糊的尸体。\n你被吓呆了，而且显然打扰了它的兴致，它用那剃刀一般锋利的肮脏爪子将你解剖了！","你私下的调查行为被警署发现了，他们怀疑你与失踪案有关，你被拘留在了警署内！","你循着线索找到了远郊的森林，却看到黑夜之中黑色的、有好多绳子的、粘粘乎乎的、像树似的东西向你移动过来。\n那“东西”张着巨大的嘴，从嘴里不断滴下绿色的粘液，你被吓得不敢动弹，成为了一名合格的好味。","你循着线索找到了一座废弃的工厂，厂房里空空荡荡，你一无所获。\n正当你打算离开时，一个巨大的、肥硕的、缝合怪似的、缠着绷带、散发着腐臭的怪物举着一个巨大的榔头对着你当头一棒……"],
    "D奇遇事件墓园":["你趁着夜色来到城外的墓园，却看到一只有着“胶皮”和“利爪”的“狗头人”正在享用一具血肉模糊的尸体。\n你被吓呆了，而且显然打扰了它的兴致，它用那剃刀一般锋利的肮脏爪子将你解剖了！","你趁着夜色来到城外的墓园，意外地见到一个古怪的黑袍人正在一座坟墓上吟唱着可怖的咒文\n——他显然发现了你，你被他他用一种古怪的麻药控制了，保留了意识却无法行动。\n那个黑袍人将你活埋到了棺材里，之留下一个呼吸孔，吟唱着令你感到可怕而熟悉的咒文……","你趁着夜色来到城外的墓园，还没什么收获就被不知从何袭来的腥风和黑影击晕在地\n不知道多久，你在一个肮脏的管道一样的地方醒了过来，借着昏暗的光线惊恐地发现自己的皮肤变得皱褶而如同胶质，手上长出了可怖的利爪……","你几次前去调查都无功而返，这一次却遇上了警署的探员\n——他们怀疑你是偷盗尸体的嫌疑犯，把你抓到了警局！"],
    "D奇遇事件渔村":["你趁着夜色潜入渔村，不曾想却发现了惊天大秘密！\n这是一村的混血深潜者——他们已经发现你了！\n为了保留自己的性命，你不得不被迫为他们配种以谋求生存。\n（PS：嗯，给一些想要老牛吃嫩草的……）","你趁着夜色潜入渔村，不曾想一头撞上了他们的献祭仪式。\n这是个信奉拉莱耶之主的村庄，你被他们抓去做了他们的天父克苏鲁的好味！","你伪装成游客进入村庄中调查，没想到进入遇到了另一伙邪教徒前来寻仇。\n那群披着黄袍的怪人吹着口哨召唤出了从天而降的有着和乌鸦、鼹鼠、兀鹫、蚂蚁等生物特征的像杂种似的有翼生物。\n哦，不，你这个倒霉蛋成了俩兄弟争斗的牺牲品！"],
    "D奇遇事件教堂":["你在教堂一个昏暗的房间里发现了一个祭坛，祭坛上有一个黑匣子，黑匣子里是一个4英寸高的红黑相间的水晶多面体，由7个悬臂托着。\n你合起了黑匣子的盖子，想要把它带走研究——哦，不！那个在黑暗中类似蝙蝠的肿胀怪物是什么？\nSC1D10/1D100","你在教堂的静室里发现了一具穿着着教士衣物的骸骨，你正打算上前摸尸，那骷髅忽然跳了起来，一嘴咬在你的裤腿上。\n你被吓得落荒而逃，一不小心脚下一空，跌入了地下的暗室——\n空中旋转540°，脑袋着地……","你在夜色之中溜进了废弃的教堂里，没有任何发现。\n就在你即将离开那里时，你仿佛听到了一阵令人作呕的冷笑声。\n你感觉你被什么看不见的东西“钩”住了，又被一个吸盘一样的口器咬住……\n那是什么怪物！那个隐形的怪物正在贪婪地吮吸你的血液——你感到你的力量正在缓慢地流逝……"]
}
