main_deck = {
[[财神爷灵签 第一首 甲子 唐太宗登位享受太平
日出便见风云散 光明清净照世间 一向前途通大道 万事清吉保平安
注：一生清安有好尾
解曰：功名：得意 月令：吉 求财：有利 疾病：不畏
婚姻：好成 胎孕：生男 种作：好利
分儿：成好 田宅：好吉 风水：好安
解说：只要太阳一出来。一切就会云散。只要光明一普照，世间便見清净太平。前途是光明正大。只林努力前进，正是条条大路通心窍。神明自会保佑您，万事学士服吉平安。
抽到此签：表示谋望难成，但不可灰心，只要契而不舍，继续追求，认真努力，自然有成功的一天。
求财交易：利润轻微
问功名：有志竟成
问婚姻：有情人终成眷属
问诉讼：若蒙冤终获平反，如系民事以和为贵，大命平安。
问移居：得安。
问疾病：终会痊愈。
]],[[财神爷灵签 第二首 甲寅 唐太宗选武氏为才人
于今此景正当时 看看欲吐百花魁 若能遇得春色到 一洒清吉脱尘埃
注：先吉后凶
解曰：功名：后科 月令：吉 求财：小利 疾病：危险许愿
婚姻：不成 胎孕：生女 种作：早好
分儿：不可 田宅：平安 风水：好
解说：冬天到 了，春天还会远吗?你看看周围的景色多美，那百花正在含苞待放，娇娇欲滴。只要那春光一到，立刻会有一番气象。正是春到碧桃之上，花放满城锦绣，莺歌绿柳楼前，春生大地文章。
抽到此签：
表示目前正是艰困的时候。但如能突破，接着而来的，必须鸿图大展。故谋事失败不必灰心，东山再起，必获成功。
问功名：希望不大，好好充实自己，等待秋天再进。
问婚姻：很有希望，好消息快到。
问疾病：新春可愈。
外出：旅行春天最好。
迁移或变动职位：目前不宜。
求财、交易：眼光要放远，不可只求近利。
问诉讼：要求和
问移居：平平。
]],[[财神爷灵签 第三首 甲辰 沈万山正德君双斗宝
劝君把定心莫虚 天注姻缘自有余 和合重重常右庆 时来终遇得明珠
注：假得真 事斟酌 有吉祥
解曰：功名：有 月令：吉 求财：大利 疾病：险
婚姻：可成 胎孕：生男 种作：晚吉
分儿：不可 田宅：吉 风水：大吉
解说：劝你不要再三心两意了，姻缘天注定，是不能勉强的。所谓有缘千里来相会。天作之合，佳偶天成，缘份一到，你一定会遇到你追寻的明珠。
抽到此签：
问婚姻：乃告诉当事人，情要专，自然有情人终成眷属。
问事业：乃告诉当事人要定性，不可换来换去。所谓十做九不成。即使受了一次挫折，要再接再厉，必获成功。如果稍受挫折就放弃不做，就永远没有成功之时。
问求财：外出有利。
问功名：尚须努力。
问疾病：情况不稳。
问移居：可得平安。
问六甲：先男后女。
]],[[财神爷灵签 第四首 甲午 李太白成仙位
风恬浪静可行船 恰是中秋月一轮 凡事不须多忧虑 福禄自有庆家门
注：清福安乐
解曰：功名：得意 月令：秋吉 求财：小利 疾病：不畏
婚姻：好 胎孕：生女 种作：有利
分儿：好 田宅：吉 风水：吉
解说：风平浪静，船行一帆风顺。正象中秋明月，圆满皎洁。凡事不必多忧虑，福禄自有不必求。时来运转，自然喜气盈门。这是一首很幸运的签诗，表示一切如意顺调，圆满达成。如果是一位应考的人抽到此签，是金榜题名的好兆。
抽到此签：
问功名：功名有望，福禄全以外。
问诉讼：表示得直。
问疾病：可以痊愈。
问婚姻：表示幸福美满。
问移居：一切安好。
]],[[财神爷灵签 第五首 甲申 孙膑假颠
只恐前途明有变 劝君作急可宜先 且守长江无大事 命逢太白守身边
注：有贵人吉
解曰：功名：未成 月令：不吉 求财：平平 疾病：占卜
婚姻：缓可 胎孕：生男 种作：早平
分儿：结冤 田宅：吉 风水：不吉
解说：只恐怕前去途中命有变故，劝你莫着急。做事既然抡不着先机，就暂时守住长江。看看命内有太白金星保佑自然不会有什么大事发生。这首签诗暗示，做事要有先见之明。如果时机错过了，就不宜亡动。譬如开工厂，当景气好时，你才开始设厂，等到你生产时，景气已经衰退，你就吃亏了。
抽到此签：表示求谋不宜过急，所谓欲速则不达。且须等待时机。
问婚姻：对方可能有意中人，成功希望不大。
问诉讼：则和解为宜。
问疾病：宜多祷告神佛保佑。
问功名：有希望，但不可心躁。
问求财：平平
问做事业：宜按部就班，不可好高骛远，才不至失败。
问移迁或变动职位：
]],[[财神爷灵签 第六首 甲戍 陆逊入石头阵
风云致雨落洋洋 天灾时气必有伤 命内此事难和合 更逢手足出外乡
注：先受惊 后则吉
解曰：功名：不第 月令：有灾 求财：无利 疾病：凶
婚姻：不吉 胎孕：生男 种作：损
分儿：不可 田宅：不可 风水：未妥
解说：风云招来暴雨，一片汪洋，天灾气候造成了伤害。一个人命里无时莫强求。既然没有和合的希望，就不必再出外奔跑了。
这首诗，告示当事人，命里有时终须有，命内无时莫强求。强求也是没有用的。就象那不测风云造成的天灾，乃是一种不可抗力的灾害，是莫可奈何呀。
这首签诗如果是占问合伙，乃是不吉之兆。因诗中有“命内此事难合伙”之句。
据XX君说：他与人合伙设立工厂时曾到寺庙抽得此签，当时想作罢，后因筹备已久，所费不小，乃勉强凑合。后来该工厂合伙人，竟将该厂账款拐逃国外。焉应了：“更逢一足出外乡”之句。
抽到此签：
问求财：不吉，无利可图。
问婚姻：莫强求，宜另找对象。
问谋事：只要平心静气，顺其自然，不可强求，自然祸去福来。
问诉讼：宜和解，莫信谗言。
问迁移或变动职位：不可妄动
]],[[财神爷灵签 第七首 乙丑 王昭君贬冷室
云开日出正分明 不须进退问前程 婚姻皆由天注定 和合清洁万事成
注：一时喜 后艰难
解曰：功名：有 月令：中吉 求财：合有 疾病：半吉
婚姻：不可 胎孕：后男 种作：好
分儿：好 田宅：中 风水：平平
解说：云开月出，大方光明。不须再间进退，可以直奔前程。婚姻皆由天注定好的，只要是天作之合，一定美满。
抽到此签：如果问运途，可以说是“否极泰来”。过去的乌云已经散开了，被遮的月亮重放光明。就是坏运已过，现在已迈入好运了。
问婚姻：表示佳偶天成，有情人终成眷属。此签做事可以成功。
问求财：开始见利。
问出外移居：则不吉。
问疾病：有惊无险。
问诉讼：和解最好。
问功名：少年成就，老无。
问失物：月光在，月暗难寻。
问六甲：先男后女。
]],[[财神爷灵签 第八首 乙卯 孔明陇西割麦
禾稻看看结成完 此事必定两相全 回到家中宽心坐 妻儿鼓舞乐团圆
注：安乐无忧
解曰：功名：有 月令：安 求财：利 疾病：老危
婚姻：成 胎孕：先男 种作：好
分儿：可 田宅：吉 风水：吉
解说：看看田里结成了稻穗，知道今年又丰收了。辛勤的耕耘，必有丰盛的收获。这事是两相关的。如果没有昔日的流汗，那有今天的收成。
抽到此签：大抵是先苦后甘，否行极泰来。
问婚姻：表示有情人终成眷属。
问事业：要脚踏实地去做，不可做投机，投机必失败。
问功名：在秋天有希望，如果是冬天就待明年，一再充实自己。
问出外：不可。
问失物：不日即归
问移居：得安。
]],[[财神爷灵签 第九首 乙巳 太祖遇乌延赞
龙虎相隋要深山 君尔何须背后看 不知此去相爱误 他日与我却无关
注：美中不美
解曰：功名：无 月令：未遂 求财：难 疾病：辰日好
婚姻：不吉 胎孕：生男 种作：不可
分儿：不可 田宅：不吉 风水：移吉
解说：你我好比龙虎斗，却一起在那深山里，没有任何顾虑。却不知这种相爱乃是一种错误的决定，恐怕他日会变成你我无干的局面。
这首签待暗示当事人，如果两个志趣不合的人，勉强凑合一定无法持久。
抽到此签：
问婚姻：难偕白头之兆。
问合伙做生意：最后会拆伙，而且闹得不愉快。
问谋事：因竟争的人太多，恐怕难遂意。
问求财、问功名：者是一样很难。
问出外移居：旅行变换职位都不吉，宜静守不宜妄动。
问六甲：生男贵气
问失物：难寻。
]],[[财神爷灵签 第十首 乙未 李便奇救主
花开结子一半枯 可惜今年汝虚度 渐渐日落西山去 劝君不用问前途
注：主无尾景
解曰：功名：会 月令：不吉 求财：空 疾病：老危
婚姻：不好 胎孕：生女 种作：不利
分儿：不可 田宅：半收 风水：不可
解说：开花结果却一半落空，收获不多。可惜你今年光阴算是虚度了。太阳渐渐西落去，俗语云：“太阳虽好近黄昏”劝你看开一点吧。还是不要再奔波了。
这首签诗暗示当事人徒劳无功，虽然过去有过一段辉煌的日子，但结果成就却不多。
有一半以上是虚度光阴了。所以签诗劝你，还是脚踏实地，作一些实在的事，何必去 空忙一场。
抽到此签：
问求财：无。
问婚姻：因签诗有”结子一半枯，今年汝虚度”之句。恐怕难成。
问六甲：生男，女贵气。
问出外：正如签诗所说往返空劳，所以不好也。
问移居、变动职位：均不吉。
问失物：难寻。
]],[[财神爷灵签 第十一首 乙酉 大鹏鸟转世为岳飞
灵鸡渐渐见分明 凡事且看子丑寅 云开月出照天下 郎君即便见太平
注：先惊后安
解曰：功名：有望 月令：平 求财：合好 疾病：许愿
婚姻：平 胎孕：生男 种作：平
分儿：晚吉 田宅：可 风水：吉
解说：灵鸡一啼，天渐渐亮了，凡事就看明天吧。云开月出，光照天下。你便可看到太平景象了。
这首签诗的寓意是黑夜过去了，鸡一啼黎明就接着来了，一个人一生不会都是走霉运的。当时来运转，正如云开月去，会有一翻新气象出现。
抽到此签：是苦尽甘来之兆。灵鸡可以当做八月解说。子丑寅可做月或日解说。
问做事、求财：渐渐有希望了。
问功名：十年寒窗有出头的日子。
问婚姻：有情人终成眷属。
问六甲：先男贵气
问移居：平安。
问出外：可行。
问失物：子丑寅日寻在。
]],[[财神爷灵签 第十二首 乙亥 梅良玉陈春生中途
长江风浪渐渐静 于今得进可安宁 必有贵人相扶助 凶事脱出见太平
注：先凶后吉
解曰：功名：有 月令：贵人 求财：后得 疾病：贵人
婚姻：平平 胎孕：后男 种作：平平
分儿：吉 田宅：平平 风水：吉
解说：长江的风浪渐渐平静了，现在船只可以前进，并且可以安宁无事了。只要积极前进，一定会有贵人来相助，即使遇到困境也能逢凶化吉，化险为夷。
抽到此签：先凶后吉，逢凶化吉之兆。如有困难，现在慢慢可以化解。不必忧虑，否极泰来。风浪终会过去的。一生多贵人扶助，所以常能逢凶化吉。
问求财：小有，大命(本命)不畏。
问功名：有贵人提拔。
问婚姻：只要媒人出面，婚谈可成。
问出外移居：旅行均吉。
问诉讼：可逢贵人而化平安。
问失物：要急寻。
]],[[财神爷灵签 第十三首 丙子 汉李广父子阵亡
命中正逢罗孛关 用尽心机总未安 作福问神难得过 恰是行船上高滩
注：尾景不吉
解曰：功名：后成 月令：不吉 求财：难 疾病：求神
婚姻：不吉 胎孕：险男 种作：不利
分儿：不可 田宅：不吉 风水：凶
解说：命中正遇到“罗孛”凶星的关头，虽然你用尽心机也避免不了。就是问神祈福，还是躲不过去。正象船遇陷沙滩，进退不得。
抽到此签：表示你目前正在进退维谷的时候。老人抽到此签表示一生空费心机，老来已无甚希望。若年轻人抽到此签，不必难过，正式考验你的时候，只要你能克服困难，自有光明的前途。
问功名：还要充实自己，目前希望不大。
问婚姻：缘份未到，恐难成，不宜勉强。
问六甲：生男贵气。
问出外移居：不吉。
问疾病：须谨慎医治，年轻人不畏。
问诉讼：恐会拖尾。
问失物：未日再拖人寻有。
]],[[财神爷灵签 第十四首 丙寅 王太君双生太子
财中渐渐见分明 花开花谢结子成 宽心且见月中桂 郎君即便见太平
注：积德行善好尾
解曰：功名：有望 月令：月光好 求财：有合好 疾病：月半好
婚姻：成 胎孕：生男 种作：好利
分儿：平平 田宅：可居 风水：中吉
解说：财运来临渐渐显明，正向那花开花谢后，结成江树的果实。不必焦急，且宽心等待中秋节到来，你所等待的郎君，将来与你共渡对子太平的好日子。
抽到此签：
问事业：表示你的事业已有转机，你的财运也将慢慢到来。即使目前财利不显，但只要耕耘，必有收获。只怕不肯用心隋世浮沉。就象那花开花谢，月亮盈亏，得失相伴。
功名也是一样，如果不去充实自己，只想碰运气，是难得有成就的。
问婚姻：有情人终成眷属之兆。婚谈可成。
问出外：平平。
问移居：平安。
问诉讼：只要出以至诚，必能平安无事。能破财消灾为上策。意气之争，得不偿失。
问失物：往西方寻，大命月半不畏。
]],[[财神爷灵签 第十五首 丙辰 姜太公做生理
八十原来是太公 看看晚景遇文王 目下紧事休相问 劝君且守待运通
注：后得安闲
解曰：功名：晚成 月令：老通 求财：后得 疾病：八十月吉
婚姻：不可 胎孕：生男 种作：迟种
分儿：不可 田宅：中吉 风水：埋金吉
解说：姜太公到八十岁，仍然怀才不遇。只好在渭水河钓鱼等待时机。一直等文王访他的贤名来拜访他，才时来运转，受到文王的重用。你目前的情况，跟太公的一样。请不必多问还是劝你学姜太公的作法，等待运气亨通时。
抽到此签：表示目前做事总不如意。但别灰心，这不是因你不努力，而是时机未到。目前最重要的是充实自己。只要有真才实干，必有重用你的时候，商不会被埋没的。
问功名：不必急躁，你是属于大器晚成型。
问婚姻：是属于晚婚命。
问移居：还是时机要等待，一动不如一静。
问出外：无利可图。
问诉讼：以和为策。
问大命：渐渐愈。(大命意为本命)
]],[[财神爷灵签 第十六首 丙午 夏侯惇中箭惇
不须作福不须求 用尽心机总未休 阳世不知阴世事 官法如炉不自由
注：凡事守 有天福
解曰：功名：无 月令：未通 求财：无 疾病：损
婚姻：难 胎孕：生男 种作：不可
分儿：不吉 田宅：平 风水：凶
解说：福份不须去寻求，也不须去制造。你尽管用尽心机想去追求，结果还是失望，休想得到。因为阳世里的人，不知阴间善恶果报的事。一个人在阳世所作所为，到了阴间都要接受审判。作恶多瑞的人，估要下地狱受苦刑，任不得你自由。
抽到此签：提示人，一切运气好坏，不是祈求制造，乃是上天的安排。用以报偿你的心田好坏。所谓“积善之家必有余庆，积恶必有恶报。”是时日未到，不是天理不报。因此如果目前未得好报，做事营谋未能遂意，求财没有得到，不必强求，也不必怨叹，只有多努力积善因，终必感动上天，赐给你好运气。
问目前运途：沉浮不定。
问功名：难有进展。
问婚姻：缘份未到，谈婚难成。
问六甲：先男后女。
问出外移居：均不吉。一动不如一静。
问疾病：遇辰未日不畏。
问诉讼：须要修心，不可意气用事， 以和解为宜。
问失物：难寻。如果辰未日可寻到。
]],[[财神爷灵签 第十七首 丙申 庞涓马陵中箭
旧恨重重未改为 家是祸患不临身 须当谨防宜作福 龙蛇交会得和合
注：先吉后凶
解曰：功名：辰己年 月令：辰己吉 求财：失 疾病：老危
婚姻：龙蛇 胎孕：生男 种作：平
分儿：是非 田宅：平 风水：凶
解说：回忆往事心头旧恨重重未消除。正如家中发生灾祸，虽然没有临到本身，但此恨绵绵无尽期。你虽要谨慎提防再有事故发生。再好多做好事。只要有善因必能逢凶化吉。而且在辰巳交会的时候，得到很圆满的结果。
抽到此签：暗示即使经历了无数次的失败，无数次的辛酸，无数次的恨事，但不必去记挂它。还是东山再起，再振作努力去干，必有出人头地的一天。
此签有贵人，但必须心田好。秘以签诗说“须当谨防宜作福”，只要心地善良必能逢凶化吉，化险为夷。并得天赐福运。
问求财：
问功名：只要充分准备，即使一次挫折，算不得什么，再次必取。
问婚姻：缘份已到，婚谈可成。
问六甲：先男后女。
问出外：不吉，列利可图。
问移居：随意。
问大命：有贵人。
问诉讼：辰己日可完局。
]],[[财神爷灵签 第十八首 丙戍 邵郎遇玉郎配
君问中间此言因 看看禄马拱前程 若得贵人多得利 和合自有两分明
注：先凶后吉
解曰：功名：有 月令：亨通 求财：得 疾病：有贵人
婚姻：成 胎孕：生男 种作：可
分儿：平平 田宅：平平 风水：吉
解说：如果你问这中间的因果，请看看“禄马贵人”帮助你前程的发展。就可领悟，如果你能得到“贵人”帮助，自然一切顺利，一切都能圆满和合。
抽到此签：表示你心田好，善心自有报。做事求财自然会有贵人帮助，使你成功。
问求财：不多。
问功名：是大吉利之兆， 可以积极去发挥，表现你的才能。你的前程是大光明的。
问婚姻：是侍偶天成的好预兆，婚谈可成。有睛人终成眷属。可喜可贺。
问六甲：生男。
问出外移居：均吉。有贵人帮助。
问疾病：拖而后须有贵人出现才会痊癒的希望。
问诉讼：拖尾和解为策。不宜再拖。
问失物：月光在。
注解：“禄马贵人”主大进官禄，财帛、人丁兴旺、百事俱吉祥的贵人，可向文昌帝君祈求。
]],[[财神爷灵签 第十九首 丁丑 苏秦不第
富贵由命天注定 心高必定误君期 不然且回依旧路 云开日出自分明
注：先苦后甘
解曰：功名：后得 月令：平平 求财：旧好 疾病：不畏
婚姻：未妥 胎孕：生女 种作：平平
分儿：害 田宅：新不吉 风水：平平
解说：俗云：生死由命，富贵在天。一个人的穷通福祸富贵贫贱，都是上天安排，命里注定。所谓“命里有时终须有，命里无时莫强求。”如果你期望太高，必定会大失所望。而且耽误了你的佳期。既然此路不通，何不回头走旧路。说不定还能云开月出，见到光明的前途。一个人当然虽要有开创局面的雄心。但野心太大超过了本身的能力，只想好大喜功，反会招致失败，
还有“谋事在人，成事在天”。同样的才能，同样的努力，并不一定有同样的成功。这里面当然有“命运”的因素在作崇。所以明理的人，不要太奢求。
抽到此签：
问事业，创新不吉，守旧安泰。
问求财：不多。若财多则身弱，反为不吉。
问功名：难得。
问婚姻：平正。
问六甲：先女后男。
问出外移居：都不吉。
问大命：险。而月光就渐渐好。
问诉讼：事宜拖尾。
问失物：月光在。
]],[[财神爷灵签 第二十首 丁卯 朱盘冷山寻夫
前途功名未得意 只恐命内有交加 两家必定防损失 劝君且退莫咨嗟
注：劳苦后安
解曰：功名：未得 月令：未通 求财：失利 疾病：冲犯
婚姻：不合 胎孕：生女 种作：不可
分儿：难养 田宅：争端 风水：有损
解说：前途功名未能得意发展，恐怕是因为命里还有交错坎坷的运辰。家庭不可分两家。如果分两家一定会有损失。必须防备。所以劝你还是退守本份，不必唉叹气。
抽到此签：警告当事 人，要注意家庭问题。不要只顾事业，而忽略了家庭。更不能金屋藏娇，以免家庭革命。这是走桃花运的预兆，故须谨慎防美人计。
问求财：到目前都不能如愿。若有也是前手来后手空。不宜过分强求。防破财或劫财。
问功名：待来年，仿年恐无希望。
问婚姻：婚谈如无感情，不易成功。婚姻须防有变。家庭运也不吉。
问六甲：先男后女。
问出外移居：均不宜妄动。
问疾病：险。如未日过不畏。
问诉讼：有拖尾的可能。
问失物：难寻
]],[[财神爷灵签 第二十一首 丁巳 观音收大鹏鸟
十方佛法有灵通 大难祸患不相同 红日当空常照耀 还有贵人到家堂
注：危险帮助
解曰：功名：有望 月令：渐安 求财：多利 疾病：不畏
婚姻：不好 胎孕：后男 种作：吉
分儿：是非 田宅：中 风水：平平
解说：佛法无边，神通广大。只要你信仰虔诚，即使遭遇大难祸患，结局亦自不同。所谓“吉人天相”，自然逢凶化吉，化险为夷。何况阳光普照之下，又有“贵人”到家里保佑你呢。
抽到此签：表示 你有困难，但只要你能诚敬做事，自然会克服困难。但只要你的毅力和努力如何遭遇困难，人人都会有，只要有信心与努力才会成功。
问求财：先难后易。
问功名：能修善自有神助。
问婚姻：有诚心有媒人可成。
问六甲：生男。
问出外：平平。
问移居：可行。
问疾病：有贵人。
问诉讼：先凶后吉。
问失物：即寻可得。
问家庭：中和。
]],[[财神爷灵签 第二十二首 丁未 姜太公遇文王
太公家业八十成 月出光辉四海明 命内自然逢大吉 茅屋中间百事亨
注：先凶后吉
解曰：功名：晚成 月令：老吉 求财：利少 疾病：危险
婚姻：晚吉 胎孕：生女 种作：好
分儿：晚好 田宅：可 风水：金吉
解说：姜太公到八十岁才成家立业，你何必急呢。一个人的机会一到，就象那云开日出一样，光辉马上普照天下，大放光明。命中时机若到，自然飞黄腾达，大吉大利。在时机未到前，就暂时隐守在家里等候。这样反可以百事顺利。
抽到此签：表示时机未到，必须等待。一个人如果机会未到要硬出头，只会自寻烦脑。象那姜太公虽是一位人才，但到了八十岁才遇到文王，才真正有表现的机会。你可能也是属于“大器晚成”型。
问谋事：目前恐怕尚不如意，但只要持之有恒，努力充实自己，必有被重用的一天。
问求财：财运不尚不多。
问功名：晚成。
问婚姻：有情人终会成为眷属。
问六甲：生男。
问出外：平平。
问移居：吉。
问疾病：会痊愈。
问诉讼：和解为宜。
问失物：月光寻在。
]],[[财神爷灵签 第二十三首 丁酉 姜太公钓鱼
欲去长江水阔茫 前途未遂运未通 如今丝纶常在手 只恐鱼水不相逢
注：尾景大吉
解曰：功名：未遂 月令：不佳 求财：会利 疾病：危险
婚姻：情少 胎孕：生女 种作：不利
分儿：两失 田宅：平 风水：别寻
解说：要想到长江去垂钓，但只见汪洋一片，使人感到前途茫茫，不知何去何从。手拿着钓竿长线，痴痴的等待。只恐怕鱼儿与水无缘不会来了。
这是一首比喻的签诗。鱼水用来形容君臣之相得，也用来比喻夫妻的相爱。用垂钓象征求取功名。
抽到此签：
问求财：目前尚欠理想。
问功名：有怀才不遇之感，还要等待时机。目前恐怕难有被重用的机会。
问婚姻：如果 有中意的对象，就钓信吧。莫等待让鱼儿都跑掉了。
问六甲：生男。
问出外：无利可图。
问移居：不可。
问疾病：平安。
问诉讼：先输后胜。
]],[[财神爷灵签 第二十四首 丁亥 杨文广征南闽
月出光辉四海明 前途禄位见太平 浮云散退终无事 可保祸患不临身
注：得失相交
解曰：功名：有 月令：月光好 求财：如浮云 疾病：不畏
婚姻：好 胎孕：生女 种作：平平
分儿：小不可 田宅：平平 风水：平平
解说：俗云“十年寒窗无人问，一举成名天下知”。锦绣前程，就如月出光辉四海皆明，人人仰望。那坎坷的过去，就象乌云般被扫而光了。此去太平无事。可以不必再忧虑祸患临身。
这是一首苦尽甘来的签诗。有一分耕耘，必有一分收获。过去对苦难的奋斗，终得发出胜利的光辉。没有过去的努力，那来今日的成就。
抽到此签：表示有志者事竟成。天下没有不劳而获的事。
问求财：有是有，但不能发大财。而想发大财，尚须靠机会。
问功名：只要自己有实学，必可高中无忧。不愁没有职位。只怕你不具有胜任职位的才能，不必东奔西跑。
问婚姻：前困难曲折多，后来双方家长均表示同意。喜出望外，有情人终成眷属。
问六甲：先女后男。
问出外：平平。无利可图。
问移居：平正。
问疾病：不畏。
问诉讼：和解为吉。
]],[[财神爷灵签 第二十五首 戊子 刘文龙别妻
总是前途莫心劳 求神问圣枉是多 但看鸡犬日过后 不知作福事如何
注：小吉受凶
解曰：功名：会望 月令：八九平 求财：少利 疾病：不畏
婚姻：平平 胎孕：后女 种作：不可
分儿：不可 田宅：平平 风水：平平
解说：前途有命运安排，你只要尽其在我去努力奋斗，不必劳心去求神问卜。那只是枉费精神。你要解决的事，只要等待“酉戍”日过了以后就会有消息的。不必再去祈福求神。
这首签诗告诉当事人，解决问题唯有靠自己。求神问卜解决不了问题。酉为鸡，戍为狗，故关健在酉戍日后，即能获得答案。
抽到此签：表示一动不如一静。
问求财：复天比较好。
问功名：唯有靠自己多用功，如果 没有充分的准备，只靠运气或神佑是没有希望的。
问婚姻：要男女双方真诚相爱，情投意合， 可成为眷属。
问出外移居：均不好。
问疾病：遇秋不妨。
问诉讼：宜和解。
]],[[财神爷灵签 第二十六首 戊寅 吕蒙正中状元
选出牡丹第一枝 劝君折取莫迟疑 世间若问相知处 万事逢春正及时
注：先受苦 后贵人
解曰：功名：有 月令：春吉 求财：利 疾病：有贵人
婚姻：吉 胎孕：男 种作：早吉
分儿：平 田宅：中 风水：可
解说：诗云“有花堪折直须折，莫待无花空对枝”。已经评选出来的第一枝牡丹花，美丽动人。劝你不要迟疑，快把机会折取下来。如要询问天下知音在何处，大地逢春是时机。一切行乐须及时，莫待春去空惆怅。
这是一首比喻的签诗，告诉当事人莫错过了时机。
有人说：“制造机会的人，是第一流人才。把握机会的人，是第二流人才。丧失机会的人，是不入流人才。”希望你抽到此签时，快把握机会。最少也得做到第二流人才。不要把机会错失，成了不入流人才。
抽到此签：
问求财：财运有，但须把握。
问婚姻：是天赐良缘。
问六甲：生男贵气，女不然。
问出外移居：均吉。营谋做事要积极主动，不可犹豫不决。
问疾病：神佑不畏
问诉讼：必定和解。
问失物：寻有。
]],[[财神爷灵签 第二十七首 戊辰 武吉遇太公改封
君尔宽心且自由 门庭清洁家无忧 财宝自然终吉利 凡事无伤不用求
注：有是非 好尾景
解曰：功名：且待 月令：后月 求财：大利 疾病：改吉
婚姻：吉 胎孕：生男 种作：好
分儿：好 田宅：吉 风水：吉
解说：劝你不必为俗事操心，且宽心自由自在地生活。只要家里平安无事，财利自然源源而来。凡事命里有时终须有，命里无时莫强求。任何事情顺其自然最好。
抽到此签：告诉当事人，一切听众命运安排，不必忧虑操心。
问求财：恁各人财运不同，轻有就好，不必妄求。
问功名：且宽心等待，如有真才实力，不会让你永远埋没。终有让你发挥的一天。
教你还是待价而沽。
问婚姻：平和之良缘，不必操之过急。诚恳与耐心，是成功的条件。
问出外：可行。
问疾病：不畏。
问诉讼：平和。
问失物：自回。
]],[[财神爷灵签 第二十八首 戊午 霸王自刎乌江
于今莫作此当时 虎落平洋被犬欺 世间凡事何难定 千山万水也迟疑
注：先吉后凶
解曰：功名：会 月令：不遂 求财：有微 疾病：重难
婚姻：不对 胎孕：生女 种作：不可
分儿：不可 田宅：争端 风水：未全
解说：英雄好汉莫提当年勇。此一时彼一时。不要把现时与当年比。就象那老虎一落到平地里，英雄无用武之地，边小犬都敢欺负他。世间上，有什么难于决定的呢?就是千山万水的困难，也不必迟疑，就决定勇往直前吧。
抽到此签：
问求财：应该积极进取，自然财源如“千山万水”源源而来。
问功名：有怀才不遇“虎落平洋”英雄无用武之地的感叹。
问婚姻：恐阻碍重重，难于谈成。宜另找适当的对象。
问六甲：男女一样贵气。
问出外移居：均不吉。如非紧急要事，宜暂缓行动。
问疾病：过了寅辰日就不畏。
问诉讼：是难完成。
问失物：紧寻在。
]],[[财神爷灵签 第二十九首 戊申 孔子陈蔡
枯木可惜未逢春 如今且在暗中藏 宽心且守风霜退 还君依旧作乾坤
注：先危后安
解曰：功名：无 月令：春吉 求财：破费 疾病：拖尾 求神
婚姻：中平 胎孕：生男 种作：不可
分儿：空 田宅：依旧 风水：乾坤向吉
解说：雪莱西方颂名句“冬天来了春天还会远吗”。目前虽然是寒冷的冬天，但转眼间春天一到，枯木逢春，自然生意盎然。但现在只有在暗中等待机会。你不必太过心急，且宽心地等待，等到风霜退了，春天自然来到。你仍然有春光明媚的天下。
抽到此签：表示即使目前遭遇困难，但不必灰心。这正是磨练你的机会。只要你克服了眼前的困难，接着展开的平坦的康庄大道。
问求财：利难微薄仍有。
问功名：时机未到，尚须埋头读书。
问婚姻：成功机会渺茫，只得暂时等待。至于这椿婚事的好坏乃先苦后甘之象。
问六甲：先男后女。
问出外移居：均不吉利。
问疾病：可安。
问诉讼：拖尾而宜和解。
]],[[财神爷灵签 第三十首 戊戍 气死周瑜
渐渐看此月中和 过后须防未得过 改变颜色前途去 凡事必定见重劳
注：受险 有贵人
解曰：功名：改途 月令：月中平 求财：空 疾病：易医
婚姻：不吉 胎孕：生女 种作：不可
分儿：不可 田宅：平平 风水：别寻
解说：事情会慢慢变化，但这个月中还不致有太大的变化。然而过了这个月，就要防患未然，不可好高骛远，以免失望。你要改变一下作法，再向前途迈进，否则徒劳无功，白费心机。
此签在警告，当事人要注意 极必衰的预兆，不能不谨慎你的作法。以确保过去努力的成果。尤其不可因过去稍的成就，即扩张过速，会吃亏的。
抽到此签：
问求财：微利可得。奢望大利，恐白费精神。
问功名：成功希望渺茫。
问婚姻：恐有变化难成功。
问出外移居：一动不如一静，均不宜。
问疾病：险象。
问诉讼：宜和解。
问失物：缓缓寻。
]],[[财神爷灵签 第三十一首 已丑 彭祖尾无儿
绿柳芲芲正当时 任君此去作乾坤 花果结实无残谢 福禄自有庆家门
注：先安乐 后艰难
解曰：功名：有 月令：吉 求财：可 疾病：安
婚姻：妙 胎孕：生男 种作：可
分儿：可 田宅：好 风水：佳
解说：正是杨柳苍翠成阴的时候，你应该把握时机，好好去闯天下，开展你的事业。好好耕种，自然会开花结果。天下没有不劳而获的。一分耕耘，一分收获，积善之家，必有余庆。好好播种心田，福禄自然满家门。
这是一首有大收获的吉签。
抽到此签：具有蓄财(花果结实)繁荣(绿柳苍苍)之吉象。应好好把握。
问事业：只要埋头苦干，必能完成大业。
问功名：有金榜题名之兆。
问婚姻：可成好。
问出外移居：均大吉。
问疾病：可平安。
问诉讼：定然胜诉。
问失物：难寻。
]],[[财神爷灵签 第三十二首 已卯 孙膑陷五雷阵
龙虎相交在门前 此事必定两相连 黄金忽然变成铁 何须作福问神仙
注：受灾 贵人
解曰：功名：不成 月令：未遂 求财：失利 疾病：危险
婚姻：不吉 胎孕：生男 种作：不可
分儿：空负 田宅：变怪 风水：棺好
解说：【讼则凶】应记取此教训。
曾有某人涉及伤害案件，至妈祖庙抽得此签来问吉凶。作曰：“此签神明示意和解为宜。如果双方再意气用事，官司打下去双方都得不到好处。”原来该当事人借钱给对方，对方不还钱，该当事人一气之下将对方打伤。后来言明返还借款一半，不再追究伤害，撤回告诉。一场风暴也就平息了。
抽到此签：
问求财：门市生意有利。
问功名：成绩差，须再充实自己。龙为辰虎为寅。
问婚姻：不吉。
问六甲：先女后男。
问出外移居：不吉。
问疾病：寅辰日过会好。
问失物：寅辰日抽寻在。
]],[[财神爷灵签 第三十三首 已巳 海瑞讨贡封王
欲去长江水阔茫 行船把定未遭风 户内用心再作福 看看鱼水得相逢
注：一得一失空远涉
解曰：功名：用心 月令：未通 求财：在地 疾病：不畏
婚姻：吉 胎孕：生女 种作：平平
分儿：好 田宅：平安 风水：再寻
解说：要去外乡，须经过水茫茫无际的长江。扬起帆来，却无风助行。还是安守家里用心经营，也许后福不错，会遇到如鱼得水的好机会哩。
抽到此签：表示一动不如一静。尤其出外旅行，阻碍多，不达到目的，应于终止此行。诸事宜采取退守，言行严谨，处事谨慎，以为获得安泰之计。
问求财：总会得利，但是不要操这过急。如门市生意比较好。
问功名：恐须第二次科，要再接再厉才有希望，
问婚姻：不吉。如无爱情，宜早另找对象。
问六甲：先男后女。
问出外移居：不可。
问疾病：不畏。
问诉讼：先凶后吉。
]],[[财神爷灵签 第三十四首 已未 朱寿昌寻亲母
危险高山行过尽 莫嫌此路有重重 若见兰桂渐渐发 长蛇反转变成龙
注：先难后吉
解曰：功名：成 月令：八月 求财：后得 疾病：危遇安
婚姻：晚吉 胎孕：生男 种作：好
分儿：平 田宅：择可 风水：好
解说：走过危险的高山，此去已是平坦的康庄大道。这条道路大达，慢慢的总会到达目的地。看看那兰桂也是慢慢成长开花。只要有恒心，蛇也有修成龙的一天。
此签告诉当事人，有恒为成功之本，不要怕困难，不要嫌弗力。尤其不可半途而废，那是永远没有成功的希望。俗语云“天下无难事，只怕有心人”
抽到此签：表示经过长久的艰辛万苦，开始解运而迈向顺利之大道。应把握良机，积极进取。向南方推进有利。
问求财：颇重。
问功名：这次成绩不理想，继续努力，下次可獲良好表现。
问求职：暂时无法獲得理想职位。但热诚奔跑，可獲成功。
问婚姻：最初难免发生种种阻挠，但必竟是良缘。成功与否全靠热诚与劳力。
问六甲：男女都贵气。
问出外移居：不可
问疾病：危险而求神得安。
问诉讼：会圣。
问失物：难寻。
]],[[财神爷灵签 第三十五首 已酉 朱文魁遇鬼
此事何须用心机 前途变怪自然知 看看此去得和合 渐渐脱出见太平
注：受危 尾吉
解曰：功名：晚成 月令：渐安 求财：合吉 疾病：冲犯
婚姻：晚可 胎孕：生男 种作：平平
分儿：不可 田宅：脱利 风水：移
解说：这首签告诉你不必再用心机了，未来的变化自然会知道的，看以后情形当有和合的一天。从现在开始已有转机，会渐渐脱出厄运，而看见太平的时光。诗中暗示当事人，所烦脑的事情已有转机。未来的变化是渐渐变好，不必再担忧了。
抽到此签：
问求财：渐渐有。
问功名：有希望，但要十分用功。
问婚姻：表示 不用急，有恒地推进，就可得到成功。是逐渐的发展而得到幸福良缘。
问出外：平常。
问移居：可行。
问疾病：年轻人不畏，老人不是。
问诉讼：有获胜的希望。如受冤枉亦有平反的机会。
]],[[财神爷灵签 第三十六首 已亥 崔文德祝寿长
福如东海寿如山 君尔何须叹苦难 命内自然逢大吉 祈保分明得自安
注：长久享福
解曰：功名：即成 月令：上吉 求财：进益 疾病：得安
婚姻：大吉 胎孕：生男 种作：得利
分儿：好 田宅：平平 风水：甚佳
解说：你的福禄东海那么深大，你的寿命象南山那么高。有这样福寿双全的命，还叹什么苦难呢。即是命里已有，自然大吉大利。只要祈祷，就獲得平安。这是一首很幸运的签诗，知足可以常乐。此签表示福禄寿功名齐全外，
抽到此签：如问创新事业或旬出经营则有考虑的必要。因为全签的意思要你知足常乐。
曾有一退休人员，家境富裕。因无工作不好打发时间，乃与友人合伙经营餐厅。事前抽得此签，而未多考虑。后来被合伙人骗去巨款。
问求财：
问功名：
问婚姻：表示美满。
问六甲：男女都贵气。
问出外移居：
问疾病：可痊愈。
问诉讼：得胜。
问失物：寻可复得。
]],[[财神爷灵签 第三十七首 庚子 蔡君谟作陈三诗
运逢得意身显荣 君尔身中皆有益 一向前途通大道 决意之中保清洁
注：安乐有终
解曰：功名：得意 月令：清洁 求财：有益 疾病：即愈
婚姻：大吉 胎孕：生男 种作：好
分儿：好 田宅：平好 风水：吉
解说：人遇到得意的好运气，身价也隋着变化。福至心灵。你身所从事的，都会是有益的事情。前途一向无难事。只要你有决断，自然事事顺利。
这首签诗表示你将有好运来临。所以不要犹豫不决，应该当机立断，从事你认为当做的事，决不会错。
抽到此签：
问求财：虽无十分，也有六、七分。俗语“大富由天，小富由勤俭。”
只要努力工作，自有财利可求。
问功名：只怕不用功，如用功多加长充实，定然会光明出现。
问婚姻：要有坚定的爱情，终会成为美满眷属。
问六甲：先男后女。
问出外移居：平正可行。
问疾病：曲折多，终后不畏。
问诉讼：平顺。
问失物：急寻可在。
]],[[财神爷灵签 第三十八首 庚寅 陈三楼下得荔枝
名显有意在中间 不须祈祷心自安 看看早晚日过后 即时得意在中间
注：不美 脱安
解曰：功名：显达 月令：渐安 求财：吉 疾病：自安
婚姻：嫌 胎孕：生男 种作：好
分儿：好 田宅：平 风水：穴正
解说：坚守中正立场，不偏不倚，名位自然显。不须向神祈求，心里自然安祥。看看那早晚太阳的升沉，就会领悟到：惟有坚守中间立场，才能即时得意起来。
此签原意乃告诉当事人，处世做人不宜太过激。应该采取国庸的态度。这样才能獲得心安理得，人家也自然会敬重起你来。
抽到此签：
问求财：宜守旧，不可贪求。心中存着正直，自然无忧。不可想要以大财。
问谋事：虽有成功的希望，但时间上恐会久延。
问婚姻：在时间上也是比较迟延，而会成功。
问六甲：生男。
问出外移居：可行。
问诉讼：则和解为宜。
问失物：可寻。
占騐：朋友张君报名参加高考，不知能否高中，乃赴妈祖庙抽得此签。而后高中金榜，分发经济部。经济部属国央级，正应了“名显有意在中间”这句签诗。
]],[[财神爷灵签 第三十九首 庚辰 闻太师误入十绝阵
意中若问神仙路 劝君且退望高楼 宽心且守宽心坐 必然遇得贵人扶
注：不美 危后
解曰：功名：后科 月令：后月 求财：且待 疾病：易医
婚姻：再选 胎孕：生男 种作：平平
分儿：好 田宅：平平 风水：且退
解说：你心意如果想寻求神仙的道路，我劝你还是不要妄想。且退一步看看那高楼吧。(好高骛远，终究一事无成)还是宽心安分守己，宽心地等待一下机会，一定会有贵人来帮助你的。
抽到此签：表示 运气还不很理想。不宜挺进，宜退守以等待时运之解通。不要想一步登天，做任何事，要量力而为。自然会有贵人来提拨你。此签表示一动不如一静。
问求财：分外的要求无法达成。
问功名：只有虚名，必须充实自己，才有希望。
问婚姻：不必心急，有缘自然结成夫妇。
问谋事：有长辈或贵人会提拨。宜多听取或尊重他人之意见。
问六甲：男女都 有贵气。
问出外移居：必须重新考虑
问疾病：渐渐会出运。
问诉讼：与人争执不利，官司应和解为上策。
问失物：拖人可以寻得。
]],[[财神爷灵签 第四十首 庚午 郭子仪祝寿
平生富贵成禄位 君家门户定光辉 此中必定无损失 夫妻百岁喜相随
注：先难后吉
解曰：功名：即成 月令：月光 求财：有益 疾病：不畏
婚姻：大吉 胎孕：后女 种作：平平
分儿：可 田宅：光辉 风水：双佳
解说：古云“生死由命，富贵在天”。平生只要有富贵之命，一定有禄位可求，也一定能光耀门楣。家和万事成。只要夫妻百年和合，夫唱妇隨，一定有好处而不会有损失。
某君因其妻未生男，欲纳偏房。乃至妈祖庙求卜抽到此签，一见“夫妻喜相隨”乃作罢。家庭因而免于破裂。其后竟得一男。正应了“此中必定无损失”。
抽到此签：
问谋事：要弗一番功夫。
问功名：有金榜题名之吉兆。
李君参加特种考试，夜梦乘金龙上天，不知主何吉凶，乃赴妈祖庙求签。抽得此签，果然高中金榜。正应了前二句“平生富贵成禄位 君家门户定光辉”
问婚姻：乃和顺幸福之良缘。
问六甲：先男后女。
问出外移居：平平。
问疾病：不畏。
问诉讼：以和解为宜。
问失物：困难寻。
]],[[财神爷灵签 第四十一首 庚申 黄五娘病相思
今行到此实难推 歌歌畅饮自徘徊 鸡犬相闻消息近 婚姻夙世结成双
注：受欺
解曰：功名：有望 月令：八月 求财：有益 疾病：八安
婚姻：无尾 胎孕：生男 种作：早吉
分儿：不可 田宅：初可 风水：单凶
解说：多年来辛苦经营，刚有了成果。但又有人求让，实在不好推辞。心里矛盾，借酒消愁。还是难取舍。其实这就有好消息了。所谓“有缘千里来相会”，何必犹豫不决呢?
这是一首告诉当事人不要犹豫的签诗。做任何事都该当机立断，总会有好消息的。
抽到此签：
问求财：平和。
问功名：有金榜题名之兆。
问婚姻：可成。
问六甲：先男后女。
问疾病：可痊愈。
问诉讼：可犹胜。
问失物：寻可获得。
]],[[财神爷灵签 第四十二首 庚戍 郭子仪双拜寿
一重江水一重山 谁知此去路又难 任他改求终不过 是非终久未得安
注：享福
解曰：功名：为难 月令：未佳 求财：无利 疾病：危险
婚姻：是非 胎孕：女灾 种作：不可
分儿：不可 田宅：尾凶 风水：中
解说：这件事恐怕很难很难，有重重的阻礙，不是轻易可以冲破的。正是过了一重江水又有一重山。此去路途崎岖不平，确实难走。任你有办法改变，也不能挽救，是非终究要发生。
抽到此签：表示气运闭塞不通艰难困苦重重，进退维谷。此时应坚定立场，确守正道，容妨自重，以等待时运的解通。
问求财：毛病百出，终至亏失。暂时罢手，以等待有利时机。
问功名：遇到难题，尚须充实自己。
问婚姻：阻碍重重。双方无真正爱情，及早另找对象。
问六甲：先男后女。
问出外移居：不吉。
问疾病：严重危险，用心治疗，望神庇佑或有奇绩。
问诉讼：不好。有严重麻烦，且拖延时间亦不能胜诉。罢手为妙。
问失物：难寻。
]],[[财神爷灵签 第四十三首 辛丑 刘智远投军后皇帝
一年作事急如飞 君尔宽心莫迟疑 贵人选在千里外 音信月中渐渐知
注：先忧后喜
解曰：功名：有望 月令：秋吉 求财：晚得 疾病：有碍
婚姻：可成 胎孕：生男 种作：早可
分儿：平平 田宅：吉 风水：远吉
解说：做事要从容不迫，要果断，不要迟疑。过去一年你做事太心急，现在应该宽心。你稳定性有贵人来帮助。不过目前还在千里之外。你所希望的消息，大概在月中会慢慢知道的。
抽到此签：表示当事人做事太鲁莽，或太犹豫。都是“过”与“不及”，应该避免才不会招致失败。过去的让他过去吧，现在起好好从容不迫，并且勇敢果断地去下决心吧。也许过去因为没有贵人帮助，做事不尽理想。虽然目前仍然没有贵人，但靠自己努力，总会有好消息来的。
问求财：目前尚欠理想但将来很有财利。
问功名：要努力充实自己才有希望。
问婚姻：只要努力终会成功。
问六甲：先女后男。
问出外移居：不好
问疾病：慎防可安。
问诉讼：终会获胜。
问失物：难寻。
]],[[财神爷灵签 第四十四首 辛卯 萧何追韩信
客到前途多得利 君尔何故两相疑 虽是中间逢进退 月出光辉得运时
注：得失交加
解曰：功名：莫定 月令：月光 求财：得利 疾病：反复
婚姻：难成 胎孕：生女 种作：好
分儿：好 田宅：中吉 风水：争瑞
解说：客人来了，未来的发展，利益多多，你们为什么要互相猜疑呢?虽然是进退维谷的时候，也不必灰心，云开月出的时机马上到来。
抽到此签：乃先凶后吉，先难后易之兆。
问求财：目前浮沉不定，但未来利润大有可观。
问功名：这科没有希望，要充实自己，将来定有希望。
问婚姻：虽然 有阻碍，但有情人终成眷属，不要灰心。
问谋事：虽有困难，如能克服终得成功。
问六甲：先女后男。
问出外移居：出外可以。移居要三思。
问疾病：亦是月半才不畏。
问诉讼：虽有冤枉，终得平反。
问失物：是月光可以，而月暗难寻。
]],[[财神爷灵签 第四十五首 辛巳 董永丰都送子
花开今已结成果 富贵荣华终到老 君子小人相会合 万事清洁莫烦脑
注：有贵人扶
解曰：功名：晚成 月令：小危 求财：有利 疾病：老险
婚姻：平平 胎孕：后男 种作：平平
分儿：利 田宅：美吉 风水：争端
解说：你的运气真好。正象盛开的花朵，现在已结成果实，是收犾的季节了。相信你到老都可以享受到荣华富贵。只要你待人真诚，君子、小人，你都 可以跟他会合。万事清洁顺利，不必烦脑。
抽到此签：
问求财：看你过去的勤劳，不必求神佛。神佛也会暗中保佑你。
问功名：看你用功 的程度，而定你的成就。
问婚姻：是和好幸福的姻缘，谈而可成。
问六甲：先男后女。
问出外移居：移居可行。出外虽小心。
问疾病：可愈
问诉讼：和解为宜。
]],[[财神爷灵签 第四十六首 辛未 狄仁杰后作相
功名得位与君显 前途富贵喜安然 若遇一轮明月照 十五团圆照满天
注：事业有望
解曰：功名：晚成 月令：半吉 求财：有益 疾病：化吉
婚姻：平平 胎孕：生男 种作：好
分儿：好 田宅：凶化 风水：大吉
解说：好好用功充实自己，功名自然会得。而且会使你名显天下，平步青云。前途富贵可期。就象那十五团圆的一轮明月，普照天下到处光明。
这是一首很幸运的签诗。表示当事人目前的运气，正迈入旺盛的境地。但须防盛极而衰，月圆而缺。尤其本签诗有满招损的预兆。
抽到此签：
问功名：只要有实力，必有成功的希望。
问婚姻：是白头偕老的佳兆。
问六甲：生男。
问出外：有贵人帮助。
问移居：可。
问疾病：安而可愈。
问诉讼：会胜诉。
问失物：月半抽签可寻得。
]],[[财神爷灵签 第四十七首 辛酉 王金真独行
君尔何须问圣迹 自己心中皆有益 于今且看月中旬 凶事脱出化成吉
注：先凶后吉有贵人
解曰：功名：后成 月令：中吉 求财：有益 疾病：月中
婚姻：平平 胎孕：先男 种作：晚好
分儿：是非 田宅：后吉 风水：平平
解说：你何必去求卜问神呢?只要你心中光明，自然有益。你所担心的事，要等到月中才有转机，才有逢凶化吉的希望。现在尽其在我去做就是了。
一个人只要问心无愧的去做事，不必求神佛，神佛一定暗中保佑你，自然会逢凶化吉。所谓吉人自有天相。
抽到此签：要当事人先修心，自然有益。
问求财：只要认真经营必可获利。
问功名：此次若未能得中，再接再励，下次一定能中。
问婚姻：过了月半以后，继续努力，有情人终成眷属。
问六甲：月头生女，月尾生男。
问出外移居：均可。
问疾病：先险后安。
问诉讼：也是要拖一段时间，才能逢凶化吉。
问失物：寻而后得。
]],[[财神爷灵签 第四十八首 辛亥 王昭君和番投水
阴世作事未和同 云遮月色正朦胧 心中意欲前途去 只恐命内运未通
注：先喜后危
解曰：功名：必昌 月令：未通 求财：不得 疾病：求神
婚姻：未妥 胎孕：生女 种作：不可
分儿：不吉 田宅：未佳 风水：不祥
解说：因为你做事 太有个性，不能够与人和合同流。所以迄今没有腾达的机会。就象那明月被乌云遮住而无光。你心里虽相向前迈进，只恐怕你的运气还不是亨通的时候。有才干的人，通常多自负，眼高而手低。因此多有怀才不遇的遭遇。
抽到此签：正告诉当事人，不要过于自负。洁身自爱，固然应该，。但如娇枉过正，自鸣清高，往往变成好高骛远。理想过高，以至于迟迟未能成功，或终至失败。除非你改变以往的作风，否则恐怕此去的运气照样不通顺。
问求财：须能吃苦耐劳，否则无利难成。
问功名：尚不能如愿，要多充实自己。
问婚姻：不是很理想的对象，婚姻不易成功。
问六甲：生男。
问出外移居：均不好
问疾病：险而后安。
问诉讼：不可进行。
问失物：难寻。
]],[[财神爷灵签 第四十九首 壬子 刘备三请孔明
言语虽多不可从 风云静处未行龙 暗中察得明消息 君尔何须问重重
注：有贵人扶
解曰：功名：后期 月令：过月 求财：口舌 疾病：晚吉
婚姻：是非 胎孕：生男 种作：晚吉
分儿：是非 田宅：不利 风水：平平
解说：虽然意见很多，不可以随便听从。因为风云不动，龙就无法升天的。必须等待风云际会，就可一飞上天。你在暗中即已发现明处的消息，就自己决定何去何从，何必一再问神呢?
抽到此签：告诉当事人做事情自己要有主见，不要听从人家说那样做。说这样就这样做，人多口杂，最后竟无所适从。不必问人也不必问神，做事情要靠自己权衡敌害得失，自然自己下决定，这样才会有成就。
问求财：要自己做才有利，合伙恐会不欢而散，而且无利可图。
问功名：自己若无实力，何能取得功名，须先充实自己。
问婚姻：虽然曲折甚多，但最后也成为美满良缘。
问六甲：先男后女。
问出外移居：均不好。既然
问疾病：老年人比较危险，年轻人可安。
问诉讼：难和而不利。
问失物：要往东方去寻会在。
]],[[财神爷灵签 第五十首 壬寅 潘安陈姑配合
佛前发愿无异心 且看前途得好音 此物原来本是铁 也能变化得成金
注：口舌 后吉
解曰：功名：上进 月令：平平 求财：有益 疾病：还愿
婚姻：长久 胎孕：生男 种作：可
分儿：可 田宅：再易 风水：平平
解说：既然在佛祖前山盟海誓，表示决心不变心。那么此去不必灰心。认为这东西不值钱了，说不定运气来了，铁也能变成金呢?
此签告诉当事人，所以无法立刻实现，要有恒心，继续努力，就能成功。
抽到此签：要坚定立场，等待有利时机的到来。即运气遂渐转佳，相遇究能完成大志大业的雄心抱负。贪图目前小利，既必然招致失败。
问功名：目前不如意，斯在加紧用功吧。
问婚姻：须忍耐接触与诚心待之必有所获。起初虽有阻碍与烦脑，只要恒心一直努力下去就有好的结果是必然的。偕老良缘。
问六甲：男女都贵气。
问出外移居：均可。
问疾病：可安。
问诉讼：定会拖延。
问失物：紧寻可在。
]],[[财神爷灵签 第五十一首 壬辰 唐三藏取经
东西南北不堪行 前途此事正可当 劝君把定莫烦脑 家门自有保安康
注：劳碌 有贵人
解曰：功名：进 月令：未月 求财：无益 疾病：不畏
婚姻：不成 胎孕：生男 种作：平平
分儿：不可 田宅：不美 风水：吉
解说：你今年外出无利可图，东西南北没有一个方向你可去得。还是安分守在家里比较妥当。我劝你一动不如一静，定下心来不要烦脑，安守家门，自可保平安。
抽到此签：表示不轻举妄动，即得安泰。如果粗心妄动即破运，招致不利与灾害，陷于劳苦之深渊。
不可急进，退守为佳。虽理直，亦有被陷是非之地。虽富谋略亦恐招之不利。
问求财：在家有利。
问功名：运气未到，恐不理想，虽要充实自己。
问婚姻：好而可成，要诚恳耐心与努力，是成功的要件。
问六甲：生男。
问出外移居：不吉。
问疾病：由神庇佑而不妨。
问诉讼：以和为上策。
问失物：寻可复得。
]],[[财神爷灵签 第五十二首 壬午 郑元和嫖阿仙
功名事业本由天 不须挂念意悬悬 若问中间迟与速 风云际会在眼前
注：是非 尾吉
解曰：功名：成 月令：二月 求财：有 疾病：不畏
婚姻：成 胎孕：生男 种作：平
分儿：好 田宅：吉 风水：中吉
解说：俗云：谋事在人，成事在天。功名事业的成败，本来运气 占了大半。所以你只要尽其在我，做了最大的努力，就不必再担心了，应该听天由命。若问其中期间迟速，相信风云际会的时机，就在眼前不远了。
抽到此签：告诉当事人，功名事业的成功。完全看个人平日的努力。所谓：一分耕耘，一分收犾。如果平时不烧香，临时抱佛脚那就永远没有成功的希望。只要你下了功夫，就会有成果的，不必心里担忧。
问求财：目前尚欠理想，但只要辛勤，不久就会有的，不必心里担忧。
问功名：多用功，多充实自己，机会就快来了。
问婚姻：缘分不够，不易成功。宜另找对象。
问六甲：先男后女。
问出外移居：不可。
问疾病：起倒不定。
问诉讼：拖延宜和解。
问失物：难寻。
]],[[财神爷灵签 第五十三首 壬申 刘元普双生贵子
看君来问心中事 积善之家庆有余 运逢财子双双至 指日喜气溢门闾
注：行善致荫
解曰：功名：即成 月令：渐吉 求财：得利 疾病：不畏
婚姻：可成 胎孕：生男 种作：可行
分儿：好尾 田宅：平安 风水：大吉
解说：看你来问心里所想的事，不知吉凶如何?我告诉你，积善之家必有余庆。因为你心田良好，所以会有好的果报。运气来时，求财得财，求子得子。财子双双而至。相信指日之间，喜气将洋溢你家门。
抽到此签：正是好预兆。目下虽然未得亨通，但不必挂心，只要仍然一心向善。好运马上到来。
问求财：目前虽不很理想，但不久，财源将滚滚而来。
问功名：目下虽然未得际遇，只要多充实自己，而后就有机会。
问婚姻：是美满良缘。
问六甲：生男。
问出外移居：平平
问疾病：要急不可缓。
问诉讼：能和解为上策。只要你合乎情理，不必忧虑。
]],[[财神爷灵签 第五十四首 壬戍 郭华买胭脂
孤灯寂寂夜沉沉 万事清洁万事成 菲逢阴中有善果 烧得好香达神明
注：先凶 后吉
解曰：功名：成 月令：未遇 求财：了财 疾病：求神
婚姻：不可 胎孕：生女 种作：平平
分儿：平平 田宅：平 风水：平平
解说：在漆黑的晚上，寂寞的对着一盏孤灯，心里期望着万事清洁、万事成功。如果你暗中有过行善的因果，平日又常烧好香，敬重神明。那么你就会获得神明的助力，完成你的愿望。
抽到此签：明示当事 人，要想结什么的果，就必须先怎样的栽。如果平日不行善，平时不烧好香，临时抱佛脚，又有什么用呢。平时不努力，而想万事成功。那就成了空思梦想。
问求财：只要辛勤做事必能获利，如果 想不劳而获，那会失望的。
问功名：平时善事多做，好香多烧，定会得着功名、
问谋事：有困难，必须有毅力与恒心。
问六甲：要有善心，而后才有男孩。
问出外移居：可行
问疾病：可安愈。
问诉讼：和为宜。
问失物：紧寻会在。
]],[[财神爷灵签 第五十五首 癸丑 朱买臣负薪
须知进退总虚言 看看发达未必全 珠玉深藏还未变 心中但得枉徒然
注：虽劳苦 有结尾
解曰：功名：枉然 月令：未遇 求财：会利 疾病：男危
婚姻：不可 胎孕：生女 种作：不利
分儿：不可 田宅：平平 风水：平平
解说：俗云“识时务为俊杰，知进退为英雄”虚言不实，成事不足，败事有余。看看那默然无光，未必能成全的事吧。就象那深藏的珠玉还未有变化时，就患得患失，那是徒然枉费心机。
抽到此签：告诉当事人，做任何事情，都不可能有十全十美的事。一个人做事，不必患得患失。而且必须识时务，知进退才行。你只要有真才实学，就象那深藏的珠玉，不会永远被埋没的。
问求财：目前仍不理想，所谓“前手接钱后手空”的境况。
问功名：时运未到，必须再等待，但总会有机会的，只要你有才能。
问婚姻：没有缘分的婚事，是不容易谈成功的。还是另求对象为妙。
问六甲：生男。
问出外移居：均不是时候，不动为宜。
问疾病：不要安心。
问诉讼：会拖延时间。
问失物：难寻。
]],[[财神爷灵签 第五十六首 癸卯 李三娘井边会子
病中惹得苦心劳 到底完全总未遭 去后不须回头问 心中事务尽消磨
注：受是非
解曰：功名：无 月令：未遂 求财：无 疾病：有碍
婚姻：不可 胎孕：灾女 种作：不可
分儿：不可 田宅：消 风水：不吉
解说：人在病中还要苦心操劳，那多辛苦。其实要找完全合乎理想的，本来就有人遭遇过。事情过了就算，不必回头再去追问它。心中有事尽量打消它吧。
抽到此签：安慰当事人，尽量把心放宽。注意身体健康。即使事情做失败了，也不必患得患失，尽把它挂在心上。结果于事无补，于已有损。何苦来哉。
问求财：表示财运未到，再操心也没用，就顺其自然吧。
问功名：成绩差，希望不大。
问婚姻：恐不容易成功。
问六甲：先女后男。
问出外移居：均不好。
问疾病：有险象而后安。
问诉讼：可能会拖延。
]],[[财神爷灵签 第五十七首 癸巳 武则天登基
劝君把定心莫虚 前途清洁得运时 到底中间无大事 又遇神仙守身边
注：安亨有终
解曰：功名：早成 月令：平平 求财：得利 疾病：不畏
婚姻：不好 胎孕：生男 种作：平平
分儿：好 田宅：平平 风水：中平
解说：对你把心定下来，莫再虚慌。时运得安，前途清洁。可以说这期中并无什么大事会发生。又有神明守护著，大可安居乐业。
抽到此签：当事 人须先定下心来，不要慌慌张张，才能从容把事做好。同时安慰当事人，运气安泰，不必担忧，大可安心做事。
问求财：小钱可获得，但大钱就不不易成功。下次很有希望。
问功名：要努力充实自己，后科才有希望。
问婚姻：立定主意，可以谈成。
问六甲：月头得女，月尾得男。
问出外移居：均可行。
问疾病：有贵人不妨。
问诉讼：以和解为上策。
问失物：难寻。
]],[[财神爷灵签 第五十八首 癸未 汉高祖斩白蛇
蛇身意欲变成龙 只恐命内运未通 久病且作宽心坐 言语虽多不可从
注：眼前劳碌
解曰：功名：晚成 月令：不安 求财：徒劳 疾病：不畏
婚姻：不吉 胎孕：生女 种作：不可
分儿：是非 田宅：无安 风水：久安
解说：蛇身变成龙，只恐命里运气未通，那是不可能达成愿望。久病虚弱的身体，还是要放宽心情等待，不可自不量力。虽然意见很多，还是不要去听从。
抽到此签：告诉当事人，运气滞停未通，做事阻碍多，万事不如意，不要悲观自暴自弃而堕落。忍耐奋斗，以等待有利机会的到来。
问求财：小钱有，大钱还是不能如愿
问功名：成绩欠理想，难达成愿望。
问婚姻：阻碍多，不易成功，如果强求，反而得不到美满姻缘。
问六甲：要下愿使生男。
问出外移居：一动不如地静，均不吉利。
问疾病：险而安。
问诉讼：恐拖延时间，而且胜败反复。
问失物：紧寻可复得。
]],[[财神爷灵签 第五十九首 癸酉 管仲鲍叔为贾
有心作福莫迟疑 求名清洁正当时 此事必能成会合 财宝自然喜相随
注：凡事得意
解曰：功名：有望 月令：平安 求财：得利 疾病：凶卜
婚姻：可 胎孕：生男 种作：好
分儿：好 田宅：佳 风水：亦佳
解说：你既然有心为善作福，就不要迟疑不决，赶紧去做。这时正是求取名声的时候。相信这是一定能够做得很适合。财利自然会喜欢隋你而来。
抽到此签：明示一个人只要有心向善，自然神佛庇佑之。
问求财：只要取之有道，财利自来。
问功名：加强努力，就可及格无疑。
问婚姻：决心进行，即可成功。
问六甲：生男育女都有贵气。
问出外移居：平安可行。
问疾病：可安愈。
问诉讼：以和为贵。
]],[[财神爷灵签 第六十首 癸亥 黄巢试剑法明
月出光辉本清洁 浮云总是蔽阴色 户内用心再作福 当官分理便有益
注：暗中阻碍
解曰：功名：未面 月令：未遂 求财：小利 疾病：危求神
婚姻：不可 胎孕：生女 种作：少收
分儿：不可 田宅：不利 风水：移吉
解说：月亮一出来，光辉本来很皎洁。只是浮云一庶，总使那明月失色。你应该在家里再用心，为善作福。当官要事理分明，自然会有益处。
此签告诉当事人，人生不如意事十之八九，就象那光明的月亮，偶而也有被乌云遮住光芒的时候。但不必因光芒被庶，就感到不平。更应该勤修其德。当那乌云退去时，再度露出的光将更明亮，更美丽动人。
抽到此签：
问求财：只要辛勤工作，财利没有问题。
问功名：须再用心充实自己，自然有成功的希望。
问谋事：只要积极努力，必能有成。
问婚姻：有云遮月的暗示，婚事不顺利。
问出外：旅行必须小心谨慎，最好打消此行。
问移居：也是要考虑。
问疾病：年轻比较危险，老人不畏。
问诉讼：不畏。
问失物：再月光，抽得此签可复得。
]],[[财神爷灵签 签头 刘备入东吴进赞
喜心入庵祈佛愿 须添琉璃三斤半 照耀家门皆清吉 老少康宁万事安
注：先受惊，后大喜
解曰：功名：及第 月令：还愿吉 求财：大利 疾病：渐安
婚姻：好尾 胎孕：生男 种作：好
分儿：好 田宅：吉 风水：吉
解说：签首为大吉之签，抽到此签，万事如意俱吉。合家康安，做事求财皆顺利。
求婚、诉讼、事事如意。移居出外均吉利。疾病无妨，失物可寻。六甲如意。
继愿赐福喜添琉璃，神佛绵绵护佑。
注解：添琉璃意为须添灯油。
]],[[财神爷灵签 签尾 张九艺九世同居
紫竹林中大士安 君尔何须叹苦难 天地精华皆和合 添香如意得自然
注：幸福长乐
解曰：功名：即成 月令：渐安 求财：尾利 疾病：还願
婚姻：和合 胎孕：生男 种作：晚吉
分儿：顺吉 田宅：吉利 风水：旧吉
解说：签尾亦为大吉之签，人要知足才会知道快乐。天赐幸福，天赐快乐。万事具备就无须生怨叹，贪妄之念。
抽到此签：一心向善，一切皆会顺利。继续劳力，定有好报。喜添上香，愿神不断庇佑。
]],
}

draws = {
    main = main_deck,
    explain = explain_deck,
}
return draws