main_deck = {
    [[地藏王菩萨灵签第1签 甲子
签诗：海岛初升月一轮，光辉照耀满乾坤；前程自有光明处，万里长空起瑞云。]],
    [[地藏王菩萨灵签第2签 乙丑
签诗：楚树吴花锦色鲜，燕飞莺舞日和天；贵人指引徘徊路，单向春风乐少年。]],
    [[地藏王菩萨灵签第3签 丙寅
签诗：几度忧忧计出关，满腔心绪未曾闲；一朝喜得春风便，相送扁舟过远山。]],
    [[地藏王菩萨灵签第4签 丁卯
签诗：暗箭飞来恐被伤，路逢险处要提防；几番历尽严霜雪，自得融和景色长。]],
    [[地藏王菩萨灵签第5签 戊辰
签诗：连宵风雨恨悠悠，欲渡清波未便舟；一片孤帆来彼岸，载将春色上眉头。]],
    [[地藏王菩萨灵签第6签 己巳
签诗：正欲上楼赏月时，忽然却彼黑云迷；须叟顿起清风卷，放出蝉光分外奇。]],
    [[地藏王菩萨灵签第7签 庚午
签诗：极目郊原景色浓，东风报到洛阳春；危桥已过休回首，此去前途有路通。]],
    [[地藏王菩萨灵签第8签 辛未
签诗：一番风雨一番新，都是阳和景色明；已到南枝闻鹊噪，旋来北岸听莺鸣。]],
    [[地藏王菩萨灵签第9签 壬申
签诗：前程劳碌受奔波，事事纷纭破败多；好把坚心牢得定，后途应唱大平歌。]],
    [[地藏王菩萨灵签第10签 癸酉
签诗：钓倒鱼来失却钩，半忧半闷在心头；知音堤畔东南去，也得江山入醉眸。]],
    [[地藏王菩萨灵签第11签 甲戌
签诗：梅花枝上久晴春，十日江南九日风；柳色忽生新样彩，夭桃重发旧时红。]],
    [[地藏王菩萨灵签第12签 乙亥
签诗：双眉不展几多年，今日遇时别有天；桃李春深重烂漫，芙蓉秋景正鲜妍。]],
    [[地藏王菩萨灵签第13签 丙子
签诗：浮生聚散实勘伤，事事胡涂梦一场：画水无声空见浪，绣花有色不闻香。]],
    [[地藏王菩萨灵签第14签 丁丑
签诗：月到中天云渐开，时移花影上楼台；知君运至精神爽，财禄荣昌福自来。]],
    [[地藏王菩萨灵签第15签 戊寅
签诗：燕飞莺舞两分张，凡事徐图不用忙；经过几番寒傲骨，梅花依旧满园香。]],
    [[地藏王菩萨灵签第16签 己卯
签诗：动静机关打未开，斜风细雨且舒怀；有情每见多辛苦，无意之中福自来。]],
    [[地藏王菩萨灵签第17签 庚辰
签诗：一心西去又回东，十次谋为九次空；好向神前修善果，自然享福保初终。]],
    [[地藏王菩萨灵签第18签 辛巳
签诗：顺风江上漫杨帆，到了湾头又遇滩；好把舡篙持得稳，轻轻撑过自然安。]],
    [[地藏王菩萨灵签第19签 壬午
签诗：杯中蛇影勿猜疑，虽有惶恐莫怚之：心地光明神自佑，婚姻财谷也相宜。]],
    [[地藏王菩萨灵签第20签 癸未
签诗：一叶遍舟载月明，芦花两岸水盈盈；轻风送出长江上，随放中流到锦城。]],
    [[地藏王菩萨灵签第21签 甲申
签诗：万里无云月在中，危楼萧管韵和同；洛阳宴罢精神爽，靡限荣华庆有功。]],
    [[地藏王菩萨灵签第22签 乙酉
签诗：谋却参差事得谐，桃花铺锦画时开；人人说道杨州客，玉白金黄日进来。]],
    [[地藏王菩萨灵签第23签 丙戌
签诗：南楼花影度栏杆，寂寂柴门夜色寒；漫卷朱帘明月上，几回搔首忆艰难。]],
    [[地藏王菩萨灵签第24签 丁亥
签诗：依傍他人业未成，劳劳碌碌漫柳生；乘时取次东风便，自得风城光到锦。]],
    [[地藏王菩萨灵签第25签 戊子
签诗：不足有余人事多，比长较短待如何；冥冥早已安排定，休费贪营妄受劳。]],
    [[地藏王菩萨灵签第26签 己丑
签诗：黄金有分不须求，上下祥安福自悠；君若亏心神必鉴，纵然得处亦难留。]],
    [[地藏王菩萨灵签第27签 庚寅
签诗：你来问卜我先知，好把心头子细思；富贵分明天注定，情长情短有何如。]],
    [[地藏王菩萨灵签第28签 辛卯
签诗：半世功名夙世缘，休将辛苦去流连；看来却是前生果，末把穷时怨上天。]],
    [[地藏王菩萨灵签第29签 壬辰
签诗：凶自凶兮吉自吉，吉凶到处有消息；善心应得吉神佑，何必劳劳争利益。]],
    [[地藏王菩萨灵签第30签 癸巳
签诗：笋出园中已破苔，枝条郁郁映楼台；他时得遂凌云至，休把青蓝一样猜。]],
    [[地藏王菩萨灵签第31签 甲午
签诗：烛遇风吹暗又明，采采无定影纵横；幸逢素手将围住，自得光辉彻夜清。]],
    [[地藏王菩萨灵签第32签 乙未
签诗：有意得来无意失，算来事事空劳力；从今再整一番新，自是春风永旪吉。]],
    [[地藏王菩萨灵签第33签 丙申
签诗：花正开时风雨连，岑岑落落几时鲜；忽然一出阳光照，极目荣华胜去年。]],
    [[地藏王菩萨灵签第34签 丁酉
签诗：昨日晴明今日阴，无端风雨费精神；翻来覆去成都刧，负却照耀一时春。]],
    [[地藏王菩萨灵签第35签 戊戌
签诗：富贵康宁享自然，都因子细礼神前；看来多少行方便，乃得荣华到晚年。]],
    [[地藏王菩萨灵签第36签 己亥
签诗：春风送入户庭来，和气洋洋事得谐；江北江南无限景，山前山后任徘徊。]],
    [[地藏王菩萨灵签第37签 庚子
签诗：葛藤斩尽路亨通，此去前途向不同；万物静观皆自得，祥光无限锦堂中。]],
    [[地藏王菩萨灵签第38签 辛丑
签诗：看来世界境如何，积善之家庆吉多；天赐祯祥宜报应，佳人笑倚玉栏杆。]],
    [[地藏王菩萨灵签第39签 壬寅
签诗：潺潺流水出天台，遇得渔郎引路来；入到桃园歌一曲，无穷景色任徘徊。]],
    [[地藏王菩萨灵签第40签 癸卯
签诗：江城春色永全来，满树梅花几个开；等得上林花似锦，无人不道陇头回。]],
    [[地藏王菩萨灵签第41签 甲辰
签诗：虫声唧唧最无情，偏向愁人耳畔鸣；便觉闹更眠不得，起来月魄照疎临。]],
    [[地藏王菩萨灵签第42签 乙巳
签诗：黄金散尽复还来，状士眉头又展开；凡事称情多得意，行人滔载驾舟回。]],
    [[地藏王菩萨灵签第43签 丙午
签诗：冻积消除日色融，水边杨柳遇春风；三阳开泰暖回谷，欣看江山回不同。]],
    [[地藏王菩萨灵签第44签 丁未
签诗：进不进兮退不退，进退无常人似醉；终日昏昏苦梦中，急宜唤醉方为贵。]],
    [[地藏王菩萨灵签第45签 戊申
签诗：腾蛇盘结事多虞，春去秋来问有余；急向神前许良愿，凶星方得可消除。]],
    [[地藏王菩萨灵签第46签 己酉
签诗：大猪捆定小猪走，山前有虎张开口，又恐阴人暗算多，须求解究免罗叫。]],
    [[地藏王菩萨灵签第47签 庚戌
签诗：步入泥泞进退难，一时失足祸相连；丁宁闲事君休插，免致纷纷俗务牵。]],
    [[地藏王菩萨灵签第48签 辛亥
签诗：高低之处勿推车，步步盘桓力旣赊，纵使去时扶得过，回来依旧阻人家。]],
    [[地藏王菩萨灵签第49签 壬子
签诗：绿杨深处看渔舟，漫卷丝纶去复求；钓得鱼儿孤酒饮，起来一醉卧江流。]],
    [[地藏王菩萨灵签第50签 癸丑
签诗：门前草木已知春，暗里潜藏色象新；去岁不知今岁好，大平人和大平人。]],
    [[地藏王菩萨灵签第51签 甲寅
签诗：莫向人前比短长，且从自己细思量；平生不作亏心事，免得风波入祸场。]],
    [[地藏王菩萨灵签第52签 乙卯
签诗：祸又受兮灾又欺，秋秋唧唧不相宜；叮咛急叩神前福，免使家人苦别离。]],
    [[地藏王菩萨灵签第53签 丙辰
签诗：不料之中福自臻，无穷春色喜相临；前途更有真佳境，漫把欢歌乐意吟。]],
    [[地藏王菩萨灵签第54签 丁巳
签诗：皇都春色信他乡，三月韶光正艳阳；霹雳一声风雨至，龙飞凤舞锡祯祥。]],
    [[地藏王菩萨灵签第55签 戊午
签诗：取次春风入户来，桃花开处李花开；凝眸看去浑如锦，占断江南一枝梅。]],
    [[地藏王菩萨灵签第56签 己未
签诗：春到枝头催碧桃，时来喜事乐滔滔；五陵年少头缠锦，一刻千金快若何。]],
    [[地藏王菩萨灵签第57签 庚申
签诗：洛阳春景二月天，处处笙歌乐未眠；自是太平多景象，家家相庆祝丰年。]],
    [[地藏王菩萨灵签第58签 辛酉
签诗：公私相绊勾连来，虽是无伤也破财；性爱心中行直到，吉神相扶自消灾。]],
    [[地藏王菩萨灵签第59签 壬戌
签诗：十分春色遍长安，无数奇花取次看；户外一枝斜更好，佳人笑倚玉栏杆。]],
    [[地藏王菩萨灵签第60签 癸亥
签诗：末福悠悠在后头，渐时辛苦不须愁；俄然做出非常事，特地声名遍九州岛。]],
}
explain_deck = {
    [[
〖米力仙注〗
月出光辉，万里长空。
〖北海观音明善堂解签关键词及白话简析〗
阴霾已退。好运将至。前程光明。平安顺遂。
此签为开运前途顺遂如意的上上大吉签 太阴当空有利女性，房产的事业。有外出远游机会。
感情上最利女性发动。最宜邀约同游。秋月有利。]],
    [[
〖米力仙注〗
青春年华，快意风情。
〖北海观音明善堂解签关键词及白话简析〗
不分南北。呼朋引伴。贵人相荐。欢乐相聚。
此签最宜未婚男女之团体邀约出游或团康活动。可得贵人引荐。有利结交对象成功之缘份。]],
    [[
〖米力仙注〗
春木宿鸟，正得天时。
〖北海观音明善堂解签关键词及白话简析〗
几度忧忧。满腔心绪。喜得春风。便扁舟过远山。
此签有正得天时之意。有利长久规划中之事。终可付之行动了。
感情则表示时机已成熟。最利暗恋者之真情告白。有助情海首航。]],
    [[
〖米力仙注〗
明枪暗箭，小心提防。
〖北海观音明善堂解签关键词及白话简析〗
明枪易躲。暗箭难防。因果业报。此运难挡。
此签为因果业报签，遇到了冤亲债主，凡事冲着你而来，是非黑白有口难辨。历经对方几番折磨。却无退身之地。只能让自己习惯并小心提防。宜祈神化解。]],
    [[
〖米力仙注〗
寒灯木鱼，多修善果。
〖北海观音明善堂解签关键词及白话简析〗
时未至，贵人无，勤祈神，且修心，待福来。
厄运未消，时运未通，莫多妄想，宜求神解厄度危难。诸事不取，时至自可免忧。逢春平安。
此签不利感情诸事。婚姻有孤寂猜忌分合反复之兆，宜礼佛供花，可得圆满。]],
    [[
〖米力仙注〗
月出光辉，万里长空。
〖北海观音明善堂解签关键词及白话简析〗
 不分南北。呼朋引伴。贵人相荐。欢乐相聚。
此签最宜未婚男女之团体邀约出游或团康活动。可得贵人引荐。有利结交对象成功之缘份。]],
}

draws = {
    main = main_deck,
    explain = explain_deck,
}
return draws