main_deck = {
    [[城隍爷灵签 第一首 孔明平蛮 中签
角声三弄响，无雪自心寒，劝君休愁虑，合营人马安。
【时令】
按每年节季分解，此签春旺好，夏秋差，冬季平安。
【解曰】
千般计策，理顺法宽。费些心力，终得和安。
阴霾扫尽浑无碍，风平浪静可行船。
【断曰】
婚姻好、疾病安、六甲男、行人至、求财有、功名成、争讼胜、
交易耐心终成、灶位好、风水平、失物东北寻。
【典曰】
三国时，诸葛亮为了巩固蜀汉后方，于蜀建兴三年平定南中(包括今四川南部，云南贵州等地)，曾七次生擒孟获，又七次释放，最后孟获曰：“丞相天威，南人不复反矣”。从此心悦诚服地归顺了。
]],[[城隍爷灵签 第二首 陈三磨镜 下签
亢宿属金龙，生旺巳酉宫，暗藏变化了，何处觅其踪。
【时令】
本签三、六、七、八、九、十二月当令，其余月份比较差。
【解曰】
慢行且步，诸事迟疑。守口防意，堪作箴规。
风摇灯烛须谨慎，动惹灾殃守常宜。
【断曰】
婚难成、病渐安、财不顺、风水差、功名难、行人至、讼事亏、事物难寻。
【典曰】
明泉州人陈三，因送哥嫂上任，路经潮州遇见五娘，互相爱慕。潮州有富豪林大羡五娘貌美，求婚乃父果许。陈回泉州过五娘楼前。五娘竟投以荔枝，陈因无由得亲，冒充镜工，故将宝镜摔破，以身为奴三年，得与五娘定情。因林大催亲期迫，陈三五娘偕婢洪益春逃奔泉州。民间有传说，陈三五娘后来先后投井殉情。
]],[[城隍爷灵签 第三首 李密反唐 下签
氐头偷举眼，暗想好佳人，任君巧舌语，犹恐难成亲。
【时令】
本签三、四、五、六、九、十二月小吉，其余月令比较差。
【解曰】
知足常乐，非份莫求。识得此道，少惹烦忧。休将自己心田昧，祸福去来有因由。
【断曰】
讼犹吉、财气无、婚难成、人未至、孕生男、功名难、病小心安、出外不好、失物空、风水不好、交易反复。
【典曰】
李密是隋朝末年反抗隋炀帝的瓦岗军首领，自称魏王，手下有秦琼、单雄信、程咬金等英雄好汉。后来众叛亲离，自己和王伯当投靠唐王李渊，并娶了李仁公的公主为妻，安享荣华富贵。但他仍心不知足，杀了妻子而反唐，和王伯当一起被乱箭射死。死时仅卅七岁。
]],[[城隍爷灵签 第四首 苏秦拜相 中签
房中生瑞草，孕妇喜临盆，合眷皆来庆，麒麟是子孙。
【时令】
本签春夏好，秋冬平。
【解曰】
牛郎织女，难会佳期。七夕相会，后又分离。富贵荣华欢喜得，慎防乐极还生悲。
【断曰】
孕男、求财有、病安、讼吉、寻人未至、交易成、功名有、失物往东寻、出行小心安。
【典曰】
苏秦，战国时东周今河南洛阳人，初说秦惠王吞并天下，不被采纳，后游说燕、赵、韩、魏、齐、楚六国，合从抗秦，佩六国相印，为从约之长。后来从约被张仪所破，苏秦遂至齐为客卿。因与齐大夫争宠，后被刺死。
]],[[城隍爷灵签 第五首 贵妃私通禄山 下签
心事未分明，又恐被鬼惊，细思犹难解，暗路失明灯。
【时令】
此签秋冬得令，春夏季差。
【解曰】
识得人面，心隔肚皮。不可麻痹，居安思危。
瞻前顾后不大意，莫教祸临悔恨迟。
【断曰】
财气薄，婚不成、孕生女、病拖延、讼凶、功名难、出外不好、失物东南寻。
【典曰】
杨玉环天生丽质，深得唐玄宗宠爱，册封为贵妃。时安禄山骁勇善战，屡有边功，玄宗甚宠之，提升为都督，禄山母事贵妃，来朝必宴饯结欢，通宵缠绵不去，有丑闻于外。后来安禄山从山西发兵造反，攻打洛阳，再攻下潼关，大肆烧杀抢掠，明皇仓惶逃入四川，史称“安史之乱”。最后安禄山被自己儿子杀死，杨贵妃被赐缢绞死于马嵬坡下。
]],[[城隍爷灵签 第六首 太公扶文王 上签
尾头岂相似，运来景象新，行人欣此宿，花明又一村。
【时令】
凡春夏求此签比较好，秋冬比较差。
【解曰】
眼前未遂，待时成功。贵人提携，耀祖荣宗。
逢春枯木千葩艳，福德现身鱼化龙。
【断曰】
求财有、婚晚成、功名堪期、行人至、出外吉、病小心安、讼缓吉、风水平、失物东南寻、生意尾好。
【典曰】
封神榜故事，姜子牙足智多谋，穷困潦倒，年轻时未能施展其韬略，直至八十岁方得周文王亲身至渭水礼聘出山辅佐治理国家，被封为“丞相”之职。
]],[[城隍爷灵签 第七首 相如成亲 上签
箕帚是夫妻，扫除垢浊泥，一朝入王殿，便得贵人提。
【时令】
按节季分解，此签秋冬大吉，春夏平平。
【解曰】
时来运转，可望升迁。珠联璧合，悦色和颜。
贵人接引青云路，一箭双雕带笑看。
【断曰】
财利有、婚姻好合、病痊愈、出外吉、事多磨成、寻人见、讼吉、功名显。
【典曰】
讲的是古代爱情故事，汉朝卓文君的丈夫死后，在家守寡，读诗书过日子。某日，邂逅了很有学问的司马相如，卓文君深夜造访相如，倾诉心中爱慕之情，二人遂私奔出城，回成都结为夫妻。后来相如才学被汉武帝所赏识，被选在朝庭当官。
]],[[城隍爷灵签 第八首 姜邓斗阵 中签
斗秤不公平，恐他不至诚，两边交易了，到底亦相争。
【时令】
此签正、二、十、十一月平吉，夏秋月令差。
【解曰】
两相怀疑，咫尺千里。何用绸缪，从此中止。
两虎相争终有伤，何不退让防身己。
【断曰】
财气薄、物难寻、婚难成、讼复杂、出外小心。
【典曰】
姜者，姜维也，是蜀国智勇将。邓者，邓艾也，是魏国大将军。姜维出兵伐魏，两军对峙祈山之前。起手姜维摆了孔明阵法，把魏军士打退。次日姜邓各自互摆起八卦阵，姜维军进入邓艾阵内，变成长蛇卷地阵。邓艾不能破，被困在中间，在危急之际，幸亏司马望赶来救出。
]],[[城隍爷灵签 第九首 子房遁迹 中签
牛饱栏中眠，牧童在眼前，凡人知得我，快乐似神仙。
【时令】
此签三、六、七、八、九、十二月求得吉利，其它平平。
【解曰】
运宜愿遂，顺水行舟。明哲保身，自在优游。
受恩深处宜先退，得意浓时便可休。
【断曰】
家宅祈福，岁君安、财利平、交易成、婚难成、讼亏、行人至、失物难寻、六甲求神佛、移居吉。
【典曰】
汉张良博学多才，富谋略，扶助汉高祖刘邦平天下，打败西楚霸王项羽，建立汉朝。张良深知“功成身退天之道”，更清楚刘邦此人，打战时称兄道弟，兄弟们也为其出生入死。可是等到得了天下，反目成仇，滥杀功臣。为了保全性命，他立刻隐退，连去踪也无人所知，自己逍遥去了。
]],[[城隍爷灵签 第十首 买臣弃妻 下签
女子觅良人，言语似酸辛，悔恨当初日，是亲亦难亲。
【时令】
此签三、四、五、六、九、十二月平，其余月份差。
【解曰】
哑子作梦，有口难言。覆水难收，功夫徒然。
劝君莫将便宜占，贪长短至悔难堪。
【断曰】
六甲生女、求财难、婚事难、失物不见、家宅不安、病小心犯阴魂、功名难、出外不好、灶位犯白虎。
【典曰】
汉朝朱买臣年轻时家境十分贫苦，其妻嫌其穷而抛弃他，跟着别的男人走了。买臣人穷志不穷，发愤攻读。苍天不负苦心人，后来功名成，官居会稽太守。其妻知情后，赶快回来要求复合。买臣骑在马上把水倒在地下，要其妻再收回来，以示夫妻不能再复合。
]],[[城隍爷灵签 第十一首 目莲救母 上签
虚心求上进，圣贤指迷津，谋望皆称遂，端赖汝诚真。
【时令】
此签春夏季很好，秋冬平。
【解曰】
当空皎月，却被云遮。云开见月，依旧光华。
否去泰来福星耀，天皇恩降积善家。
【断曰】
讼吉、财气平、行人至、六甲男、出外吉、婚姻缓、移居吉、风水好、病有贵人、功名努力可成。
【典曰】
佛教故事，目莲尊者，很有神通，其母生前作恶多端，死后堕在饿鬼道受苦。以自己的神通力，目莲没法救度母亲，求如来佛祖扶助。佛祖指点目莲设盂兰盆会，供养十方僧侣，并由诸天菩萨施法。后来其母亲得脱苦海，超升乐帮。
]],[[城隍爷灵签 第十二首 姜女寻夫 下签
危途实可忧，未免得无愁，细思千里外，山水两悠悠。
【时令】
此签秋冬犹可，春夏不利也。
【解曰】
百般辛苦，徒劳无功。梦中得宝，醒来全空。
水中捞月功夫费，画饼充饥笑煞侬。
【断曰】
讼凶、财无、行人艰难、婚不成、六甲女、功名无、病人拖延、出外差、失物向北寻、交易难。
【典曰】
民间故事，秦始皇为了巩固国防，劳民伤财，在北方建筑长城。范杞郎和孟姜女是对新婚夫妇。丈夫难逃被抓去建筑长城的厄运。一去多年，杳无音讯。姜女为了寻找丈夫，冒着严寒，跋山涉水，走到了人们在建长城的地方。谁知丈夫早已被官史所击杀。姜女悲痛万分，号啕大哭，哭声震地，此时，连长城也被哭倒了一大段。
]],[[城隍爷灵签 第十三首 李靖归山 上签
室家事已成，四序尽和平，自得心头快，休羡青云腾。
【时令】
春好，夏旺，秋冬平。
【解曰】
退身可取，进步非宜。满足现状，莫攀高枝。
静处栖息无那恼，淡泊名利好自持。
【断曰】
家宅守旧、岁君平平、求财有、讼和、六甲男、行人有信、寻人见、病祈福、风水照旧、婚姻等待。
【典曰】
封神榜故事，托塔天王李靖协助姜子牙打败纣王后，建立周朝。姜子牙于是设封神榜，进行封神仪式，以安定在战斗中死亡的将士亡灵。自此河清海晏，天下太平。周武王要封候行赏，又要封土地给开国功臣。李靖却要求归山修道，过着清静无为，淡泊名利的生活。后来“肉身成圣”，列入仙班。
]],[[城隍爷灵签 第十四首 项羽被困 下签
璧月挂云间，游鱼在急滩，欲求鱼与月，上下两俱难。
【时令】
此签秋冬平，春夏差。
【解曰】
谋望多差，徒劳愿赊。敛藏谨慎，风雨交加。
岂能事事尽如意，戒骄戒躁莫怨嗟。
【断曰】
交易反复、财利少、婚难成、讼吉、功名难、风水平、出外不好、六甲男、行人至。
【典曰】
楚汉战阵时，项羽军队比较强大，多次和刘邦交锋都胜刘邦，因此项羽开始骄傲轻敌了。后来再和刘邦开战，项羽被刘邦军队团团围在垓下。四面楚歌，军心动摇，项羽被围困在军帐中，心情恶劣，饮酒解愁。后来在绝望中杀出重围，逃到乌江边。因感到无颜面见江东父老，拔剑自刎。
]],[[城隍爷灵签 第十五首 刘永上京 上签
奎星报与君，汝且听知闻，上看十一口，下看十八分。
【时令】
此签春夏好，秋冬平。
【解曰】
风霜历尽，苦尽甘来。青云得路，笑遂颜开。
金鸡报晓喜讯到，腊梅迎春占花魁。
【断曰】
行至、病安、财利平、六甲生男、功名成、失物可寻、交易成、出外好、风水好、岁君平安。
【典曰】
古人刘永，家庭十分穷困，发愤读书，后上京求取功名，得中头名文状元，男儿得志，衣锦还乡，光宗耀祖。
]],[[城隍爷灵签 第十六首 蔡顺行孝 上签
娄氏是高贤，清名万古传，相卿均不就，正斜总堪怜。
【时令】
此签三、六、七、八、九、十二月吉利，其它月份平。
【解曰】
随缘安份，直道而行。心中无愧，上苍有情。
但能孝悌存忠信，好事指日萃君庭。
【断曰】
讼吉利、婚姻好、病者安、求财有、交易成、出外吉、风水好、胎男、行人至、功名成、失物可寻。
【典曰】
汉朝蔡顺，字君仲，其父早丧，他对母亲十分孝顺。当时正逢兵荒马乱之时没粮吃。他只好去拾桑树充饥，他用两个不同的竹筐盛放树果。适逢赤眉贼带兵经过就问他：“为何这样做?”蔡顺说：“黑者，成熟的果子甜也给我母亲吃，赤者还没有成熟酸苦的我自己吃。”他的这份孝敬慈母之心，令赤眉听了十分感动，遂以白米二斗，牛蹄一只给他带回家。
]],[[城隍爷灵签 第十七首 窦燕山积善 中签
胃肚永和调，安身睡一宵，任他兵马动，心坚不动摇。
【时令】
此签三、四、五、六、九、十二月吉，其余月份平平。
【解曰】
人处顺境，切忌骄奢。奉祖修善，锦上添花。
莫道虚空无报应，善恶报应断无差。
【断曰】
讼吉、病安、财利迟、行人缓至、孕男、姻缘待时、功名下期、出外受阻有贵人、风水吉、移居不利、失物可寻、家门祈福平安。
【典曰】
宋代窦燕山年轻时，心术不正，为非作歹，至三十岁尚无儿女。他亡父托梦给他，劝他悔过行善，方可挽回上天之意。燕上从此痛改前非，并且广行方便，大作善事。后来生了五个儿子，均出人头地。三字经不是说过，“窦燕山，有义方，教五子，名俱扬”。
]],[[城隍爷灵签 第十八首 子龙救阿斗 中签
昂星头戴日，炎威叹如何，好雨知时节，大地清凉歌。
【时令】
此签春夏吉，秋冬平也。
【解曰】
凿石得宝，淘沙见金。知难而进，如愿称心。
若非苍天垂荫佑，那得亨通吉利临。
【断曰】
婚不定、病缓痊、求利迟、行人至、讼不利须找贵人、六甲男、家门口舌忍耐吉、功名缓、失物西方寻。
【典曰】
赵子龙是刘备手下五虎大将之一，他为了保护刘备家眷，逃往江陵。因当时曹操大军在后追杀，兵荒马乱之中，刘备妻子糜夫人和儿子阿斗失散了。赵子龙急忙四处寻找，终于在废墟中找到了他们母子。子龙把阿斗裹在怀中，杀出了重围，勇不可挡，杀死曹操五十多员大将。当时好在曹操怜惜子龙英勇将才，要生擒收服他，下令军士不可放箭射杀他，这可是给子龙好多方便。
]],[[城隍爷灵签 第十九首 韩愈上疏 中签
毕竟西风起，定招远客惊，秋来休嫌冷，且喜花月明。
【时令】
此签秋冬吉利，春夏平平。
【解曰】
不须忧虑，了事脱身。佳境随处，得遇贵人。
化险为夷风波静，海阔天高去程新。
【断曰】
病安、行人未至、求财有、功名成、讼中吉、婚姻慢、出行遇贵。
【典曰】
说的是唐朝贞元年间进士韩文公也，官拜监察御史、刑部侍郎。因上疏谏止迎佛骨，触怒了当朝宪宗皇帝。后经大臣裴度，崔群奏请宽减免去极刑，贬为潮洲刺史，后复召回。因为他为官清正且才学渊博，在被贬潮洲期间，政绩显着，造福百姓，开辟了潮洲文化之先河，深得当地百姓爱戴，潮洲有“一带江山尽姓韩”之语。
]],[[城隍爷灵签 第二十首 后主得丽华 下签
觜占崑山玉，凡人知吉凶，劝君宜退步，恐以陷坑中。
【时令】
此签春夏小吉，秋冬凶。
【解曰】
浮云蔽日，狐妖乱朝。先防早觉，避免此遭。
未到悬崖应勒马，江心补漏叹无招。
【断曰】
行人未至、名利艰难、词讼可通。
【典曰】
美女张丽华天生香艳，甚得南朝陈后主宠爱。后主自从得到她以后，整天纵情声色，加上横征暴敛，导致民怨四起，眼看山河日下，国力衰微，后来隋兵人陈，陈后主走投无路与张丽华投入宫内景阳井中，被隋兵搜出杀之。悲剧矣!花会迷人当自警，江山断送叹何如!
]],[[城隍爷灵签 第廿一首 季布得救身安 上签
参宿原来吉，劝君免用疑，所求皆称遂，好事大家知。
【时令】
此签春冬旺盛，夏秋平。
【解曰】
摆脱困境，转危为安。诸事顺逐，可望加冠。
凡事不须多优虑，鸿运休征福气攒。
【断曰】
病安、婚好、财有、行人至、孕男、功名成、物可寻、出行吉、家门宜拜祖先。
【典曰】
季布本是西楚霸王项羽手下大将。楚汉战争期间，曾多次困窘刘邦，后来刘邦灭掉了项羽，不惜重金悬赏捕捉季布。季布逃躲在鲁朱家处，朱家叫滕公说服刘邦赦免季布，算来季布的命运造化很好，非但没有被问罪，反而被刘邦召拜为郎中之职。
]],[[城隍爷灵签 第廿二首 孟母三迁 上签
井泉清且甘，熏风便是南，呼童来取水，奋步上高岩。
【时令】
此签春冬吉利，秋夏平平。
【解曰】
审时度势，接竹引泉。笃行不倦，合浦珠还。
雁塔题名非容易，心血曾付一番番。
【断曰】
求财有、行人至、交易成、失物向南寻、功名可望、讼反复吉、出行吉、病平安、婚姻缓成、移居吉、家人平安。
【典曰】
中国古代儒家亚圣孟子(字，轲)幼时，其住家靠近在墓园边，他小小年纪每天就学起人家吹打哀乐办丧事游戏儿。这一下可把孟母急坏了，她赶紧带着孟子移居在某集市旁边。谁知孟子竟学那屠夫做起屠猪的游戏。孟母看在眼里急在心头，觉得这地方也不适合培养儿子成长。最后孟母携子移居在学宫边。孟子就似模似样地学起夫子们做祭祀、揖让进退的游戏，这一下子孟母很欢喜、很放心地安居下来。
]],[[城隍爷灵签 第廿三首 张珙成亲 中签
鬼祟作灾殃，事事多关防，火中跳出马，四蹄全无伤。
【时令】
此签三、六、七、八、九、十二月大吉，正、二、四、五、十、十一小吉。
【解曰】
事多阻滞，有些牵缠。破釜沉舟，前景乐观。
天理自有公平论，好事多磨好事传。
【断曰】
问病安、寻人至、求财有、婚事好、孕生男、讼吉、交易成、家人口舌、移徙吉。
【典曰】
唐书生张珙往京赴试，途次寄读佛寺，遇见崔莺莺，互生爱慕。当时有贼首孙飞虎率领群贼围住佛寺，意图抢夺崔小姐。崔夫人惊慌无措，倡言，谁能解此围者，定当将女儿许配之。张珙听了赶快驰书白马将军前来解救。谁知事成之后，崔夫人竟背弃前约，备筵酬谢，只许张珙与莺莺兄妹相称，并说莺莺早已许配他人。张珙十分失望，待月西厢，幸得侍儿红娘寄语传情，得与莺莺私订终生。后来西厢事发，崔母拷打红娘。红娘反责夫人失信，夫人无言以对，故再刁难，除非张珙功名成就，方许将女儿妻之。后来张珙发愤读书，科场得意，美事终成。
]],[[城隍爷灵签 第廿四首 贞观之治 上签
柳絮舞春风，乾坤瑞气融，眼前生意满，雷震鸣百虫。
【时令】
此签三、四、五、六、九、十二月大吉，余者平平。
【解曰】
天地交泰，万派朝东。河清海晏，人寿年丰。
天将化日舒清景，贵人扶持得运通。
【断曰】
病安、求财有、婚姻成、讼绞缠、家门吉、行人至、风水好、出外平安、功名有、生意合营。
【典曰】
唐高祖李渊之子李世民，聪明且英武，兼通文学诗书。在隋朝末年曾佐其父李渊起兵平定四方，建立唐朝。后来他当上了皇帝，帝号“太宗”，他任人惟贤，施政有方，堪称一代明君。在他当皇帝期间，重用了贤臣房玄龄、杜如晦、魏征等辅理国事，轻刑薄赋，国家太平，人们安乐，世称“贞观之治”。
]],[[城隍爷灵签 第廿五首 董永遇仙女 中签
星辰光灿烂，银河得路通，牛女才相见，泪后各西东。
【时令】
此签春夏小吉，秋冬不利。
【解曰】
时晴时雨，乍喜乍忧。吉凶祸福，总有来由。
宇宙万法无常法，花开花落自春秋。
【断曰】
讼吉、病小心、财气微、人未至。
【典曰】
取材于古代神话故事，汉朝时，有一书生名叫董永，家贫如洗，上无片瓦，下无锥地，就连他的父亲死了也没钱买棺木收埋。算来他也堪称为孝子，卖身为奴，给财主做长工。他的孝心感动了天上美丽的七仙女，私自下凡间来和他结为夫妻。传说还生了个儿子名叫董汉。仙女白天劳作，夜来织布，使他得以还债赎身。只叹好景不长，一年后，仙女回天庭去了，夫妻从此分别。
]],[[城隍爷灵签 第廿六首 三藏取经 中签
张扬大乘教，东震有高贤，西行千万里，九九历艰难。
【时令】
此签秋冬吉利，春夏平。
【解曰】
营谋出入，执锐披坚。一朝成就，喜地欢天。
挺霜傲雪寒彻骨，报得春色满人间。
【断曰】
孕女、财利平、行人至、出外艰难有贵人、婚姻反复、住宅带烦尾吉、交易终成、功名缓、失物难寻。
【典曰】
唐朝高僧玄奘，品学皆佳，太宗皇帝十分赏识他，每以御弟称之。贞观元年，太宗皇帝钦派往西域(印度)取经。其目的是要弘扬佛法，教化东土众生行善修福。玄奘法师经历了千辛万苦，一路上翻山越岭、餐风宿露，计行程十万八千里，直至贞观十八年方大功告成，取得经文回归唐朝。
]],[[城隍爷灵签 第廿七首 武王得天下 上签
翼展抟扶摇，高飞上九霄，风云欣际会，万国贺天朝。
【时令】
此签春夏大吉，秋冬平平。
【解曰】
得道多助，失道寡助。壮志欣欣，龙骧虎步。
鲲鹏兴变展壮图，大功可成皆天数。
【断曰】
讼吉、病安、行人至、财有、婚好、出外吉、交易成、风水好。
【典曰】
周武王名姬发是周文王姬昌之子也。殷商末年，继位为西伯侯。当时商朝纣王暴虐无道，天怒人怨。武王率领诸侯起兵东征，终于打败纣王于牧野(今河南省淇县南)。纣王见大势已去，引火自焚死。武王乃得天下，建立周朝。设都在镐京(今陕西省长安县南)。他积善施仁，政化大行，在位十九年。(周朝有八百多年的福份，为历史上最长朝代)
]],[[城隍爷灵签 第廿八首 叩马进谏 中签
轸风起天末，萧索动寒林，锦瑟殷勤弄，谁知弦里音。
【时令】
此签秋冬平，春夏差。
【解曰】
人有我见，已一片情。善心善面，秋水澄清。
事到头来浑是梦，是非成败任点评。
【断曰】
财微、病小心、行人至、孕女、讼凶。
【典曰】
伯夷和叔齐是商代孤竹国君墨胎初之子，其父临死之前，立下遗命要叔齐继承王位。等到其父真的死了，叔齐要将王位让给哥哥伯夷承当。伯夷说：“父命不可违也。”伯夷坚决不肯接受，后来兄弟俩都抛弃王位，投奔周文王。武王起兵伐纣时，兄弟俩伏跪马前谏止武王伐商，但不被采纳。直至殷商亡败之后，兄弟归隐于阳山，不食周栗，采薇而食。后来饿死在首阳山下。兄弟俩蔑视功名，持守道义的气节备受后人所推崇。
]],
}

draws = {
    main = main_deck,
    explain = explain_deck,
}
return draws