main_deck = {
[[文昌帝君灵签第一签：甲甲大吉
签诗：
巍巍独步向云间 玉殿千官第一班
富贵荣华天付汝 福如东海寿如山
解析：
整体考运及士气都是百分百，起居作息也都调整得很好，命中注定要上榜，看来会为了上榜请家人好友吃东西而荷包小失血喽！
工作升迁方面是没问题的，别亏待曾帮助过你的人。
问应考功名，表示金榜题名的好兆，富贵荣华天赐予。
问诉讼，表示得直。
问生病，可以痊愈。
]],[[文昌帝君灵签第二签：甲乙上吉
签诗：
盈虚消息总天时 自此君当百事宜
若问前程归宿地 更须方寸好修为
解析：
会不会太求好心切了一点，按照进度表准备就可以了。不用因为是不是念的资料不够或手边资料太少而患得患失，或担心来不及念完而熬夜。其实依你现在自己最舒服的步伐前进，榜上题名应该没问题。行善积德是有必要的，会成为你功成名就的助力
工作升迁方面，不需太急切，按部就班即可，别想要一步登天。
求谋不宜过急，所谓欲速则不达，且须等待时机，不可速进，方可成就。
问应考功名，有希望，但不可心燥，求财平平，做事业宜按步就班，不可好高骛远，才不致失败，总之，不妄动，再正心修德，自然安泰。
问婚姻，表示有成功的希望。
]],[[文昌帝君灵签第三签：甲丙中吉
衣食自然生处有 劝君不用苦劳心
但能孝悌存忠信 福禄来成祸不侵
解析：
古语有云：「成事在人，谋事在天。」所以你只要有尽力准备，相信一定会金榜题名。但是因为念书也耗损了不少健康跟心力，所以请多注意一下自己的健康，多去出户外走走，念起书来会更加有效率。如果是考完的人，更应该好好休息，别担心考不考的上了！
工作升迁方面，别妄想太多，应该还是要再等一下。只要你是合适的那个人，机会就会站在你这边，但要是平时没储备能量，相信机会来也是抓不住的。
命里有时终须有，命里无时莫强求。
问谋事，虽有成功的希望，但时间上恐久延。
谈婚姻，在时间上也是比较迟延。
]],[[文昌帝君灵签第四签：甲丁下下
签诗：
去年百事颇相宜 若较今年时运衰
好把瓣香告神佛 莫教福谢悔无追
解析：
去年的你一切都是春风得意，今年不然了，福报终有耗完的一日，平常不念书，临时又不抱佛脚，自然机会渺茫，从现在这一刻起，你必须调征自己的心态，重新出发，认真念书、作一点善事改掉自己的坏习惯，才有光明的一天。
工作升迁方面，别轻举妄动，现在的你不适合作任何改变。
人无远虑，必有近忧。
问谋望，表示很难达成。
问求财交易，表示无利可图。
问诉讼，盖讼则凶。
]],[[文昌帝君灵签第五签：甲戊中平
签诗：
子有三般不自由 门庭萧索冷如秋
若逢牛鼠交承日 万事回春不用忧
解析：
一个人的富贵寿禄是天注定的，必须在天时地利人和的情形之下，才能发挥最大的效果，千万不要不信因果、自以为是。准备好一切、等待时机是你目前能作的事！如果你是考了几次的人，今年可能会有所突破跟有好的结果。如果你是今年初试啼声或是第一次参与考试的人，也许就不一定这么顺利。
工作升迁方面，也是轮到你了！今年会是个丰收年。
暗示先忧后喜，先凶后吉。
问求财，目前无利，不过将来有利。
问疾病，可医治，有痊愈的希望。
]],[[文昌帝君灵签第六签：甲己下下
签诗：
何劳鼓瑟更吹笙 寸步如登万里程
彼此怀疑不相信 休将私意忆浓情
解析：
没关系，下次一定会成功的。成功是属于已经准备好的人。
工作升迁方面，别轻举妄动，现在的你不适合作任何改变。
问合伙事业，不是拆伙就是合伙不成的预兆。
问婚姻，也是没有成功的希望。
问功名，没有希望。
问疾病，难痊愈。
]],[[文昌帝君灵签第七签：甲庚大吉
签诗：
仙风道骨本天生 又遇仙宗为主盟
指日丹成谢岩谷 一朝引领向天行
解析：
棋差一着、缺临门一脚，就是你现在的状况，也许你自认为百分百，但是仍有些盲点没发现。可以藉由跟同学或好伙伴的讨论切磋，会再更上一层。上榜应该没问题。
]],[[文昌帝君灵签第八签：甲辛上上
签诗：
年来耕稼苦无收 今岁田畴定有秋
况遇太平无事日 士农工贾百无忧
解析：
今年的运气来了，也许就一开始答题不怎么顺利，但是会渐入佳境，上榜应该没问题的。
工作升迁方面，也是轮到你了，今年会是个丰收年。
先凶后吉之兆。即所谓否极泰来，时来运转是也。
问谋望，此签吉，喜庆来，问行人，即便回。
问疾病，当无灾。
问诉讼，先忧后喜。
]],[[文昌帝君灵签第九签：甲壬大吉
签诗：
望渠消息向长安 常把菱花仔细看
见说文书将入境 今朝喜色上眉端
解析：
今年的运气来了，如果你是考了几次的人，相信今年一定有所突破跟有好的结果。如果你是在等榜单，上榜应该没问题的。
工作升迁方面，可能不怎么顺利，如果升上去也会觉得是没有实质的权力。
期待已久的事情，将有眉目了！
问名利，必有好消息。
问行人，数日内即至。
问疾病，将痊愈。
]],[[文昌帝君灵签第十签：甲癸下下
签诗：
病患时时命蹇衰 何须打瓦共钻龟
直教重见一阳复 始可求神仗佛持
解析：
没关系，下次一定会成功的，只是你应该重新检视一下念书的方法，是不是正确的。健康作息也应该调整一下，不然考上了，也没有了健康的身体来继续完成未来的挑战。还有啊﹗做人不要太自私，如果一直觉得别人会超越你，一直闭门造车不跟其他人切磋，也许你觉得对的观念是有问题的，另外，要多行善，才有办法调整命运！
工作升迁方面，别轻举妄动，现在的你不适合作任何改变，对人处事要圆融一点。
要悔过，消去恶业，福果自来，当避害向善，慎勿妄动。
问事业财利，表示无利可图，宜守旧，莫贪求。
]],[[文昌帝君灵签第十一签：乙甲下下
签诗：
今年好事一番新 富贵荣华萃汝身
谁道机关难料处 到头独立转伤神
解析：
外在干扰不少，没关系，下次一定会成功的，只是你应该重新检视一下念书的方法与作息方式是不是正确，不然考上了也没有了健康的身体来继续完成未来的挑战。
工作升迁方面，别轻举妄动，现在的你不适合作任何改变。
不可只就表面看，到头来是祸患侵，伤精神。
问功名，未遂。
问财禄，平。
问诉讼，不利。
问婚姻，不吉。
]],[[文昌帝君灵签第十二签：乙乙中平
签诗：
营为期望在春前 谁料秋来又不然
直遇清江贵公子 一生活计始安全
解析：
模拟考或题库里的高分，并不代表一定会考上，所以仍然要注意，别掉以轻心。但是现在的你，熬夜跟作息都不正常，这样不好，也许到接近考试时，反而会体力崩溃，搞不好会考到打瞌睡。
工作升迁方面，也许一开始风评不好，但是只要你是有料的，还是会成功。
始吉终凶之兆。又表示先忧后疑，最后始定。
问诉讼，讼则终凶。
]],[[文昌帝君灵签第十三签：乙丙中平
签诗：
君今庚甲未亨通 且向江头作钓翁
玉兔重生应发迹 万人头上逞英雄
解析：
不用因为是不是念的资料不够或手边资料太少而患得患失，或担心来不及念完而熬夜。抱持平常心准备考试，相信应该会有好结果。如果过于心急而熬夜念书或没有规律的念书，反而事倍功半喔！
工作升迁方面，不需太急切，按部就班即可，别想要一步登天。
时运未通，只有守旧待时，不宜妄动。时运一到，自然名成利就。
问疾病，须拖延，但终能痊愈。
]],[[文昌帝君灵签第十四签：乙丁下下
签诗：
一见佳人便喜欢 谁知去后有多般
人情冷暖君休讶 历涉应知行路难
解析：
很多干扰影响读书的心情，是因为自己的定力不足所造成，也间接影响考试表现，宜多禅坐、念佛、行善，调整自己的身心。
工作升迁方面，别轻举妄动，现在的你不适合作任何改变。
有先喜后忧之兆，开始容易终则难，故不宜放肆，尤宜兢兢业业，以免后悔。
问疾病，忽喜忽忧。
]],[[文昌帝君灵签第十五签：乙戊中平
签诗：
两家门户各相当 不是姻缘莫较量
直待春风好消息 却请琴瑟向兰房
解析：
虽然很努力读书，但方法不对，成效有限，只要稍作改变，下次就会有成功的机会。
工作升迁方面，别轻举妄动，现在的你不适合作任何改变。
凡事须待新春，方始称意。若妄动，反劳心力，终不能如人心愿。
问功名，不成。
]],[[文昌帝君灵签第十六签：乙己下下
签诗：
官事悠悠难辨明 不如息了且归耕
傍人煽惑君休信 此事当谋亲兄弟
解析：
因为周遭人事因素，让您情绪低落、思绪紊乱，无心应考。继续努力不懈，下次应该会成功。
工作升迁方面，别轻举妄动，现在的你不适合作任何改变。
问诉讼，应和解。
误听信谗言。
问财运，莫贪求，投机终无利。
问婚姻，难得成功。
]],[[文昌帝君灵签第十七签：乙庚下下
签诗：
田园价贯好商量 事到公庭彼此伤
纵使机关图得胜 定为后世子孙殃
解析：
虽然努力准备，但是外在干扰不断，成效有限，别想用不好的方式来应考，那是没有意义且没有用的，要走正路多行善，会改运的。
工作升迁方面，别轻举妄动，现在的你不适合作任何改变。
做事只要依本份，循理而行，自然会得圆满的结果。反之，如果硬要图巧取胜，纵然目前获得一些小利益，将来会给子孙留下无穷祸因的。
问诉讼，宜彼此让步和解。
问功名，难如愿。
问财运，利未遂。宜安守，莫贪求，且谨慎，保安康。
]],[[文昌帝君灵签第十八签：乙辛中平
签诗：
知君指拟是空华 底事茫茫未有涯
牢把脚根踏实地 善为善应永无差
你目前所订定的读书目标是不切实际的，自以为准备很多，可是方向不对，应该好好重新检视一番，多跟师长同学讨论，看人家是怎么准备的，还有，勿以恶小而为之，人在做，天在看，多行善，才是正道。
]],[[文昌帝君灵签第十九签：乙壬上吉
签诗：
嗟子从来未得时 今年星运颇相宜
营求动作都如意 和合婚姻诞贵儿
解析：
考运不错喔！继续保持现况，相信应该会榜上题名。如果过于心急而熬夜念书或没有规律的念书，反而事倍功半喔！
]],[[文昌帝君灵签第二十签：乙癸下下
签诗：
一生心事向谁论 十八滩头说与君
世事尽从流水去 功名富贵等浮云
解析：
一切是因果的注定，你自以为怀才不遇，总以为别人不认同自己，可是从来不检讨自己的过失，这是你多生的前世所带来的问题，应该好好的忏悔，只有忏悔，才有改变的机会，考试也是一样。
工作升迁方面，别轻举妄动，现在的你不适合作任何改变。
怀才不遇，知音难寻，虽有满腹经纶，又有谁识货呢?放宽心胸吧，世事原来就是如此。那能尽如人意呢?
问旅行，要小心，路上恐有险阻。
问诉讼，凶多吉少。
问疾病，择医可愈。
问行人，归期尚远。
]],[[文昌帝君灵签第二十一签：丙甲下下
签诗：
与君夙昔结成冤 今日相逢那得缘
好把经文多讽诵 祈求户内保婵娟
解析：
外在干扰不断，影响考试心思。没关系，持续努力坚持下去，下次一定会成功的。
工作升迁方面，别轻举妄动，现在的你不适合作任何改变。
问婚姻，难能成功。
问事情，成功希望很少，乃宜守不宜动之象，并要防女人是非。
]],[[文昌帝君灵签第二十二签：丙乙上吉
签诗：
碧玉池中开白莲 庄严色相自天然
生来骨格超凡俗 正是人间第一仙
解析：
积极努力不迟疑，并以平常心准备考试，让您的所学完全发挥，相信一定能榜上有名。
工作升迁方面，要专心一致，要有耐心，这样才会有所收获。
要积极行动，不要迟疑不决。
问功名，有希望。
问事情，可成就。
问财利，有希望。
]],[[文昌帝君灵签第二十三签：丙丙下下
签诗：
花开花谢在春风 贵贱穷通百岁中
羡子荣华今已矣 到头万事总成空
解析：
虽然很努力，但是准备方向不对，成果有限。没关系，只要稍作调整，下次一定会成功的。
工作升迁方面，别轻举妄动，现在的你不适合作任何改变。
花无百日红，人无千日好。
问事情，有成有败，吉中有凶，否生于泰，名利似虚花。
]],[[文昌帝君灵签第二十四签：丙丁中平
签诗：
一春万事苦忧煎 夏里营求始帖然
更遇秋成冬至后 恰如骑鹤与腰缠
解析：
虽然花很多时间读书，但是不够专心，成效不彰。唯有专心一志，持续努力，相信成功是属于你的。
工作升迁方面，有如倒吃甘蔗越来越甜，别气馁，有耕耘必有收获。
先凶后吉，先苦后甘的启示。没有耕耘，那来的收获?
问名利，晚成。
问谋事，先难后易。
]],[[文昌帝君灵签第二十五签：丙戌中平
签诗：
寅午戌年多阻滞 亥子丑月渐亨嘉
更逢玉兔金鸡会 枯木逢春自放花
解析：
没关系，继续努力，下次一定会成功的，只是你应该重新检视一下念书的方法与准备的方向是不是正确的。
工作升迁方面，别轻举妄动，现在的你不适合作任何改变。
]],[[文昌帝君灵签第二十六签：丙己中吉
签诗：
年来丰歉皆天数 自是今年旱较多
与子定期三日内 田畴沾足雨滂沱
解析：
花不少时间念书，上榜边缘，只要再加把劲，努力不懈，持之以恒，上榜应该有你一份。
]],[[文昌帝君灵签第二十七签：丙庚下下
签诗：
世间万物皆有主 一粒一毫君莫取
英雄豪杰自天生 也须步步循规矩
解析：
成功是属于做好准备的人，所以只要努力做、认真学，步步踏实，下次一定会成功的。
工作升迁方面，别轻举妄动，现在的你不适合作任何改变。
富贵分定，切莫强求，若或妄取，必有后忧。只宜守分，不可妄为。
问谋事，不可以强凌弱，以富压贫，稍涉欺凌，反成灾害。
问诉讼，宜避免。
]],[[文昌帝君灵签第二十八签：丙辛上吉
签诗：
公侯将相本无种 好把勤劳契上天
人事尽从天理见 才高岂得困林泉
解析：
抱持平常心准备考试，让您完全发挥，相信努力了这么久的您，金榜题名应该是没问题。
工作升迁方面，多作善事，多帮助别人，可以提高成功的机率喔。
当下虽然未得际遇，但莫嗟叹，只要修心向善，好运马上到来。
问诉讼，能解决，但时间上恐较长。只要当事人合乎情理去做，不必忧虑。
问行人，不久即返。
问失物，有寻回的希望，只要全力去寻找。
]],[[文昌帝君灵签第二十九签：丙壬上上
签诗：
祖宗积德几多年 源远流长庆自然
苦更操修无倦已 天须还汝旧青毡
考运奇佳，如有神助，金榜题名没问题。
工作升迁方面，也是轮到你了，今年会是个丰收年。
积善之家必有余庆。
问功名，考试必中，功名有望。官员占得，表示将高升。
问诉讼，终得直。
问疾病，即将愈。
]],[[文昌帝君灵签第三十签：丙癸中吉
签诗：
奉公谨守莫欺心 自有亨通吉利临
目下营求且休矣 私期与子定佳音
解析：
别操之过急，一步一脚印，踏实准备。做人不要太自私，多多帮助他人做好事补点考运，上榜是指日可待。
工作升迁方面，有如倒吃甘蔗越来越甜，别气馁，有耕耘必有收获。
奉公守法，安份守己，不要做亏心事，自会有亨通吉利的好运来。目前求谋暂时不要躁进，等待秋天到来时，一定会有好消息的。
问疾病，宜服药。
问诉讼，宜和解。
]],[[文昌帝君灵签第三十一签：丁甲中吉
签诗：
秋冬作事只寻常 春到门庭渐吉昌
千里信音符远望 萱堂快乐未渠央
解析：
别操之过急，一步一脚印，踏实准备，成功是属于努力不懈、坚持到底的人。
]],[[文昌帝君灵签第三十二签：丁乙下下
签诗：
劳心泊泊竟何归 疾病兼多是与非
事到头来浑似梦 何如休要用心机
解析：
努力读书，但过度熬夜影响身体，间接影响考试表现。没关系，下次一定会成功的，只是你应该调整念书的方法与作息，不然考上了也没有了健康的身体来继续完成未来的挑战。
工作升迁方面，别轻举妄动，现在的你不适合作任何改变。
熙熙攘攘为名利，巧取豪夺何时休?
问事谋，不成，徒自劳心，口舌立至，祸患来侵，不如退步，安份守己，以保安宁。
问疾病，不利。
问诉讼，不好。
问财利，亦空。
]],[[文昌帝君灵签第三十三签：丁丙中平
签诗：
不分南北与西东 眼底昏昏耳似聋
熟读黄庭经一卷 不论贵贱与穷通
努力念书，上榜边缘，再努力一点，上榜应该有你一份。若能多做些善事，相信对提升考运是很有帮助的。
工作升迁方面，多注意自己的人际关系，有时睁一只眼闭一只眼、装聋作哑会比较好。
不管是东是西，是南是北，闭只眼，装聋作哑巴，何必去计较世俗的贵贱穷通呢。
问疾病，难愈。
]],[[文昌帝君灵签第三十四签：丁丁中平
签诗：
春夏才过秋又冬 纷纷谋虑搅心胸
贵人垂手来相援 休把私心情意浓
解析：
太多事务让你烦心而影响考试，不过有贵人指引你念书的方法与方向，持续努力，应有所获。
工作升迁方面，别轻举妄动，现在的你不适合作任何改变。
要有所成就，必须要除去私心。如果一年到头，只是斤斤计较一已的利害，不会有什么成就的。
问诉讼，必因彼此猜忌而起，如果能够诚意谈判，有和解的希望。
问疾病，不乐观。
]],[[文昌帝君灵签第三十五签：丁戊下下
签诗：
一山如画对清江 门里团圆事事双
谁料半途分析去 空帏无语对银缸
解析：
要注意交通事故，有可能因此错失考试时间，考运差，即便准备充分，也会因为外在因素，而成绩不理想。
工作升迁方面，别轻举妄动，现在的你不适合作任何改变。
风水虽吉，命运未通，家门招祸，好事成空，夫妻离散，骨肉西东，凡事不遂，有始无终。
问财利，必无。
问诉讼，必凶。
]],[[文昌帝君灵签第三十六签：丁己上吉
签诗：
功名富贵自能为 偶着仙鞭莫问伊
万里鹏程君有分 吴山顶上好钻龟
解析：
别操之过急，其实依你现在自己最舒服的步伐前进，相信绝对会有好结果。如果过于心急而熬夜念书或没有规律的念书，反而事倍功半喔。多多帮助他人，做好事补点考运，上榜是指日可待。
工作升迁方面，有如倒吃甘蔗越来越甜，别气馁，有耕耘必有收获。
不可躁进，欲速则不达。
问名利，在晚成。
问诉讼，得理。
]],[[文昌帝君灵签第三十七签：丁庚中平
签诗：
焚香来告复何辞 善恶平分汝自知
屏却昧公心里事 出门无碍是通时
解析：
做人不要太自私，如果一直觉得别人会超越你，一直闭门造车不跟其他人讨论，也许你觉得对的观念是有问题的。多多帮助他人做好事补点考运。
]],[[文昌帝君灵签第三十八签：丁辛下下
签诗：
蛩吟唧唧守孤帏 千里悬悬望信归
等得荣华公子到 秋冬括括雨霏霏
解析：
原来以为会考上的，其实不然，命中注定考运不彰，除非多行善，否则难改变。
工作升迁方面，别轻举妄动，现在的你不适合作任何改变。
表示希望落空，如梦幻般空欢喜一场而以。乃凶多吉少之兆。
问谋为，不遂意，空自惆怅，纵有虚喜，终是大忧。
问疾病，恐生不测，主有死亡之虞。
]],[[文昌帝君灵签第三十九签：丁壬下下
签诗：
北山门下好安居 若问终时慎厥初
堪笑包藏许多事 鳞鸿虽便莫修书
解析：
心存侥幸，准备不足，表现自然难如所望，不要被坏朋友影响，调整自己心态，努力准备，或许尚有成功的机会。
工作升迁方面，别轻举妄动，现在的你不适合作任何改变。
只宜守旧，不可妄想。投机事业决不可做，否则必败无疑。营谋事业，事先要有问疾病，宜择医。
]],[[文昌帝君灵签第四十签：丁癸上吉
签诗：
新来换得好规模 何用随他步与趋
只听耳边消息到 崎岖历尽见亨衢
解析：
注意自己念书的方向、工具是否正确，然后努力去作准备，如果万事都具备了，再难的情况也难不倒你，相信你会有所成就的。
工作升迁方面，有自己的主见比较重要，也许太多的意见反而会模糊你自己的焦点。
一切作为要自己作主，要走到人家前面，才会有成就。如果一昧跟随他人，那是没有用的。
问疾病，可痊愈。
]],[[文昌帝君灵签第四十一签：戊甲中吉
签诗：
自南自北自东西 欲到天涯谁作梯
遇鼠逢牛三弄笛 好将姓名榜头题
解析：
不能什么都要靠别人，要学习独立自主的精神，自己不努力，即使有福报，也难有一番成就，只要把该作的事尽力做到好，贵人自会出现，上榜是指日可待。
工作升迁方面，有如倒吃甘蔗越来越甜，别气馁，有耕耘必有收获。
先难后易！
问名利，先难后成。
问疾病，择医终愈。
]],[[文昌帝君灵签第四十二签：戊乙中吉
签诗：
我曾许汝事和谐 谁料修为汝自乖
但改新图莫依旧 营谋应得称心怀
解析：
你是有福份的人，命中注定是会考上理想学校的，只是你用错了方法，现在只有改变你现有的方式，多请教师长、朋友，切勿自以为是而闭门造车，上榜是指日可待。
工作升迁方面，也许常有决策错误或不妥的地方，只要改善粗心缺点，这些错误的经验都是助力。
人非圣贤，孰能无过，过而能改，善莫大焉。
问事业，宜改图，或更换设备，守旧则没有发展的希望。
]],[[文昌帝君灵签第四十三签：戊丙中吉
签诗：
一纸官书火急催 扁舟速下浪如雷
虽然目下多惊险 保汝平安去复回
解析：
不管读书地点不佳或周遭人事的干扰，只要持续你的毅力，用坚定的步伐走下去，会有好结果的，切莫过于心急，熬夜念书或没有规律的念书，反而事倍功半喔，多多行善，做好事补点考运，上榜是指日可待。
工作升迁方面，有如倒吃甘蔗越来越甜，别气馁，有耕耘必有收获。
先凶后吉之兆。
问谋望，目前虽然障碍重重。只要毅力去克服，终究会成功。
]],[[文昌帝君灵签第四十四签：戊丁中平
签诗：
汝是人中最吉人 误为误作损精神
坚牢一念酬香愿 富贵荣华萃汝身
解析：
不要因为一些琐事而扰乱了你准备考试的思绪，应该专心一意，努力冲刺，相信一定会有金榜题名的机会。
工作升迁方面，也许常有决策错误或不妥的地方，只要改善粗心缺点，这些错误的经验都是助力。
万事皆从忙里错，但将心地细思量，若能谨守无他望，可保终身大吉昌。
问事业，须重新检讨，把错处改过，自然顺利。
问诉讼，宜忍让，最好和解。
]],[[文昌帝君灵签第四十五签：戊戊中平
签诗：
好将心地力耕耘 彼此山头总是坟
阴地不如心地好 修为到底却输君
解析：
不要为别人读书，否则无法表现出你完整实力。只需调整心态，继续努力，上榜是指日可待的。
工作升迁方面，脚踏实地，别想一步登天。多注意自己的人际关系，改掉一些恶习，好运就会跟着来。
不可妄求，但依本分，方得天之保佑。
问地利，不宜迁改。
问行人，必至。
问疾病，则安。
问财利，目前无，且宜守旧。
]],[[文昌帝君灵签第四十六签：戊己中平
签诗：
君是山中万户侯 信知骑马胜骑牛
今朝马上看山色 争似骑牛得自由
解析：
你是有聪明才智的，可是再聪明的人基本功也要扎实，脚踏实地，不要想一步登天。一步一脚印，努力往前进，成功就在不远的地方了。
工作升迁方面，别轻举妄动，现在的你不适合作任何改变。
凡事如果投机取巧，到时必会弄巧成拙。安分守己，以静制动，事方有成，并可免灾祸。
问远行，必有阻滞。
问诉讼，必凶。
]],[[文昌帝君灵签第四十七签：戊庚下下
签诗：
与君万语复千言 只欲平和雪尔冤
讼则终凶君记取 试于清夜把心扪
解析：
记住！千万不要浮躁，只要心定下来，任何外在的干扰，会影响应考思绪的任何因素，都干扰不了你，但是心要定下来谈何容易！多就教高手、老师，多向别人请益，多忏悔自己的字以为是的个性，你还是有机会的！。
工作升迁方面，别轻举妄动，现在的你不适合作任何改变。
要求免祸，必须自身谨慎修省，只要心地善良，祸端自然消灭于无形。
问兴讼，不利，讼则终凶，应自反省。
]],[[文昌帝君灵签第四十八签：戊辛中平
签诗：
登山涉水正天寒 兄弟姻亲那得安
幸遇虎头人一唤 全家遂保汝重欢
解析：
虽然你是天不时、地不利、人不合，但有会有贵人指引你念书的方法与方向，只要能依循着来做，努力不懈，上榜是指日可待。
]],[[文昌帝君灵签第四十九签：戊壬下下
签诗：
彼此家居只一山 如何似隔鬼门关
日月如梭人易老 许多劳碌不如闲
解析：
周遭人事或家中因素干扰不断，影响考试结果。没关系，继续努力，下次一定会成功的。
]],[[文昌帝君灵签第五十签：戊癸上平
签诗：
人说今年胜旧年 也须步步要周旋
一家和气多生福 萋菲谗言莫听偏
解析：
今年考运不错，不用人云亦云，按照个人的进度准备就可以了。更不用因为是不是念的资料不够或手边资料太少而患得患失，或担心来不及念完而熬夜。
工作升迁方面，有自己的主见比较重要，也许太多的意见，反而会模糊你自己的焦点。
只要把握住方针，不听信谗言，谋事可就。
问疾病，得愈。
]],[[文昌帝君灵签第五十一签：己甲上吉
签诗：
君今百事且随缘 水到渠成听自然
莫叹年来不如意 喜逢新运称心田
解析：
今年考运不错，别操之过急，一步一脚印，踏实准备。其实依你现在自己最舒服的步伐前进，相信绝对会有好结果。如果过于心急而熬夜念书或没有规律的念书，反而事倍功半喔。多多帮助他人，做好事补点考运，上榜是指日可待。
工作升迁方面，脚踏实地，别想一步登天。多注意自己的人际关系，改掉一些恶习，好运就会跟着来。
]],[[文昌帝君灵签第五十二签：己乙上吉
签诗：
兀坐幽居叹寂寥 孤灯掩映度清宵
万金忽报秋光好 活计扁舟渡北朝
解析：
今年的考运极佳，如有神助，如果你是考了几次的人，相信今年一定有所突破跟有好的结果。如果你是今年初试啼声或是第一次参与考试的人，也许就一开始答题不怎么顺利，但是会渐入佳境，上榜绝对没问题的。
工作升迁方面也是轮到你了，今年会是个丰收年。
十年寒窗无人闻，一举成名天下知。
问功名，上吉。
问婚姻，有成功的希望。
]],[[文昌帝君灵签第五十三签：己丙下下
签诗：
艰难险阻路蹊跷 南鸟孤飞依北巢
今日贵人曾识面 相逢却在夏秋交
解析：
准备方向不对，影响考试表现。不要闭门造车，多与你身边的同学伙伴切磋或向师长请教，会有很大进步空间，下次一定会成功的。
工作升迁方面，别轻举妄动，现在的你不适合作任何改变。
现在仍然不得志，自己虽吃了不少苦，还是一无所成。不过，从今天起，你开始转运了，到夏秋之交，会有好消息的。
]],[[文昌帝君灵签第五十四签：己丁中平
签诗：
万人丛里逞英豪 便欲飞腾霄汉高
争奈承流风未便 青灯黄卷且勤劳
解析：
你有满腹的雄心壮志，也准备得非常齐全，无奈考运并不佳，只好再等待时机，如果你想突破现状，唯有行善积德一途。
工作升迁方面，别轻举妄动，现在的你不适合作任何改变。
虽有大的抱负，但是没有机会让你表现，只好韬光隐晦，多充实自己。
问功名，没有希望。
问新营事业或扩张业务，时机不好，徒劳心力，最好仍守旧。
]],[[文昌帝君灵签第五十五签：己戊中平
签诗：
勤耕力作莫蹉跎 衣食随时安分过
纵使经商收倍利 不如逐岁廪禾多
解析：
别操之过急，一步一脚印，踏实准备。依循自己的步调，持续努力，成功最后还是属于你的。
工作升迁方面，脚踏实地，别想一步登天。多注意自己的人际关系，改掉一些恶习，好运就会跟着来。
有一份耕耘，终有一分收获，何必去羡慕人家的豪取巧夺呢?投机取巧，终有一天，会身败名裂，还不如安分守己，来得长远受益。
问诉讼，宜和解。
]],[[文昌帝君灵签第五十六签：己己下下
签诗：
心头理曲强词遮 直欲欺官行路斜
一旦丑形临月镜 身役宪网莫咨嗟
解析：
心存侥幸，努力不足，你觉得这样会上榜吗？万法唯心造，一切看你自己了。
]],[[文昌帝君灵签第五十七签：己庚中平
签诗：
事端百出虑虽长 莫听人言自主张
一着仙机君记取 纷纷闹里更思量
解析：
不用人云亦云，按照进度表准备就可以了，拟定一个对自己最有帮助的方法，按表操课，还是有机会的！
]],[[文昌帝君灵签第五十八签：己辛上吉
签诗：
苏秦三寸足平生 富贵功名在此行
更好修为阴骘事 前程万理自通亨
解析：
再大的功成名就，也都是你前世所累积下来的福报，善事作多了，智慧自然开启，今世你应该继续多多帮助他人，继续累积福报，金榜题名是囊中之物。
工作升迁方面，你的口才会帮助许多，但是别忘了多帮助他人，也许这些人都是能帮你更上一层楼的贵人。
你能够靠你的口才或能干，造就你的事业。不过，除了造就事业以外，你应该多做一些有益社会的事，你的成就，才会更加远大。
问疾病，即康复。
问诉讼，有胜诉的希望。
]],[[文昌帝君灵签第五十九签：己壬中平
签诗：
门衰户冷苦伶仃 自叹祈求不一灵
幸有祖宗阴骘在 香烟未断续螟蛉
解析：
外在的帮助虽然不多，但是只要你努力耕耘，认真向学，纵使时运有点不济，也有金榜题名时。
]],[[文昌帝君灵签第六十签：己癸上上
签诗：
羡君兄弟好名声 只管谦伪莫自矜
丹诏槐黄相逼近 巍巍科甲两同登
解析：
整体考运及士气都是百分百，起居作息也都调整得很好。上榜绝对没问题。
工作升迁方面是没问题的，别亏待曾帮助过你的人。
百般如意。
问谋事，有成。
问财利，亦兴旺。
问功名，必中。
问诉讼，可解。
]],[[文昌帝君灵签第六十一签：庚甲中平
签诗：
啸聚山林凶恶俦 善良无事苦煎忧
主人大笑出门去 不用干戈盗贼休
解析：
即使你早已胸有成竹，准备周延，但仍要注意「大意失荆州」，你的考运只能说普通，前世善事作太少，多行善有助于考运。
工作升迁方面，一切平顺，但要多注意一下人际关系。
主有惊险，要防小人侵害，若能守性存善，却有德曜及身，神明助之。凡事先忧后喜。
问财，平平。
问疾病，有惊恐无碍。
]],[[文昌帝君灵签第六十二签：庚乙中平
签诗：
百千人面虎狼心 赖汝干戈用力深
得胜回时秋渐老 虎头城里喜相寻
解析：
虽然你很努力、也很认真，可是你的考运一向不好，那是因为前世所累积的福报不够，只要是应试都不容易考上理想的目标，要改善就要多作善事累积福德。
]],[[文昌帝君灵签第六十三签：庚丙中平
签诗：
曩时败北且图南 筋力虽衰尚一堪
欲识生前君大数 前三三与后三三
解析：
虽然你失败了很多次，也很无奈，可是你还是有东山再起的力量，要知道会有这样的原因是因为因果的关系，所以要多行善事，多作功德，上榜是指日可待。
]],[[文昌帝君灵签第六十四签：庚丁上上
签诗：
吉人相遇本合同 况有持谋天水翁
人力不劳公论协 事成功倍笑谈中
解析：
吉人自有天相，保持你的最佳状态，金榜上头必然有你的大名。
工作升迁方面，可多跟你的合作伙伴讨论，也许会有更多意想不到的创意产生。
二人同心，其利断金。
问合伙，那是一个好兆头。但不可忘记签诗所言，一切要「公」平，要「协」力，才会事半功倍。「管饱分金」的故事，是一个模范。
问谋事，有望，出入皆宜。
问求财，可得。
问婚姻，可成。
]],[[文昌帝君灵签第六十五签：庚戊上上
签诗：
朔风凛凛正穷冬 多羡门庭喜气浓
更入新春人事后 衷言方得信先容
解析：
冬天虽然寒冷，可是却代表春天快来了，考前虽然多所不顺，但是今年的考运来了，如有神助，大名必然挂榜上。
]],[[文昌帝君灵签第六十六签：庚己上上
签诗：
耕耘只可在乡邦 何用求谋向外方
见说今年新运好 门阑喜气事双双
解析：
建议选择离家近的学校与考场，今年考运不错，相信绝对会榜上题名。
工作升迁方面，不需太急切，按部就班即可成功。
]],[[文昌帝君灵签第六十七签：庚庚中平
签诗：
谗发君心天已知 何须问我决狐疑
愿子改图从孝悌 不愁家室不相宜
解析：
既然下定决心参加考试，就要积极准备，坚持到最后，相信终就能够榜上有名。
工作升迁方面，要专心一致，要有耐心，这样才会有所收获。
善有善报，恶有恶报，君当决疑之心，改过自新，自然祸去福来。
问求财，先难后易。
问婚姻，迟婚吉。
]],[[文昌帝君灵签第六十八签：庚辛中平
签诗：
南贩珍珠北贩盐 年来几倍侦财添
劝君止此求田舍 心欲多时何日厌
解析：
不要目标太多、太贪求，设定好一个目标，全力冲刺，把能量集中在一个地方，上榜才有机会
]],[[文昌帝君灵签第六十九签：庚壬下下
签诗：
舍舟遵路总相宜 慎勿嬉游逐贵儿
一夜樽前兄与弟 明朝仇敌又相随
解析：
要认真做事，交友要慎重，不可结交损友，对己有害而无益。做事情，要脚踏实地，实事求是。至于考试，多多努力，多作一些善事，获许有机会。
工作升迁方面，别轻举妄动，现在的你不是合作任何改变。
]],[[文昌帝君灵签第七十签：庚癸中平
签诗：
雷雨风云各有司 至诚祷告莫生疑
与君约定为霖日 正是蕴隆中伏时
解析：
只要努力不懈，精诚所至，必然金石为开，菩萨会帮助你的，上榜还是指日可待的。
]],[[文昌帝君灵签第七十一签：辛甲中平
签诗：
喜鹊檐前报好音 知君千里欲归心
绣帏重结鸳鸯带 叶落霜飞寒色侵
解析：
金榜题名时机将近，别松懈，按部就班，有计画性的念书，将会有所收获。
工作升迁方面，一步一脚印，有计画性的安排工作，将会有大丰收。
好运气不久就将到了，目前的期待焦虑，即将过去。凡事要好好计划，须等待适当时机到来，再放手去做，最后必有成就。
问诉讼，宜劝当事人和解。
问考试求功名，好好努力有希望。
]],[[文昌帝君灵签第七十二签：辛乙下下
签诗：
河渠傍路有高低 可叹长途日己西
纵有荣华好时节 直须猴犬换金鸡
解析：
考运不佳而影响表现，没关系，下次一定会成功的。
]],[[文昌帝君灵签第七十三签：辛丙下下
签诗：
忆昔兰房分半钗 而今忽把信息乖
痴心指望成连理 到底谁知事不谐
解析：
虽然努力，但考运不佳，很难表现原有实力，这是因为前世累积福报不够、善事做的太少，这是应该即时行善多累积一些福报，或许有机会考上。
工作升迁方面，别轻举妄动，现在的你不适合作任何改变。
记得从前山盟海誓，如今却是音信全无，痴心等待结成连理，谁知最后还是没有希望。
]],[[文昌帝君灵签第七十四签：辛丁上吉
签诗：
崔巍崔巍复崔巍 履险如夷去复来
身似菩提心似镜 长安一道放春回
解析：
别操之过急，一步一脚印，踏实准备。外在干扰不断，最终都能克服，上榜应该没有问题。
工作升迁方面，有如倒吃甘蔗越来越甜，心平气和，有耕耘必有收获。
事情有重重阻碍或危险，但只要能够平心静气，终究会成功的。
问诉讼与疾病，虽有惊险，终得化解，不必担忧。
]],[[文昌帝君灵签第七十五签：辛戊中吉
签诗：
生前结得好姻缘 一笑相逢情自亲
相当人物无高下 得意休论富与贫
解析：
时来运就转，别操之过急，一步一脚印，踏实准备。多多帮助他人，做好事补点考运，上榜是指日可待。
工作升迁方面，多注意自己的人际关系，你的才能终会被发掘。
每个人都有时来运转的时候，即使目前穷困未发达，但是慧眼识英雄，只要是品格高尚，当然有被重视的一天。
问婚姻，只要对方人品好，目前的情况可以不必论。
问财运，此去渐渐有利。
]],[[文昌帝君灵签第七十六签：辛己中平
签诗：
三千法律八千文 此事如何说与君
善恶两途君自做 一生祸福此中分
解析：
自己的前途是必须自己来决定的，考不考的上，就看你自己下了多大的决心与努力，另外，多做一点好事，才是王道。
工作升迁方面，别轻举妄动，现在的你不适合作任何改变。
善有善报，恶有恶报。
]],[[文昌帝君灵签第七十七签：辛庚下下
签诗：
木有根亥水有源 君当自此究其原
莫随道路人闲话 讼则终凶是至言
解析：
读书要有毅力，不要三心二意，心猿意马，今年考上的机率不高，多作善事，增加考运。
工作升迁方面，别轻举妄动，现在的你不适合作任何改变。
有口舌，必须慎言。凡事谨慎，不要浮躁，不可轻信人言．宜多做省察工夫，自可免灾。
问诉讼，尤当戒。
]],[[文昌帝君灵签第七十八签：辛辛下下
签诗：
家道丰腴自饱温 也须肚里立乾坤
财多害己君当省 福有胚胎祸有门
解析：
]],[[文昌帝君灵签第七十九签：辛壬中平
签诗：
干亥来龙仔细看 坎居午向自当安
若移丑艮阴阳逆 门户凋零家道难
解析：
别操之过急，其实依你现在自己最舒服的步伐，持之以恒，相信绝对会有好结果。如果过于心急而熬夜念书或没有规律的念书，反而事倍功半喔。多多帮助他人，做好事补点考运，上榜是指日可待。
]],[[文昌帝君灵签第八十签：辛癸中平
签诗：
一朝无事忽朝官 也是门衰坟未安
改换阴阳移祸福 劝君莫作等闲看
解析：
切勿故步自封，多与他人切磋所学，读书的环境要改变一下，目前的环境不理想。
工作升迁方面，多注意自己的人际关系，你的才能终会被发掘。
所作所为，或有未合乎善因，故必须改变作为，积极行善，就能改变目前的困厄。
问名与利，宜改图。
问疾病，宜更医。
]],[[文昌帝君灵签第八十一签：壬甲中平
签诗：
假君财物自当还 谋赖欺心他自奸
幸有高堂明月镜 请来对照破机关
解析：
要专心一志，认真学习，考试要对的起自己的良心，不可以想要以非法的方式去获得高分，即使让你你考上了，也是浪费自己的福报，而且是造恶业，会有不好的恶报，其实你是有实力的，只要方法用对，机会仍然是属于你的。工作升迁方面，有如倒吃甘蔗越来越甜，别气馁，有耕耘必有收获。
先难后易，欺人自欺，反惹其祸，只可修心向善，暗助神明佑护，不可妄为。
问诉讼，终凶。
]],[[文昌帝君灵签第八十二签：壬乙上吉
签诗：
彼亦俦中一辈贤 劝君特达与周旋
此时宾主欢相会 他日王侯却并肩
解析：
棋差一着、缺临门一脚，就是你现在的状况，也许你自认为百分之百，但是仍有些盲点没发现。可以藉由跟同学或好伙伴的讨论切磋，会再更上一层。上榜是指日可待。
工作升迁方面，需要贵人提拔，至于贵人嘛…就要看你平常的为人如何喽。
多与贤人君子亲近，则他日必多有贵人提拔。
凡事谋望，无不遂意。
问婚姻，可成而且理想。
]],[[文昌帝君灵签第八十三签：壬丙下下
签诗：
随分堂前赴粥坛 何须妄想苦忧煎
主张门户诚难事 百岁安闲得几年
解析：
休息一下，重整旗鼓再度出发，下次一定会成功的。
工作升迁方面，别轻举妄动，现在的你不适合作任何改变。
只宜守成，不可妄为，凡事且随缘分。做事缘份。做事不宜强出头，以免自寻烦恼。
不宜出行，婚姻莫议，财莫贪，名利休问。
]],[[文昌帝君灵签第八十四签：壬丁中平
签诗：
箇中事绪更纷然 当局须知一着先
长舌妇人休酷听 力行礼义要心坚
解析：
准备考试切忌三心二意、犹豫不决。既然下定决心，就要积极行事，依照自己的步调，坚持到最后。
工作升迁方面，要专心一致，要有耐心，这样才会有所收获。
凡事豫则立，不豫而废。不要听信人言，致生变故。所谓长舌妇人，是阴人之言，为智者所不取，决不可听。至于做事，要当机立断，才有所得，如果迟疑不决，则将失去机会。
问谋望，只要平心静气，顺其自然，莫要强求，自然祸去福来。
问诉讼，宜和解，莫信谗言。
]],[[文昌帝君灵签第八十五签：壬戌中平
签诗：
一春风雨正潇潇 千里行人去路遥
移寡就多君得计 如何归路转无聊
解析：
别操之过急，一步一脚印，踏实准备。切忌揠苗助长，空自欢喜，多行善对你是有帮助的。
工作升迁方面，有如倒吃甘蔗越来越甜，别气馁，有耕耘必有收获。
只宜守旧，不可妄想，若欲强取财物，必致招祸。
问婚姻，欠理想，不吉。
]],[[文昌帝君灵签第八十六签：壬己上上
签诗：
一舟行货好招邀 积少成多自富饶
常把他人比自己 管须日后胜今朝
解析：
你是一位有福气的人，金榜题名没问题，但是如果你了解「福报」是因为前世善事做很多所累积的，这辈子就应该更努力的行善，会对你的将来更有帮助。
]],[[文昌帝君灵签第八十七签：壬庚下下
签诗：
阴里详看怪尔曹 舟中敌国笑中刀
藩篱剖破浑无事 一种天生惜羽毛
解析：
无心参加考试，所以表现不出应有的实力来。重点是要调整自己的心态，才有机会成功。
工作升迁方面，别轻举妄动，现在的你不适合作任何改变。
彼此应该相爱，只要你能大公无私，取信于人．自然平安无事。
先凶后吉，凡事要和同，可免是非。
问诉讼，宜和解。
问婚姻，恐有变。
]],[[文昌帝君灵签第八十八签：壬辛上吉
签诗：
从前作事总徒劳 才见新春时渐遭
百计营求都得意 更须守己莫心高
解析：
今年的运气来了，相信今年一定有所突破跟有好的结果。
工作升迁方面，也是轮到你了，今年会是个丰收年，会有实质的报酬。
]],[[文昌帝君灵签第八十九签：壬壬中平
签诗：
樽前无事且高歌 时未来时奈若何
白马渡江嘶日暮 虎头城里看巍峨
解析：
你应该重新检视一下念书的方法是不是正确的。健康作息也应该调整一下，多到户外走走或者是帮别人解答一下，也许会有不同的收获。
工作升迁方面，多作善事，多帮助别人，可以提高成功的机率喔。
目前时运未遇，且放开心胸，不必怨嗟，到晚景时，运气一到，仍然有一番轰轰烈烈的作为。
乃大器晚成的预兆。
问功名，有晚成之意。
问财运，亦来迟。
问婚姻，能和合，但缓则宜。
]],[[文昌帝君灵签第九十签：壬癸中平
签诗：
崆峒城里事如麻 无事如君有几家
劝汝不顺勤致祷 徒劳生事苦咨叹
解析：
切莫操之过急，四处找考试秘笈，应当一步一脚印，踏实准备，自然有上榜的机会。
工作升迁方面，有如倒吃甘蔗越来越甜，别气馁，有耕耘必有收获。
不要不知足，你今天能够平安无事，已经是幸福了，何必再妄求。若去妄求，则祸随时至矣。
但当主静，不可贪图。
问诉讼，以和为贵。
问求财，徒劳心力，结果无收获。
]],[[文昌帝君灵签第九十一签：癸甲中平
签诗：
佛说淘沙始见金 只缘君子不劳心
荣华总得诗书效 妙里工夫仔细寻
解析：
要如何收获，先要那么栽。要脚踏实地，不要想一步登天，努力终究会有成。
工作升迁方面，有如倒吃甘蔗越来越甜，别气馁，有耕耘必有收获。
凡事须历尽艰难，倍尝辛苦，然后志虑通达，处事熟练，天佑而人从矣。
问功名，勤苦方得。
]],[[文昌帝君灵签第九十二签：癸乙下下
签诗：
今年禾谷不如前 物价喧腾倍百年
灾数流行多疫疠 一阳复后始安全
解析：
诸多外在干扰不断，无法表现出应有水准，没关系，只要继续努力，下次一定会成功的。
工作升迁方面，别轻举妄动，现在的你不适合作任何改变。
]],[[文昌帝君灵签第九十三签：癸丙中平
签诗：
春来雨水太连绵 入夏晴干雨又愆
节气直交三伏始 喜逢滂沛足田园
解析：
不用人云亦云，按照进度表准备就可以了，安步当车，必有所成。
工作升迁方面，有自己的主见比较重要，也许太多的意见，反而会模糊你自己的焦点。
春天多如意，夏天却乖张，直到三伏之后方安泰。
问谋望，中有阻滞，后必安康。
问诉讼，反覆，久方决。
]],[[文昌帝君灵签第九十四签：癸丁中平
签诗：
一般器用与人同 巧斲轮舆梓匠工
凡事有缘且随分 秋冬方至主人翁
解析：
每个人都想考上，可是却会因为自己的福报与缘分，决定是否考上理想的学校，别操之过急，一步一脚印，踏实准备，行善对你来说是有帮助的，做人不要太自私，上榜指日可待。
工作升迁方面，有如倒吃甘蔗越来越甜，别气馁，有耕耘必有收获。
谋望且随缘份，时运将至，福禄自来，切莫贪求，安分守己，待秋冬，方有遇。
问诉讼，得理胜。
问求财，较迟得。
问疾病，宜禳解。
]],[[文昌帝君灵签第九十五签：癸戊中平
签诗：
知君袖内有骊珠 生不逢辰亦强图
可叹头颅已如许 而成方得贵人扶
解析：
虽然你已经准备周全，可是这个时机对你而言，并不是很理想，也无法强求，唯有靠行善来转运。
工作升迁方面，脚踏实地，多注意自己的人际关系，改掉一些恶习，好运就会跟着来。
]],[[文昌帝君灵签第九十六签：癸己上吉
签诗：
婚姻子息莫嫌迟 但把精神把佛持
四十年前须报应 功圆行满有馨儿
解析：
先苦而后甘，这是致胜成功的必经之路。只要你坚持下去，金榜题名指日可待。
]],[[文昌帝君灵签第九十七签：癸庚上上
签诗：
五十功名心已灰 那知富贵逼人来
更行好事存方寸 寿比冈陵位鼎台
解析：
努力了好久，成功终于到来，更应心存善念，身行好事，金榜题名是必然。
工作升迁方面会有贵人提拔，别气馁，有耕耘必有收获。
]],[[文昌帝君灵签第九十八签：癸辛中平
签诗：
经营百出费精神 南北奔驰运未新
玉兔交时当得意 恰如枯木再逢春
解析：
只要有耐心恒心，努力不懈，就算困难不断，终有金榜题名时。
]],[[文昌帝君灵签第九十九签：癸壬上上
签诗：
贵人遭遇水云卿 冷淡交情滋味长
黄阁开时延故客 骅蹓应得骤康庄
解析：
向同学或好伙伴的讨论切磋，或向师长请益，会让你再更上一层。上榜是应该是没有问题的。
工作升迁方面，会有贵人提拔，至于贵人嘛…就要看你平常的为人如何喽。
]],[[文昌帝君灵签第一百签：癸癸上上
签诗：
我本天仙雷雨师 吉凶祸福我先知
至诚祷祝皆灵应 抽得终签百事宜
解析：
能够抽到这支签，代表你是有福报的人，只要你心存善念、努力不懈，金榜题名是没有问题的。
工作升迁方面，整个节奏感都很流畅顺利，会步步高升喔。
求谋无不遂意，前进后达，百事如意。求者凡事皆吉。富贵之人，当持盈守满，则无倾溢之咎。
]],[[文昌帝君灵签第一签：甲甲大吉
签诗：
巍巍独步向云间 玉殿千官第一班
富贵荣华天付汝 福如东海寿如山
解析：
整体考运及士气都是百分百，起居作息也都调整得很好，命中注定要上榜，看来会为了上榜请家人好友吃东西而荷包小失血喽！
工作升迁方面是没问题的，别亏待曾帮助过你的人。
问应考功名，表示金榜题名的好兆，富贵荣华天赐予。
问诉讼，表示得直。
问生病，可以痊愈。
]],[[文昌帝君灵签第二签：甲乙上吉
签诗：
盈虚消息总天时 自此君当百事宜
若问前程归宿地 更须方寸好修为
解析：
会不会太求好心切了一点，按照进度表准备就可以了。不用因为是不是念的资料不够或手边资料太少而患得患失，或担心来不及念完而熬夜。其实依你现在自己最舒服的步伐前进，榜上题名应该没问题。行善积德是有必要的，会成为你功成名就的助力
工作升迁方面，不需太急切，按部就班即可，别想要一步登天。
求谋不宜过急，所谓欲速则不达，且须等待时机，不可速进，方可成就。
问应考功名，有希望，但不可心燥，求财平平，做事业宜按步就班，不可好高骛远，才不致失败，总之，不妄动，再正心修德，自然安泰。
问婚姻，表示有成功的希望。
]],[[文昌帝君灵签第三签：甲丙中吉
衣食自然生处有 劝君不用苦劳心
但能孝悌存忠信 福禄来成祸不侵
解析：
古语有云：「成事在人，谋事在天。」所以你只要有尽力准备，相信一定会金榜题名。但是因为念书也耗损了不少健康跟心力，所以请多注意一下自己的健康，多去出户外走走，念起书来会更加有效率。如果是考完的人，更应该好好休息，别担心考不考的上了！
工作升迁方面，别妄想太多，应该还是要再等一下。只要你是合适的那个人，机会就会站在你这边，但要是平时没储备能量，相信机会来也是抓不住的。
命里有时终须有，命里无时莫强求。
问谋事，虽有成功的希望，但时间上恐久延。
谈婚姻，在时间上也是比较迟延。
]],[[文昌帝君灵签第四签：甲丁下下
签诗：
去年百事颇相宜 若较今年时运衰
好把瓣香告神佛 莫教福谢悔无追
解析：
去年的你一切都是春风得意，今年不然了，福报终有耗完的一日，平常不念书，临时又不抱佛脚，自然机会渺茫，从现在这一刻起，你必须调征自己的心态，重新出发，认真念书、作一点善事改掉自己的坏习惯，才有光明的一天。
工作升迁方面，别轻举妄动，现在的你不适合作任何改变。
人无远虑，必有近忧。
问谋望，表示很难达成。
问求财交易，表示无利可图。
问诉讼，盖讼则凶。
]],[[文昌帝君灵签第五签：甲戊中平
签诗：
子有三般不自由 门庭萧索冷如秋
若逢牛鼠交承日 万事回春不用忧
解析：
一个人的富贵寿禄是天注定的，必须在天时地利人和的情形之下，才能发挥最大的效果，千万不要不信因果、自以为是。准备好一切、等待时机是你目前能作的事！如果你是考了几次的人，今年可能会有所突破跟有好的结果。如果你是今年初试啼声或是第一次参与考试的人，也许就不一定这么顺利。
工作升迁方面，也是轮到你了！今年会是个丰收年。
暗示先忧后喜，先凶后吉。
问求财，目前无利，不过将来有利。
问疾病，可医治，有痊愈的希望。
]],[[文昌帝君灵签第六签：甲己下下
签诗：
何劳鼓瑟更吹笙 寸步如登万里程
彼此怀疑不相信 休将私意忆浓情
解析：
没关系，下次一定会成功的。成功是属于已经准备好的人。
工作升迁方面，别轻举妄动，现在的你不适合作任何改变。
问合伙事业，不是拆伙就是合伙不成的预兆。
问婚姻，也是没有成功的希望。
问功名，没有希望。
问疾病，难痊愈。
]],[[文昌帝君灵签第七签：甲庚大吉
签诗：
仙风道骨本天生 又遇仙宗为主盟
指日丹成谢岩谷 一朝引领向天行
解析：
棋差一着、缺临门一脚，就是你现在的状况，也许你自认为百分百，但是仍有些盲点没发现。可以藉由跟同学或好伙伴的讨论切磋，会再更上一层。上榜应该没问题。
]],[[文昌帝君灵签第八签：甲辛上上
签诗：
年来耕稼苦无收 今岁田畴定有秋
况遇太平无事日 士农工贾百无忧
解析：
今年的运气来了，也许就一开始答题不怎么顺利，但是会渐入佳境，上榜应该没问题的。
工作升迁方面，也是轮到你了，今年会是个丰收年。
先凶后吉之兆。即所谓否极泰来，时来运转是也。
问谋望，此签吉，喜庆来，问行人，即便回。
问疾病，当无灾。
问诉讼，先忧后喜。
]],[[文昌帝君灵签第九签：甲壬大吉
签诗：
望渠消息向长安 常把菱花仔细看
见说文书将入境 今朝喜色上眉端
解析：
今年的运气来了，如果你是考了几次的人，相信今年一定有所突破跟有好的结果。如果你是在等榜单，上榜应该没问题的。
工作升迁方面，可能不怎么顺利，如果升上去也会觉得是没有实质的权力。
期待已久的事情，将有眉目了！
问名利，必有好消息。
问行人，数日内即至。
问疾病，将痊愈。
]],[[文昌帝君灵签第十签：甲癸下下
签诗：
病患时时命蹇衰 何须打瓦共钻龟
直教重见一阳复 始可求神仗佛持
解析：
没关系，下次一定会成功的，只是你应该重新检视一下念书的方法，是不是正确的。健康作息也应该调整一下，不然考上了，也没有了健康的身体来继续完成未来的挑战。还有啊﹗做人不要太自私，如果一直觉得别人会超越你，一直闭门造车不跟其他人切磋，也许你觉得对的观念是有问题的，另外，要多行善，才有办法调整命运！
工作升迁方面，别轻举妄动，现在的你不适合作任何改变，对人处事要圆融一点。
要悔过，消去恶业，福果自来，当避害向善，慎勿妄动。
问事业财利，表示无利可图，宜守旧，莫贪求。
]],[[文昌帝君灵签第十一签：乙甲下下
签诗：
今年好事一番新 富贵荣华萃汝身
谁道机关难料处 到头独立转伤神
解析：
外在干扰不少，没关系，下次一定会成功的，只是你应该重新检视一下念书的方法与作息方式是不是正确，不然考上了也没有了健康的身体来继续完成未来的挑战。
工作升迁方面，别轻举妄动，现在的你不适合作任何改变。
不可只就表面看，到头来是祸患侵，伤精神。
问功名，未遂。
问财禄，平。
问诉讼，不利。
问婚姻，不吉。
]],[[文昌帝君灵签第十二签：乙乙中平
签诗：
营为期望在春前 谁料秋来又不然
直遇清江贵公子 一生活计始安全
解析：
模拟考或题库里的高分，并不代表一定会考上，所以仍然要注意，别掉以轻心。但是现在的你，熬夜跟作息都不正常，这样不好，也许到接近考试时，反而会体力崩溃，搞不好会考到打瞌睡。
工作升迁方面，也许一开始风评不好，但是只要你是有料的，还是会成功。
始吉终凶之兆。又表示先忧后疑，最后始定。
问诉讼，讼则终凶。
]],[[文昌帝君灵签第十三签：乙丙中平
签诗：
君今庚甲未亨通 且向江头作钓翁
玉兔重生应发迹 万人头上逞英雄
解析：
不用因为是不是念的资料不够或手边资料太少而患得患失，或担心来不及念完而熬夜。抱持平常心准备考试，相信应该会有好结果。如果过于心急而熬夜念书或没有规律的念书，反而事倍功半喔！
工作升迁方面，不需太急切，按部就班即可，别想要一步登天。
时运未通，只有守旧待时，不宜妄动。时运一到，自然名成利就。
问疾病，须拖延，但终能痊愈。
]],[[文昌帝君灵签第十四签：乙丁下下
签诗：
一见佳人便喜欢 谁知去后有多般
人情冷暖君休讶 历涉应知行路难
解析：
很多干扰影响读书的心情，是因为自己的定力不足所造成，也间接影响考试表现，宜多禅坐、念佛、行善，调整自己的身心。
工作升迁方面，别轻举妄动，现在的你不适合作任何改变。
有先喜后忧之兆，开始容易终则难，故不宜放肆，尤宜兢兢业业，以免后悔。
问疾病，忽喜忽忧。
]],[[文昌帝君灵签第十五签：乙戊中平
签诗：
两家门户各相当 不是姻缘莫较量
直待春风好消息 却请琴瑟向兰房
解析：
虽然很努力读书，但方法不对，成效有限，只要稍作改变，下次就会有成功的机会。
工作升迁方面，别轻举妄动，现在的你不适合作任何改变。
凡事须待新春，方始称意。若妄动，反劳心力，终不能如人心愿。
问功名，不成。
]],[[文昌帝君灵签第十六签：乙己下下
签诗：
官事悠悠难辨明 不如息了且归耕
傍人煽惑君休信 此事当谋亲兄弟
解析：
因为周遭人事因素，让您情绪低落、思绪紊乱，无心应考。继续努力不懈，下次应该会成功。
工作升迁方面，别轻举妄动，现在的你不适合作任何改变。
问诉讼，应和解。
误听信谗言。
问财运，莫贪求，投机终无利。
问婚姻，难得成功。
]],[[文昌帝君灵签第十七签：乙庚下下
签诗：
田园价贯好商量 事到公庭彼此伤
纵使机关图得胜 定为后世子孙殃
解析：
虽然努力准备，但是外在干扰不断，成效有限，别想用不好的方式来应考，那是没有意义且没有用的，要走正路多行善，会改运的。
工作升迁方面，别轻举妄动，现在的你不适合作任何改变。
做事只要依本份，循理而行，自然会得圆满的结果。反之，如果硬要图巧取胜，纵然目前获得一些小利益，将来会给子孙留下无穷祸因的。
问诉讼，宜彼此让步和解。
问功名，难如愿。
问财运，利未遂。宜安守，莫贪求，且谨慎，保安康。
]],[[文昌帝君灵签第十八签：乙辛中平
签诗：
知君指拟是空华 底事茫茫未有涯
牢把脚根踏实地 善为善应永无差
你目前所订定的读书目标是不切实际的，自以为准备很多，可是方向不对，应该好好重新检视一番，多跟师长同学讨论，看人家是怎么准备的，还有，勿以恶小而为之，人在做，天在看，多行善，才是正道。
]],[[文昌帝君灵签第十九签：乙壬上吉
签诗：
嗟子从来未得时 今年星运颇相宜
营求动作都如意 和合婚姻诞贵儿
解析：
考运不错喔！继续保持现况，相信应该会榜上题名。如果过于心急而熬夜念书或没有规律的念书，反而事倍功半喔！
]],[[文昌帝君灵签第二十签：乙癸下下
签诗：
一生心事向谁论 十八滩头说与君
世事尽从流水去 功名富贵等浮云
解析：
一切是因果的注定，你自以为怀才不遇，总以为别人不认同自己，可是从来不检讨自己的过失，这是你多生的前世所带来的问题，应该好好的忏悔，只有忏悔，才有改变的机会，考试也是一样。
工作升迁方面，别轻举妄动，现在的你不适合作任何改变。
怀才不遇，知音难寻，虽有满腹经纶，又有谁识货呢?放宽心胸吧，世事原来就是如此。那能尽如人意呢?
问旅行，要小心，路上恐有险阻。
问诉讼，凶多吉少。
问疾病，择医可愈。
问行人，归期尚远。
]],[[文昌帝君灵签第二十一签：丙甲下下
签诗：
与君夙昔结成冤 今日相逢那得缘
好把经文多讽诵 祈求户内保婵娟
解析：
外在干扰不断，影响考试心思。没关系，持续努力坚持下去，下次一定会成功的。
工作升迁方面，别轻举妄动，现在的你不适合作任何改变。
问婚姻，难能成功。
问事情，成功希望很少，乃宜守不宜动之象，并要防女人是非。
]],[[文昌帝君灵签第二十二签：丙乙上吉
签诗：
碧玉池中开白莲 庄严色相自天然
生来骨格超凡俗 正是人间第一仙
解析：
积极努力不迟疑，并以平常心准备考试，让您的所学完全发挥，相信一定能榜上有名。
工作升迁方面，要专心一致，要有耐心，这样才会有所收获。
要积极行动，不要迟疑不决。
问功名，有希望。
问事情，可成就。
问财利，有希望。
]],[[文昌帝君灵签第二十三签：丙丙下下
签诗：
花开花谢在春风 贵贱穷通百岁中
羡子荣华今已矣 到头万事总成空
解析：
虽然很努力，但是准备方向不对，成果有限。没关系，只要稍作调整，下次一定会成功的。
工作升迁方面，别轻举妄动，现在的你不适合作任何改变。
花无百日红，人无千日好。
问事情，有成有败，吉中有凶，否生于泰，名利似虚花。
]],[[文昌帝君灵签第二十四签：丙丁中平
签诗：
一春万事苦忧煎 夏里营求始帖然
更遇秋成冬至后 恰如骑鹤与腰缠
解析：
虽然花很多时间读书，但是不够专心，成效不彰。唯有专心一志，持续努力，相信成功是属于你的。
工作升迁方面，有如倒吃甘蔗越来越甜，别气馁，有耕耘必有收获。
先凶后吉，先苦后甘的启示。没有耕耘，那来的收获?
问名利，晚成。
问谋事，先难后易。
]],[[文昌帝君灵签第二十五签：丙戌中平
签诗：
寅午戌年多阻滞 亥子丑月渐亨嘉
更逢玉兔金鸡会 枯木逢春自放花
解析：
没关系，继续努力，下次一定会成功的，只是你应该重新检视一下念书的方法与准备的方向是不是正确的。
工作升迁方面，别轻举妄动，现在的你不适合作任何改变。
]],[[文昌帝君灵签第二十六签：丙己中吉
签诗：
年来丰歉皆天数 自是今年旱较多
与子定期三日内 田畴沾足雨滂沱
解析：
花不少时间念书，上榜边缘，只要再加把劲，努力不懈，持之以恒，上榜应该有你一份。
]],[[文昌帝君灵签第二十七签：丙庚下下
签诗：
世间万物皆有主 一粒一毫君莫取
英雄豪杰自天生 也须步步循规矩
解析：
成功是属于做好准备的人，所以只要努力做、认真学，步步踏实，下次一定会成功的。
工作升迁方面，别轻举妄动，现在的你不适合作任何改变。
富贵分定，切莫强求，若或妄取，必有后忧。只宜守分，不可妄为。
问谋事，不可以强凌弱，以富压贫，稍涉欺凌，反成灾害。
问诉讼，宜避免。
]],[[文昌帝君灵签第二十八签：丙辛上吉
签诗：
公侯将相本无种 好把勤劳契上天
人事尽从天理见 才高岂得困林泉
解析：
抱持平常心准备考试，让您完全发挥，相信努力了这么久的您，金榜题名应该是没问题。
工作升迁方面，多作善事，多帮助别人，可以提高成功的机率喔。
当下虽然未得际遇，但莫嗟叹，只要修心向善，好运马上到来。
问诉讼，能解决，但时间上恐较长。只要当事人合乎情理去做，不必忧虑。
问行人，不久即返。
问失物，有寻回的希望，只要全力去寻找。
]],[[文昌帝君灵签第二十九签：丙壬上上
签诗：
祖宗积德几多年 源远流长庆自然
苦更操修无倦已 天须还汝旧青毡
考运奇佳，如有神助，金榜题名没问题。
工作升迁方面，也是轮到你了，今年会是个丰收年。
积善之家必有余庆。
问功名，考试必中，功名有望。官员占得，表示将高升。
问诉讼，终得直。
问疾病，即将愈。
]],[[文昌帝君灵签第三十签：丙癸中吉
签诗：
奉公谨守莫欺心 自有亨通吉利临
目下营求且休矣 私期与子定佳音
解析：
别操之过急，一步一脚印，踏实准备。做人不要太自私，多多帮助他人做好事补点考运，上榜是指日可待。
工作升迁方面，有如倒吃甘蔗越来越甜，别气馁，有耕耘必有收获。
奉公守法，安份守己，不要做亏心事，自会有亨通吉利的好运来。目前求谋暂时不要躁进，等待秋天到来时，一定会有好消息的。
问疾病，宜服药。
问诉讼，宜和解。
]],[[文昌帝君灵签第三十一签：丁甲中吉
签诗：
秋冬作事只寻常 春到门庭渐吉昌
千里信音符远望 萱堂快乐未渠央
解析：
别操之过急，一步一脚印，踏实准备，成功是属于努力不懈、坚持到底的人。
]],[[文昌帝君灵签第三十二签：丁乙下下
签诗：
劳心泊泊竟何归 疾病兼多是与非
事到头来浑似梦 何如休要用心机
解析：
努力读书，但过度熬夜影响身体，间接影响考试表现。没关系，下次一定会成功的，只是你应该调整念书的方法与作息，不然考上了也没有了健康的身体来继续完成未来的挑战。
工作升迁方面，别轻举妄动，现在的你不适合作任何改变。
熙熙攘攘为名利，巧取豪夺何时休?
问事谋，不成，徒自劳心，口舌立至，祸患来侵，不如退步，安份守己，以保安宁。
问疾病，不利。
问诉讼，不好。
问财利，亦空。
]],[[文昌帝君灵签第三十三签：丁丙中平
签诗：
不分南北与西东 眼底昏昏耳似聋
熟读黄庭经一卷 不论贵贱与穷通
努力念书，上榜边缘，再努力一点，上榜应该有你一份。若能多做些善事，相信对提升考运是很有帮助的。
工作升迁方面，多注意自己的人际关系，有时睁一只眼闭一只眼、装聋作哑会比较好。
不管是东是西，是南是北，闭只眼，装聋作哑巴，何必去计较世俗的贵贱穷通呢。
问疾病，难愈。
]],[[文昌帝君灵签第三十四签：丁丁中平
签诗：
春夏才过秋又冬 纷纷谋虑搅心胸
贵人垂手来相援 休把私心情意浓
解析：
太多事务让你烦心而影响考试，不过有贵人指引你念书的方法与方向，持续努力，应有所获。
工作升迁方面，别轻举妄动，现在的你不适合作任何改变。
要有所成就，必须要除去私心。如果一年到头，只是斤斤计较一已的利害，不会有什么成就的。
问诉讼，必因彼此猜忌而起，如果能够诚意谈判，有和解的希望。
问疾病，不乐观。
]],[[文昌帝君灵签第三十五签：丁戊下下
签诗：
一山如画对清江 门里团圆事事双
谁料半途分析去 空帏无语对银缸
解析：
要注意交通事故，有可能因此错失考试时间，考运差，即便准备充分，也会因为外在因素，而成绩不理想。
工作升迁方面，别轻举妄动，现在的你不适合作任何改变。
风水虽吉，命运未通，家门招祸，好事成空，夫妻离散，骨肉西东，凡事不遂，有始无终。
问财利，必无。
问诉讼，必凶。
]],[[文昌帝君灵签第三十六签：丁己上吉
签诗：
功名富贵自能为 偶着仙鞭莫问伊
万里鹏程君有分 吴山顶上好钻龟
解析：
别操之过急，其实依你现在自己最舒服的步伐前进，相信绝对会有好结果。如果过于心急而熬夜念书或没有规律的念书，反而事倍功半喔。多多帮助他人，做好事补点考运，上榜是指日可待。
工作升迁方面，有如倒吃甘蔗越来越甜，别气馁，有耕耘必有收获。
不可躁进，欲速则不达。
问名利，在晚成。
问诉讼，得理。
]],[[文昌帝君灵签第三十七签：丁庚中平
签诗：
焚香来告复何辞 善恶平分汝自知
屏却昧公心里事 出门无碍是通时
解析：
做人不要太自私，如果一直觉得别人会超越你，一直闭门造车不跟其他人讨论，也许你觉得对的观念是有问题的。多多帮助他人做好事补点考运。
]],[[文昌帝君灵签第三十八签：丁辛下下
签诗：
蛩吟唧唧守孤帏 千里悬悬望信归
等得荣华公子到 秋冬括括雨霏霏
解析：
原来以为会考上的，其实不然，命中注定考运不彰，除非多行善，否则难改变。
工作升迁方面，别轻举妄动，现在的你不适合作任何改变。
表示希望落空，如梦幻般空欢喜一场而以。乃凶多吉少之兆。
问谋为，不遂意，空自惆怅，纵有虚喜，终是大忧。
问疾病，恐生不测，主有死亡之虞。
]],[[文昌帝君灵签第三十九签：丁壬下下
签诗：
北山门下好安居 若问终时慎厥初
堪笑包藏许多事 鳞鸿虽便莫修书
解析：
心存侥幸，准备不足，表现自然难如所望，不要被坏朋友影响，调整自己心态，努力准备，或许尚有成功的机会。
工作升迁方面，别轻举妄动，现在的你不适合作任何改变。
只宜守旧，不可妄想。投机事业决不可做，否则必败无疑。营谋事业，事先要有问疾病，宜择医。
]],[[文昌帝君灵签第四十签：丁癸上吉
签诗：
新来换得好规模 何用随他步与趋
只听耳边消息到 崎岖历尽见亨衢
解析：
注意自己念书的方向、工具是否正确，然后努力去作准备，如果万事都具备了，再难的情况也难不倒你，相信你会有所成就的。
工作升迁方面，有自己的主见比较重要，也许太多的意见反而会模糊你自己的焦点。
一切作为要自己作主，要走到人家前面，才会有成就。如果一昧跟随他人，那是没有用的。
问疾病，可痊愈。
]],[[文昌帝君灵签第四十一签：戊甲中吉
签诗：
自南自北自东西 欲到天涯谁作梯
遇鼠逢牛三弄笛 好将姓名榜头题
解析：
不能什么都要靠别人，要学习独立自主的精神，自己不努力，即使有福报，也难有一番成就，只要把该作的事尽力做到好，贵人自会出现，上榜是指日可待。
工作升迁方面，有如倒吃甘蔗越来越甜，别气馁，有耕耘必有收获。
先难后易！
问名利，先难后成。
问疾病，择医终愈。
]],[[文昌帝君灵签第四十二签：戊乙中吉
签诗：
我曾许汝事和谐 谁料修为汝自乖
但改新图莫依旧 营谋应得称心怀
解析：
你是有福份的人，命中注定是会考上理想学校的，只是你用错了方法，现在只有改变你现有的方式，多请教师长、朋友，切勿自以为是而闭门造车，上榜是指日可待。
工作升迁方面，也许常有决策错误或不妥的地方，只要改善粗心缺点，这些错误的经验都是助力。
人非圣贤，孰能无过，过而能改，善莫大焉。
问事业，宜改图，或更换设备，守旧则没有发展的希望。
]],[[文昌帝君灵签第四十三签：戊丙中吉
签诗：
一纸官书火急催 扁舟速下浪如雷
虽然目下多惊险 保汝平安去复回
解析：
不管读书地点不佳或周遭人事的干扰，只要持续你的毅力，用坚定的步伐走下去，会有好结果的，切莫过于心急，熬夜念书或没有规律的念书，反而事倍功半喔，多多行善，做好事补点考运，上榜是指日可待。
工作升迁方面，有如倒吃甘蔗越来越甜，别气馁，有耕耘必有收获。
先凶后吉之兆。
问谋望，目前虽然障碍重重。只要毅力去克服，终究会成功。
]],[[文昌帝君灵签第四十四签：戊丁中平
签诗：
汝是人中最吉人 误为误作损精神
坚牢一念酬香愿 富贵荣华萃汝身
解析：
不要因为一些琐事而扰乱了你准备考试的思绪，应该专心一意，努力冲刺，相信一定会有金榜题名的机会。
工作升迁方面，也许常有决策错误或不妥的地方，只要改善粗心缺点，这些错误的经验都是助力。
万事皆从忙里错，但将心地细思量，若能谨守无他望，可保终身大吉昌。
问事业，须重新检讨，把错处改过，自然顺利。
问诉讼，宜忍让，最好和解。
]],[[文昌帝君灵签第四十五签：戊戊中平
签诗：
好将心地力耕耘 彼此山头总是坟
阴地不如心地好 修为到底却输君
解析：
不要为别人读书，否则无法表现出你完整实力。只需调整心态，继续努力，上榜是指日可待的。
工作升迁方面，脚踏实地，别想一步登天。多注意自己的人际关系，改掉一些恶习，好运就会跟着来。
不可妄求，但依本分，方得天之保佑。
问地利，不宜迁改。
问行人，必至。
问疾病，则安。
问财利，目前无，且宜守旧。
]],[[文昌帝君灵签第四十六签：戊己中平
签诗：
君是山中万户侯 信知骑马胜骑牛
今朝马上看山色 争似骑牛得自由
解析：
你是有聪明才智的，可是再聪明的人基本功也要扎实，脚踏实地，不要想一步登天。一步一脚印，努力往前进，成功就在不远的地方了。
工作升迁方面，别轻举妄动，现在的你不适合作任何改变。
凡事如果投机取巧，到时必会弄巧成拙。安分守己，以静制动，事方有成，并可免灾祸。
问远行，必有阻滞。
问诉讼，必凶。
]],[[文昌帝君灵签第四十七签：戊庚下下
签诗：
与君万语复千言 只欲平和雪尔冤
讼则终凶君记取 试于清夜把心扪
解析：
记住！千万不要浮躁，只要心定下来，任何外在的干扰，会影响应考思绪的任何因素，都干扰不了你，但是心要定下来谈何容易！多就教高手、老师，多向别人请益，多忏悔自己的字以为是的个性，你还是有机会的！。
工作升迁方面，别轻举妄动，现在的你不适合作任何改变。
要求免祸，必须自身谨慎修省，只要心地善良，祸端自然消灭于无形。
问兴讼，不利，讼则终凶，应自反省。
]],[[文昌帝君灵签第四十八签：戊辛中平
签诗：
登山涉水正天寒 兄弟姻亲那得安
幸遇虎头人一唤 全家遂保汝重欢
解析：
虽然你是天不时、地不利、人不合，但有会有贵人指引你念书的方法与方向，只要能依循着来做，努力不懈，上榜是指日可待。
]],[[文昌帝君灵签第四十九签：戊壬下下
签诗：
彼此家居只一山 如何似隔鬼门关
日月如梭人易老 许多劳碌不如闲
解析：
周遭人事或家中因素干扰不断，影响考试结果。没关系，继续努力，下次一定会成功的。
]],[[文昌帝君灵签第五十签：戊癸上平
签诗：
人说今年胜旧年 也须步步要周旋
一家和气多生福 萋菲谗言莫听偏
解析：
今年考运不错，不用人云亦云，按照个人的进度准备就可以了。更不用因为是不是念的资料不够或手边资料太少而患得患失，或担心来不及念完而熬夜。
工作升迁方面，有自己的主见比较重要，也许太多的意见，反而会模糊你自己的焦点。
只要把握住方针，不听信谗言，谋事可就。
问疾病，得愈。
]],[[文昌帝君灵签第五十一签：己甲上吉
签诗：
君今百事且随缘 水到渠成听自然
莫叹年来不如意 喜逢新运称心田
解析：
今年考运不错，别操之过急，一步一脚印，踏实准备。其实依你现在自己最舒服的步伐前进，相信绝对会有好结果。如果过于心急而熬夜念书或没有规律的念书，反而事倍功半喔。多多帮助他人，做好事补点考运，上榜是指日可待。
工作升迁方面，脚踏实地，别想一步登天。多注意自己的人际关系，改掉一些恶习，好运就会跟着来。
]],[[文昌帝君灵签第五十二签：己乙上吉
签诗：
兀坐幽居叹寂寥 孤灯掩映度清宵
万金忽报秋光好 活计扁舟渡北朝
解析：
今年的考运极佳，如有神助，如果你是考了几次的人，相信今年一定有所突破跟有好的结果。如果你是今年初试啼声或是第一次参与考试的人，也许就一开始答题不怎么顺利，但是会渐入佳境，上榜绝对没问题的。
工作升迁方面也是轮到你了，今年会是个丰收年。
十年寒窗无人闻，一举成名天下知。
问功名，上吉。
问婚姻，有成功的希望。
]],[[文昌帝君灵签第五十三签：己丙下下
签诗：
艰难险阻路蹊跷 南鸟孤飞依北巢
今日贵人曾识面 相逢却在夏秋交
解析：
准备方向不对，影响考试表现。不要闭门造车，多与你身边的同学伙伴切磋或向师长请教，会有很大进步空间，下次一定会成功的。
工作升迁方面，别轻举妄动，现在的你不适合作任何改变。
现在仍然不得志，自己虽吃了不少苦，还是一无所成。不过，从今天起，你开始转运了，到夏秋之交，会有好消息的。
]],[[文昌帝君灵签第五十四签：己丁中平
签诗：
万人丛里逞英豪 便欲飞腾霄汉高
争奈承流风未便 青灯黄卷且勤劳
解析：
你有满腹的雄心壮志，也准备得非常齐全，无奈考运并不佳，只好再等待时机，如果你想突破现状，唯有行善积德一途。
工作升迁方面，别轻举妄动，现在的你不适合作任何改变。
虽有大的抱负，但是没有机会让你表现，只好韬光隐晦，多充实自己。
问功名，没有希望。
问新营事业或扩张业务，时机不好，徒劳心力，最好仍守旧。
]],[[文昌帝君灵签第五十五签：己戊中平
签诗：
勤耕力作莫蹉跎 衣食随时安分过
纵使经商收倍利 不如逐岁廪禾多
解析：
别操之过急，一步一脚印，踏实准备。依循自己的步调，持续努力，成功最后还是属于你的。
工作升迁方面，脚踏实地，别想一步登天。多注意自己的人际关系，改掉一些恶习，好运就会跟着来。
有一份耕耘，终有一分收获，何必去羡慕人家的豪取巧夺呢?投机取巧，终有一天，会身败名裂，还不如安分守己，来得长远受益。
问诉讼，宜和解。
]],
}

draws = {
    main = main_deck,
    explain = explain_deck,
}
return draws
