main_deck = {
    [[浅草寺观音签第一签　大吉
七宝浮图塔
高峰顶上安
众人皆仰望
莫作等闲看]],
    [[浅草寺观音签第二签　小吉
月被浮云翳
立事自昏迷
幸乞阴公祐
何虑不开眉]],
    [[浅草寺观音签第三签　凶
愁恼损忠良
青宵一炷香
虽然防小过
闲虑觉时长]],
    [[浅草寺观音签第四签　吉
累有兴云志
君恩禄未封
若逢侯手印
好事始总总]],
    [[浅草寺观音签第五签　凶
家道未能昌
危危保祸殃
暗云侵月桂
佳人一炷香]],
    [[浅草寺观音签第六签　末吉
宅墓鬼凶多
人事有爻讹
伤财防损失
祈福始中和]],
    [[浅草寺观音签第七签　凶
登舟待便风
月色暗朦胧
欲辗香轮去
高山千万重]],
    [[浅草寺观音签第八签　大吉
勿头中见尾
文华须得理
禾刀自偶然
当遇非常喜]],
    [[浅草寺观音签第九签　大吉
有名须得遇
三望一朝迁
贵人来指处
华果应时鲜]],
    [[浅草寺观音签第十签　大吉
旧用多成破
新更始见财
改求云外望
枯木遇春开]],
    [[浅草寺观音签第十一签　大吉
有禄兴家业
文华达帝都
云中乘好箭
兼得贵人扶]],
    [[浅草寺观音签第十二签　大吉
杨柳遇春时
残花发旧枝
重重霜雪里
黄金色更辉]],
    [[浅草寺观音签第十三签　大吉
手把大阳辉
东君发旧枝
稼苗方欲秀
犹更上云梯]],
    [[浅草寺观音签第十四签　末吉
玉石未分时
忧心转更悲
前途通大道
花发应残枝]],
    [[浅草寺观音签第十五签　凶
年乖数亦孤
久病未能苏
岸危舟未发
龙卧失明珠
]],
    [[浅草寺观音签第十六签　吉
破改重成望
前途喜亦宁
贵人相助处
禄马照前程]],
    [[浅草寺观音签第十七签　凶
怪异防忧恼
人宅见分离
惜华还值雨
杯酒惹闲非]],
    [[浅草寺观音签第十八签　吉
离暗出明时
麻衣变绿衣
旧忧终是退
遇禄应交辉]],
    [[浅草寺观音签第十九签　末小吉
家道生荆棘
儿孙防虎威
香前祈福厚
方得免分离]],
    [[浅草寺观音签第二十签　吉
月出渐分明
家财每每兴
何言先有滞
更变立功名]],
    [[浅草寺观音签第二十一签　吉
洗出经年否
光华得再清
所求终吉利
重日照前程]],
    [[浅草寺观音签第二十二签　吉
渐渐浓云散
看看月再明
逢春华果秀
雨过竹重青]],
    [[浅草寺观音签第二十三签　吉
红云随步起
一箭中青霄
鹿行千里远
争知去路遥]],
    [[浅草寺观音签第二十四签　凶
三女莫相逢
盟言说未通
门里心肝挂
缟素子重重]],
    [[浅草寺观音签第二十五签　吉
枯木逢春生
前途必利亨
亦得佳人箭
乘车禄自行]],
    [[浅草寺观音签第二十六签　吉
将军有异声
进兵万里程
争知临敌处
道胜却虚名]],
    [[浅草寺观音签第二十七签　吉
望禄应重山
花红喜悦颜
举头看皎月
渐出黑云间]],
    [[浅草寺观音签第二十八签　凶
意速无船渡
波深必误身
切须回旧路
方可免灾迍]],
    [[浅草寺观音签第二十九签　吉
忧轗渐消融
求名得再通
宝财临禄位
当遇主人公]],
    [[浅草寺观音签第三十签　半吉
仙鹤立高枝
防他暗箭亏
井畔刚刀利
户内更防危]],
    [[浅草寺观音签第三十一签　末吉
鲲鲸未变时
且守碧潭溪
风云兴巨浪
一息过天涯]],
    [[浅草寺观音签第三十二签　吉
似玉藏深石
休将故眼看
一朝良匠别
方见宝光寒]],
    [[浅草寺观音签第三十三签　吉
枯木逢春艳
芳菲再发林
云间方见月
前遇贵人钦]],
    [[浅草寺观音签第三十四签　吉
腊木春将至
芳菲喜再新
鲲鲸兴巨浪
举钩禄为真]],
    [[浅草寺观音签第三十五签　吉
射鹿须乘箭
故僧引路归
遇道同仙籍
光华映晚晖]],
    [[浅草寺观音签第三十六签　末吉
先损后有益
如月之剥蚀
玉兔待重生
光华当满室]],
    [[浅草寺观音签第三十七签　半吉
阴叆未能通
求名亦未逢
幸然须有变
一箭中双鸿]],
    [[浅草寺观音签第三十八签　半吉
月照天书静
云生雾彩霞
久想离庭客
无事惹咨嗟]],
    [[浅草寺观音签第三十九签　凶
望用方心腹
家乡被火灾
忧危三五度
由损断头财]],
    [[浅草寺观音签第四十签　末小吉
中正方成道
奸邪恐惹愆
壶中盛妙药
非久去烦煎]],
    [[浅草寺观音签第四十一签　末吉
有物不周旋
须防损半边
家乡烟火里
祈福始安然]],
    [[浅草寺观音签第四十二签　吉
桂华春将到
云天好进程
贵人相遇处
暗月再分明]],
    [[浅草寺观音签第四十三签　吉
月桂将相满
追鹿映山溪
贵人乘远箭
好事始相宜]],
    [[浅草寺观音签第四十四签　吉
盘中黑白子
一著要先机
天龙降甘泽
喜出旧根基]],
    [[浅草寺观音签第四十五签　吉
有意兴高显
禄马引前程
得遇云中箭
芝兰满路生]],
    [[浅草寺观音签第四十六签　凶
雷发震天昏
佳人独掩门
交加文书上
无事也遭迍]],
    [[浅草寺观音签第四十七签　吉
更望身前立
何期在晚成
若遇重山去
财禄自相迎]],
    [[浅草寺观音签第四十八签　小吉
见禄隔前溪
劳心休更迷
一朝逢好渡
鸾凤入云飞]],
    [[浅草寺观音签第四十九签　吉
正好中秋月
蟾蜍皎洁间
暗云知何处
故故两相攀]],
    [[浅草寺观音签第五十签　吉
有达宜更变
重山利政逢
前途相偶合
财禄保亨通]],
    [[浅草寺观音签第五十一签　吉
修进甚功辛
劳生未得时
腾身游碧汉
方得遇高枝]],
    [[浅草寺观音签第五十二签　凶
有僭须惹讼
兼有事交加
门里防人危
灾临莫叹嗟]],
    [[浅草寺观音签第五十三签　吉
久困渐能安
云书降印权
残花终结实
时亨禄自迁]],
    [[浅草寺观音签第五十四签　凶
身同意不同
月蚀暗长空
轮虽常在手
鱼水未相逢]],
    [[浅草寺观音签第五十五签　吉
云散月重明
天书得志诚
虽然多阻滞
花发再重荣]],
    [[浅草寺观音签第五十六签　末小吉
生涯喜又忧
未老先白头
劳心千百度
芳遇贵人留]],
    [[浅草寺观音签第五十七签　吉
欲渡长江阔
波深未自俦
前津逢浪静
重整钩鳌钩]],
    [[浅草寺观音签第五十八签　凶
有径江海隔
车行峻岭危
亦防多进退
犹恐小人亏]],
    [[浅草寺观音签第五十九签　凶
去住心无定
行藏亦未宁
一轮清皎洁
却被黑云乘]],
    [[浅草寺观音签第六十签　小吉
高危安可涉
平坦是延年
守道当逢泰
风云不偶然]],
    [[浅草寺观音签第六十一签　半吉
旧愆何日解
户内保婵娟
要逢十一口
遇鼠过牛边]],
    [[浅草寺观音签第六十二签　大吉
灾轗时时退
名显四方扬
改故重乘禄
昴高福自昌]],
    [[浅草寺观音签第六十三签　凶
何故生荆棘
家人意渐疏
久困重轮下
黄金未出渠]],
    [[浅草寺观音签第六十四签　凶
安居且虑危
情深主别离
风飘波浪急
鸳鸯各自飞]],
    [[浅草寺观音签第六十五签　末吉
苦病兼防辱
乘危亦未苏
若见一阳后
方可作良图]],
    [[浅草寺观音签第六十六签　凶
水滞少波涛
飞鸿落羽毛
重忧心绪乱
闲事惹风骚]],
    [[浅草寺观音签第六十七签　凶
枯木未生枝
独步上云岐
岂知身未稳
独自惹闲非]],
    [[浅草寺观音签第六十八签　吉
异梦生英杰
前来事可疑
芳菲春日暖
依旧发残枝]],
    [[浅草寺观音签第六十九签　凶
明月暗云浮
花红一半枯
惹事伤心处
行舟莫远图]],
    [[浅草寺观音签第七十签　凶
雷发庭前草
炎火向天飞
一心来赶禄
争奈掩朱扉]],
    [[浅草寺观音签第七十一签　凶
道业未成时
何期两不宜
事烦心绪乱
翻做徘徊思]],
    [[浅草寺观音签第七十二签　吉
户内防重厄
花果见分枝
严霜才过后
方可始相宜]],
    [[浅草寺观音签第七十三签　吉
久暗渐分明
登江绿水澄
芝书从远降
终得异人成]],
    [[浅草寺观音签第七十四签　凶
蛇虎正交罗
牛生二尾多
交岁方成庆
上下不能和]],
    [[浅草寺观音签第七十五签　凶
孤舟欲过岸
浪急渡人空
女人立流水
望月意情浓]],
    [[浅草寺观音签第七十六签　吉
富贵天之祐
何须苦用心
前程应显迹
久用得高临]],
    [[浅草寺观音签第七十七签　凶
累滞未能苏
求名莫远图
登舟波浪急
咫尺隔天衢]],
    [[浅草寺观音签第七十八签　大吉
但存公道正
何愁理去忠
松柏苍苍翠
前山禄马重]],
    [[浅草寺观音签第七十九签　吉
残月未还光
樽前非语伤
户中有人厄
祈福保青阳]],
    [[浅草寺观音签第八十签　大吉
深山多养道
忠正帝王宣
凤遂鸾飞去
升高过九天]],
    [[浅草寺观音签第八十一签　小吉
道合须成合
先忧事更多
所求财宝盛
更变得中和]],
    [[浅草寺观音签第八十二签　凶
火发应连天
新愁惹旧愆
欲求千里外
要渡更无船]],
    [[浅草寺观音签第八十三签　凶
举步出云端
高枝未可攀
升头看皎月
犹在黑云间]],
    [[浅草寺观音签第八十四签　凶
否极方无泰
花开值晚秋
人情不调备
财宝鬼来偷]],
    [[浅草寺观音签第八十五签　大吉
望用何愁晚
求名渐得宁
云梯终有望
归路入蓬瀛]],
    [[浅草寺观音签第八十六签　大吉
花发应阳台
车行进宝财
执文朝帝殿
走马听声雷]],
    [[浅草寺观音签第八十七签　大吉
凿石方逢玉
淘沙始见金
青霄终有路
只恐不坚心]],
    [[浅草寺观音签第八十八签　凶
作事不和同
临危更主凶
佳人生苦根
闲虑两三重]],
    [[浅草寺观音签第八十九签　大吉
一片无瑕玉
从今好琢磨
得遇高人识
方逢喜气多]],
    [[浅草寺观音签第九十签　大吉
一信向天飞
秦川舟自归
前途成好事
应得贵人推]],
    [[浅草寺观音签第九十一签　吉
改变前途去
月桂又逢圆
云中乘禄至
凡事可宜先]],
    [[浅草寺观音签第九十二签　吉
自幼常为旅
逢春骏马骄
前程宜进步
得箭降青霄]],
    [[浅草寺观音签第九十三签　吉
有鱼临旱池
跳跃入波涛
隔中须有望
先且虑尘劳]],
    [[浅草寺观音签第九十四签　半吉
事忌樽前语
人防小辈交
幸乞阴公祐
方免事敌爻]],
    [[浅草寺观音签第九十五签　吉
志气勤修业
禄位未造逢
若闻金鸡语
乘船得便风]],
    [[浅草寺观音签第九十六签　大吉
鸡逐凤同飞
高林整羽仪
桌舟须济岸
宝货满船归]],
    [[浅草寺观音签第九十七签　凶
雾罩重楼屋
佳人水上行
白云归去路
不见月波澄]],
    [[浅草寺观音签第九十八签　凶
欲理新丝乱
闲愁足是非
只困罗网里
相见几人悲]],
    [[浅草寺观音签第九十九签　大吉
红日当门照
暗月再重圆
遇珍须得宝
颇有称心田]],
    [[浅草寺观音签第一百签　凶
禄走白云间
携琴走远山
不遇神仙面
空惹意阑珊]],
}

function get_draw(msg)
    math.randomseed(msg.fromQQ+getUserToday(msg.fromQQ,"jrrp")*101)
    local res_index = math.random(100)
    return "{self}今日为{nick}求到了\n"..main_deck[res_index]
end

draws = {
    main = main_deck,
    explain = explain_deck,
    getDraw = get_draw,
}
return draws